[
  {"id":"abdulTrendsTrajectoriesExplainable2018","abstract":"Advances in artificial intelligence, sensors and big data management have far-reaching societal impacts. As these systems augment our everyday lives, it becomes increasing-ly important for people to understand them and remain in control. We investigate how HCI researchers can help to develop accountable systems by performing a literature analysis of 289 core papers on explanations and explaina-ble systems, as well as 12,412 citing papers. Using topic modeling, co-occurrence and network analysis, we mapped the research space from diverse domains, such as algorith-mic accountability, interpretable machine learning, context-awareness, cognitive psychology, and software learnability. We reveal fading and burgeoning trends in explainable systems, and identify domains that are closely connected or mostly isolated. The time is ripe for the HCI community to ensure that the powerful new autonomous systems have intelligible interfaces built-in. From our results, we propose several implications and directions for future research to-wards this goal.","accessed":{"date-parts":[[2020,9,18]]},"author":[{"family":"Abdul","given":"Ashraf"},{"family":"Vermeulen","given":"Jo"},{"family":"Wang","given":"Danding"},{"family":"Lim","given":"Brian Y."},{"family":"Kankanhalli","given":"Mohan"}],"collection-title":"CHI '18","container-title":"Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems","DOI":"10.1145/3173574.3174156","event-place":"New York, NY, USA","ISBN":"978-1-4503-5620-6","issued":{"date-parts":[[2018,4,21]]},"page":"1–18","publisher":"Association for Computing Machinery","publisher-place":"New York, NY, USA","source":"ACM Digital Library","title":"Trends and Trajectories for Explainable, Accountable and Intelligible Systems: An HCI Research Agenda","title-short":"Trends and Trajectories for Explainable, Accountable and Intelligible Systems","type":"paper-conference","URL":"https://doi.org/10.1145/3173574.3174156"},
  {"id":"adlerHowReadBook1972","author":[{"family":"Adler","given":"Mortimer Jerome"},{"family":"Van Doren","given":"Charles"}],"call-number":"PN83 .A43 1972","edition":"Rev. and updated ed","event-place":"New York","ISBN":"978-0-671-21280-3 978-0-671-21209-4","issued":{"date-parts":[[1972]]},"number-of-pages":"426","publisher":"Simon and Schuster","publisher-place":"New York","source":"Library of Congress ISBN","title":"How to read a book","type":"book"},
  {"id":"AdoptionElectronicHealth","abstract":"This brief uses data from the American Hospital Association to describe trends in adoption of EHR technology among non-federal acute care hospitals from 2008 to 2015. It tracks the adoption of Basic EHR systems and the possession of certified EHR technology.","accessed":{"date-parts":[[2020,9,10]]},"title":"Adoption of Electronic Health Record Systems among U.S. Non-Federal Acute Care Hospitals: 2008-2015","title-short":"Adoption of Electronic Health Record Systems among U.S. Non-Federal Acute Care Hospitals","type":"webpage","URL":"/evaluations/data-briefs/non-federal-acute-care-hospital-ehr-adoption-2008-2015.php"},
  {"id":"ahrensHowTakeSmart2017","author":[{"family":"Ahrens","given":"Sönke"}],"event-place":"North Charleston, SC","ISBN":"978-1-5428-6650-7","issued":{"date-parts":[[2017]]},"language":"eng","number-of-pages":"170","publisher":"CreateSpace","publisher-place":"North Charleston, SC","source":"Gemeinsamer Bibliotheksverbund ISBN","title":"How to take smart notes: one simple technique to boost writing, learning and thinking: for students, academics and nonfiction book writers","title-short":"How to take smart notes","type":"book"},
  {"id":"akulovWebPerformance101","abstract":"Learn how (and why) to make your app faster by optimizing JS, CSS, images/fonts and other things","accessed":{"date-parts":[[2020,6,26]]},"author":[{"family":"Akulov","given":"Ivan"}],"container-title":"PerfPerfPerf","source":"3perf.com","title":"Web Performance 101: JS, CSS, HTTP, images & fonts","title-short":"Web Performance 101","type":"webpage","URL":"https://3perf.com/talks/web-perf-101/"},
  {"id":"alonsoViewingPersonalHistory1998","abstract":"Thirty-six participants used a static version of either LifeLines, a graphical interface, or a Tabular representation to answer questions about a database of temporal personal history information. Results suggest that overall the LifeLines representation led to much faster response times, primarily for questions which involved interval comparisons and making intercategorical connections. A \"first impression\" test showed that LifeLines can reduce some of the biases of the tabular record summary. A post-experimental memory test led to significantly (p<.004) higher recall for LifeLines. Finally, simple interaction techniques are proposed to compensate for the problems of the static LifeLines display's ability to deal with precise dates, attribute coding and overlaps. INTRODUCTION The way in which temporal data is represented has a dramatic effect on the way we interpret and use those data. Metaphors and analogies have been used quite effectively to aid the user and provide a mental model...","author":[{"family":"Alonso","given":"Diane"},{"family":"Rose","given":"Anne"},{"family":"Plaisant","given":"Catherine"},{"family":"Norman","given":"Kent"}],"container-title":"Behaviour and Information Technology","container-title-short":"Behaviour and Information Technology","DOI":"10.1080/014492998119328","issued":{"date-parts":[[1998,12,19]]},"source":"ResearchGate","title":"Viewing personal history records: A comparison of Tabular format and graphical presentation using LifeLines","title-short":"Viewing personal history records","type":"article-journal","volume":"17"},
  {"id":"amershiEffectiveEnduserInteraction2011","abstract":"End-user interactive machine learning is a promising tool for enhancing human productivity and capabilities with large unstructured data sets. Recent work has shown that we can create end-user interactive machine learning systems for specific applications. However, we still lack a generalized understanding of how to design effective end-user interaction with interactive machine learning systems. This work presents three explorations in designing for effective end-user interaction with machine learning in CueFlik, a system developed to support Web image search. These explorations demonstrate that interactions designed to balance the needs of end-users and machine learning algorithms can significantly improve the effectiveness of end-user interactive machine learning.","accessed":{"date-parts":[[2020,11,9]]},"author":[{"family":"Amershi","given":"Saleema"},{"family":"Fogarty","given":"James"},{"family":"Kapoor","given":"Ashish"},{"family":"Tan","given":"Desney"}],"collection-title":"AAAI'11","container-title":"Proceedings of the Twenty-Fifth AAAI Conference on Artificial Intelligence","event-place":"San Francisco, California","issued":{"date-parts":[[2011,8,7]]},"page":"1529–1532","publisher":"AAAI Press","publisher-place":"San Francisco, California","source":"ACM Digital Library","title":"Effective end-user interaction with machine learning","type":"paper-conference"},
  {"id":"amershiGuidelinesHumanAIInteraction2019","abstract":"Advances in artificial intelligence (AI) frame opportunities and challenges for user interface design. Principles for human-AI interaction have been discussed in the human-computer interaction community for over two decades, but more study and innovation are needed in light of advances in AI and the growing uses of AI technologies in human-facing applications. We propose 18 generally applicable design guidelines for human-AI interaction. These guidelines are validated through multiple rounds of evaluation including a user study with 49 design practitioners who tested the guidelines against 20 popular AI-infused products. The results verify the relevance of the guidelines over a spectrum of interaction scenarios and reveal gaps in our knowledge, highlighting opportunities for further research. Based on the evaluations, we believe the set of design guidelines can serve as a resource to practitioners working on the design of applications and features that harness AI technologies, and to researchers interested in the further development of human-AI interaction design principles.","accessed":{"date-parts":[[2020,10,14]]},"author":[{"family":"Amershi","given":"Saleema"},{"family":"Weld","given":"Dan"},{"family":"Vorvoreanu","given":"Mihaela"},{"family":"Fourney","given":"Adam"},{"family":"Nushi","given":"Besmira"},{"family":"Collisson","given":"Penny"},{"family":"Suh","given":"Jina"},{"family":"Iqbal","given":"Shamsi"},{"family":"Bennett","given":"Paul N."},{"family":"Inkpen","given":"Kori"},{"family":"Teevan","given":"Jaime"},{"family":"Kikin-Gil","given":"Ruth"},{"family":"Horvitz","given":"Eric"}],"collection-title":"CHI '19","container-title":"Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems","DOI":"10.1145/3290605.3300233","event-place":"New York, NY, USA","ISBN":"978-1-4503-5970-2","issued":{"date-parts":[[2019,5,2]]},"page":"1–13","publisher":"Association for Computing Machinery","publisher-place":"New York, NY, USA","source":"ACM Digital Library","title":"Guidelines for Human-AI Interaction","type":"paper-conference","URL":"https://doi.org/10.1145/3290605.3300233"},
  {"id":"amershiOverviewBasedExample2009","abstract":"Interaction with large unstructured datasets is difficult because existing approaches, such as keyword search, are not always suited to describing concepts corresponding to the distinctions people want to make within datasets. One possible solution is to allow end-users to train machine learning systems to identify desired concepts, a strategy known as interactive concept learning. A fundamental challenge is to design systems that preserve end-user flexibility and control while also guiding them to provide examples that allow the machine learning system to effectively learn the desired concept. This paper presents our design and evaluation of four new overview-based approaches to guiding example selection. We situate our explorations within CueFlik, a system examining end-user interactive concept learning in Web image search. Our evaluation shows our approaches not only guide end-users to select better training examples than the best-performing previous design for this application, but also reduce the impact of not knowing when to stop training the system. We discuss challenges for end-user interactive concept learning systems and identify opportunities for future research on the effective design of such systems.","accessed":{"date-parts":[[2020,11,9]]},"author":[{"family":"Amershi","given":"Saleema"},{"family":"Fogarty","given":"James"},{"family":"Kapoor","given":"Ashish"},{"family":"Tan","given":"Desney"}],"container-title":"Proceedings of the 22nd annual ACM symposium on User interface software and technology - UIST '09","DOI":"10.1145/1622176.1622222","event":"the 22nd annual ACM symposium","event-place":"Victoria, BC, Canada","ISBN":"978-1-60558-745-5","issued":{"date-parts":[[2009]]},"language":"en","page":"247","publisher":"ACM Press","publisher-place":"Victoria, BC, Canada","source":"DOI.org (Crossref)","title":"Overview based example selection in end user interactive concept learning","type":"paper-conference","URL":"http://portal.acm.org/citation.cfm?doid=1622176.1622222"},
  {"id":"amershiPowerPeopleRole2014","accessed":{"date-parts":[[2020,11,9]]},"author":[{"family":"Amershi","given":"Saleema"},{"family":"Cakmak","given":"Maya"},{"family":"Knox","given":"William Bradley"},{"family":"Kulesza","given":"Todd"}],"container-title":"AI Magazine","container-title-short":"AIMag","DOI":"10.1609/aimag.v35i4.2513","ISSN":"2371-9621","issue":"4","issued":{"date-parts":[[2014,12,22]]},"language":"en","number":"4","page":"105-120","source":"ojs.aaai.org","title":"Power to the People: The Role of Humans in Interactive Machine Learning","title-short":"Power to the People","type":"article-journal","URL":"https://ojs.aaai.org/index.php/aimagazine/article/view/2513","volume":"35"},
  {"id":"andyWhyBooksDon2019","abstract":"Designing media to reflect how people think and learn","accessed":{"date-parts":[[2020,6,1]]},"author":[{"family":"Andy","given":"Matuschak"}],"issued":{"date-parts":[[2019]]},"source":"andymatuschak.org","title":"Why books don't work","type":"article-journal","URL":"https://andymatuschak.org/books"},
  {"id":"arndtTetheredEHRPrimary2017","abstract":"PURPOSE: Primary care physicians spend nearly 2 hours on electronic health record (EHR) tasks per hour of direct patient care. Demand for non-face-to-face care, such as communication through a patient portal and administrative tasks, is increasing and contributing to burnout. The goal of this study was to assess time allocated by primary care physicians within the EHR as indicated by EHR user-event log data, both during clinic hours (defined as 8:00 am to 6:00 pm Monday through Friday) and outside clinic hours.\nMETHODS: We conducted a retrospective cohort study of 142 family medicine physicians in a single system in southern Wisconsin. All Epic (Epic Systems Corporation) EHR interactions were captured from \"event logging\" records over a 3-year period for both direct patient care and non-face-to-face activities, and were validated by direct observation. EHR events were assigned to 1 of 15 EHR task categories and allocated to either during or after clinic hours.\nRESULTS: Clinicians spent 355 minutes (5.9 hours) of an 11.4-hour workday in the EHR per weekday per 1.0 clinical full-time equivalent: 269 minutes (4.5 hours) during clinic hours and 86 minutes (1.4 hours) after clinic hours. Clerical and administrative tasks including documentation, order entry, billing and coding, and system security accounted for nearly one-half of the total EHR time (157 minutes, 44.2%). Inbox management accounted for another 85 minutes (23.7%).\nCONCLUSIONS: Primary care physicians spend more than one-half of their workday, nearly 6 hours, interacting with the EHR during and after clinic hours. EHR event logs can identify areas of EHR-related work that could be delegated, thus reducing workload, improving professional satisfaction, and decreasing burnout. Direct time-motion observations validated EHR-event log data as a reliable source of information regarding clinician time allocation.","author":[{"family":"Arndt","given":"Brian G."},{"family":"Beasley","given":"John W."},{"family":"Watkinson","given":"Michelle D."},{"family":"Temte","given":"Jonathan L."},{"family":"Tuan","given":"Wen-Jan"},{"family":"Sinsky","given":"Christine A."},{"family":"Gilchrist","given":"Valerie J."}],"container-title":"Annals of Family Medicine","container-title-short":"Ann Fam Med","DOI":"10.1370/afm.2121","ISSN":"1544-1717","issue":"5","issued":{"date-parts":[[2017,9]]},"language":"eng","page":"419-426","PMCID":"PMC5593724","PMID":"28893811","source":"PubMed","title":"Tethered to the EHR: Primary Care Physician Workload Assessment Using EHR Event Log Data and Time-Motion Observations","title-short":"Tethered to the EHR","type":"article-journal","volume":"15"},
  {"id":"AssociationResidentFatigue","accessed":{"date-parts":[[2020,8,19]]},"title":"Association of resident fatigue and distress with perceived medical errors - PubMed","type":"webpage","URL":"https://pubmed.ncbi.nlm.nih.gov/19773564/"},
  {"id":"Axioms","abstract":"Relearn CSS layout","accessed":{"date-parts":[[2020,8,7]]},"language":"en","source":"every-layout.dev","title":"Axioms","type":"webpage","URL":"https://every-layout.dev/rudiments/axioms/"},
  {"id":"baeckerBringingIconsLife1991","accessed":{"date-parts":[[2020,8,21]]},"author":[{"family":"Baecker","given":"Ronald"},{"family":"Small","given":"Ian"},{"family":"Mander","given":"Richard"}],"collection-title":"CHI '91","container-title":"Proceedings of the SIGCHI Conference on Human Factors in Computing Systems","DOI":"10.1145/108844.108845","event-place":"New York, NY, USA","ISBN":"978-0-89791-383-6","issued":{"date-parts":[[1991,3,1]]},"page":"1–6","publisher":"Association for Computing Machinery","publisher-place":"New York, NY, USA","source":"ACM Digital Library","title":"Bringing icons to life","type":"paper-conference","URL":"https://doi.org/10.1145/108844.108845"},
  {"id":"baeckerShowingInsteadTelling2002","abstract":"We propose the use of dynamic visual representations to augment traditional static text as documentation. In other words, we suggest using live demonstrations or moving pictures to show people how to do things, and not just using written or spoken words to tell them what to do. We present and illustrate examples of five methods and technologies for creating such dynamic documentation, and summarize what is known about their effectiveness.","accessed":{"date-parts":[[2020,6,15]]},"author":[{"family":"Baecker","given":"Ron"}],"collection-title":"SIGDOC '02","container-title":"Proceedings of the 20th annual international conference on Computer documentation","DOI":"10.1145/584955.584957","event-place":"Toronto, Ontario, Canada","ISBN":"978-1-58113-543-5","issued":{"date-parts":[[2002,10,20]]},"page":"10–16","publisher":"Association for Computing Machinery","publisher-place":"Toronto, Ontario, Canada","source":"ACM Digital Library","title":"Showing instead of telling","type":"paper-conference","URL":"https://doi.org/10.1145/584955.584957"},
  {"id":"banovicWakenReverseEngineering2012","abstract":"We present Waken, an application-independent system that recognizes UI components and activities from screen captured videos, without any prior knowledge of that application. Waken can identify the cursors, icons, menus, and tooltips that an application contains, and when those items are used. Waken uses frame differencing to identify occurrences of behaviors that are common across graphical user interfaces. Candidate templates are built, and then other occurrences of those templates are identified using a multiphase algorithm. An evaluation demonstrates that the system can successfully reconstruct many aspects of a UI without any prior application-dependant knowledge. To showcase the design opportunities that are introduced by having this additional meta-data, we present the Waken Video Player, which allows users to directly interact with UI components that are displayed in the video.","accessed":{"date-parts":[[2020,6,3]]},"author":[{"family":"Banovic","given":"Nikola"},{"family":"Grossman","given":"Tovi"},{"family":"Matejka","given":"Justin"},{"family":"Fitzmaurice","given":"George"}],"container-title":"Proceedings of the 25th annual ACM symposium on User interface software and technology - UIST '12","DOI":"10.1145/2380116.2380129","event":"the 25th annual ACM symposium","event-place":"Cambridge, Massachusetts, USA","ISBN":"978-1-4503-1580-7","issued":{"date-parts":[[2012]]},"language":"en","page":"83","publisher":"ACM Press","publisher-place":"Cambridge, Massachusetts, USA","source":"DOI.org (Crossref)","title":"Waken: reverse engineering usage information and interface structure from software videos","title-short":"Waken","type":"paper-conference","URL":"http://dl.acm.org/citation.cfm?doid=2380116.2380129"},
  {"id":"batesTeachingDigitalAge2019","accessed":{"date-parts":[[2020,6,2]]},"author":[{"family":"Bates","given":"A. W. (Tony)"}],"issued":{"date-parts":[[2019,10,10]]},"language":"en","publisher":"Tony Bates Associates Ltd.","source":"pressbooks.bccampus.ca","title":"Teaching in a Digital Age - Second Edition","type":"book","URL":"https://pressbooks.bccampus.ca/teachinginadigitalagev2/"},
  {"id":"beaudouin-lafonInstrumentalInteractionInteraction2000","abstract":"This article introduces a new interaction model called Instrumental Interaction that extends and generalizes the principles of direct manipulation. It covers existing interaction styles, including traditional WIMP interfaces, as well as new interaction styles such as two-handed input and augmented reality. It defines a design space for new interaction techniques and a set of properties for comparing them. Instrumental Interaction describes graphical user interfaces in terms of domain objects and interaction instruments. Interaction between users and domain objects is mediated by interaction instruments, similar to the tools and instruments we use in the real world to interact with physical objects. The article presents the model, applies it to describe and compare a number of interaction techniques, and shows how it was used to create a new interface for searching and replacing text.","accessed":{"date-parts":[[2018,9,26]]},"author":[{"family":"Beaudouin-Lafon","given":"Michel"}],"container-title":"Proceedings of the SIGCHI conference on Human factors in computing systems  - CHI '00","DOI":"10.1145/332040.332473","event":"the SIGCHI conference","event-place":"The Hague, The Netherlands","ISBN":"978-1-58113-216-8","issued":{"date-parts":[[2000]]},"language":"en","page":"446-453","publisher":"ACM Press","publisher-place":"The Hague, The Netherlands","source":"Crossref","title":"Instrumental interaction: an interaction model for designing post-WIMP user interfaces","title-short":"Instrumental interaction","type":"paper-conference","URL":"http://portal.acm.org/citation.cfm?doid=332040.332473"},
  {"id":"beaudouin-lafonReificationPolymorphismReuse","abstract":"This paper presents three design principles to support the development of large-scale applications and take advantage of recent research in new interaction techniques: Reification turns concepts into first class objects, polymorphism permits commands to be applied to objects of different types, and reuse makes both user input and system output accessible for later use. We show that the power of these principles lies in their combination. Reification creates new objects that can be acted upon by a small set of polymorphic commands, creating more opportunities for reuse. The result is a simpler yet more powerful interface.","author":[{"family":"Beaudouin-Lafon","given":"Michel"},{"family":"Mackay","given":"Wendy E"}],"language":"en","page":"8","source":"Zotero","title":"Reification, Polymorphism and Reuse: Three Principles for Designing Visual Interfaces","type":"article-journal"},
  {"id":"beaudouin-lafonUnifiedPrinciplesInteraction2017","abstract":"Even though today's computers are used for many different types of tasks, they still rely on user interfaces designed for office workers in the 1980s. HCI researchers have produced a slew of innovative interaction styles, from gestural interaction to mixed reality and tangible interfaces, but they have not replaced traditional GUIs. I argue that we must devise fundamental principles of interaction that unify, rather than separate, interaction styles in order to support the diversity of uses and users. I describe ongoing work on my ERC advanced grant, ONE, which explores how the concepts of information substrates and interaction instruments create digital environments that users can appropriate and (re)combine at will.","accessed":{"date-parts":[[2018,9,26]]},"author":[{"family":"Beaudouin-Lafon","given":"Michel"}],"container-title":"CHItaly 2017 - Proceedings of the 12th Biannual Conference of the Italian SIGCHI Chapter","DOI":"10.1145/3125571.3125602","event-place":"Cagliari, Italy","issued":{"date-parts":[[2017,9]]},"page":"1 - 2","publisher-place":"Cagliari, Italy","source":"HAL Archives Ouvertes","title":"Towards Unified Principles of Interaction","type":"paper-conference","URL":"https://hal.archives-ouvertes.fr/hal-01614273"},
  {"id":"bergmanDocWizardsSystemAuthoring2005","abstract":"Traditional documentation for computer-based procedures is difficult to use: readers have trouble navigating long complex instructions, have trouble mapping from the text to display widgets, and waste time performing repetitive procedures. We propose a new class of improved documentation that we call follow-me documentation wizards. Follow-me documentation wizards step a user through a script representation of a procedure by highlighting portions of the text, as well application UI elements. This paper presents algorithms for automatically capturing follow-me documentation wizards by demonstration, through observing experts performing the procedure. We also present our DocWizards implementation on the Eclipse platform. We evaluate our system with an initial user study that showing that most users have a marked preference for this form of guidance over traditional documentation.","accessed":{"date-parts":[[2020,6,16]]},"author":[{"family":"Bergman","given":"Lawrence"},{"family":"Castelli","given":"Vittorio"},{"family":"Lau","given":"Tessa"},{"family":"Oblinger","given":"Daniel"}],"collection-title":"UIST '05","container-title":"Proceedings of the 18th annual ACM symposium on User interface software and technology","DOI":"10.1145/1095034.1095067","event-place":"Seattle, WA, USA","ISBN":"978-1-59593-271-6","issued":{"date-parts":[[2005,10,23]]},"page":"191–200","publisher":"Association for Computing Machinery","publisher-place":"Seattle, WA, USA","source":"ACM Digital Library","title":"DocWizards: a system for authoring follow-me documentation wizards","title-short":"DocWizards","type":"paper-conference","URL":"https://doi.org/10.1145/1095034.1095067"},
  {"id":"bertinSemiologyGraphicsDiagrams2010","author":[{"family":"Bertin","given":"Jacques"},{"family":"Berg","given":"William J."}],"call-number":"QA90 .B47513 2010","edition":"1st ed","event-place":"Redlands, Calif","ISBN":"978-1-58948-261-6","issued":{"date-parts":[[2010]]},"language":"eng","number-of-pages":"438","publisher":"ESRI Press : Distributed by Ingram Publisher Services","publisher-place":"Redlands, Calif","source":"Library of Congress ISBN","title":"Semiology of graphics: diagrams, networks, maps","title-short":"Semiology of graphics","type":"book"},
  {"id":"BibliographyButterickPractical","accessed":{"date-parts":[[2020,6,26]]},"title":"Bibliography | Butterick’s Practical Typography","type":"webpage","URL":"https://practicaltypography.com/bibliography.html"},
  {"id":"BlackMoshannonState2020","abstract":"Black Moshannon State Park is a 3,480-acre (1,410 ha) Pennsylvania state park in Rush Township, Centre County, Pennsylvania, United States. It surrounds Black Moshannon Lake, formed by a dam on Black Moshannon Creek, which has given its name to the lake and park. The park is just west of the Allegheny Front, 9 miles (14 km) east of Philipsburg on Pennsylvania Route 504, and is largely surrounded by Moshannon State Forest. A bog in the park provides a habitat for diverse wildlife not common in other areas of the state, such as carnivorous plants, orchids, and species normally found farther north. As home to the \"largest reconstituted bog in Pennsylvania\", it was chosen by the Pennsylvania Department of Conservation and Natural Resources for its \"25 Must-see Pennsylvania State Parks\" list.Humans have long used the Black Moshannon area for recreational, industrial, and subsistence purposes. The Seneca tribe used it as hunting and fishing grounds. European settlers cleared some land for farming, then clear-cut the vast stands of old-growth White Pine and Eastern Hemlock. Black Moshannon State Park rose from the ashes of a depleted forest which had been largely destroyed by wildfire in the years following the lumber era. The forests were rehabilitated by the Civilian Conservation Corps during the Great Depression in the 1930s. Many of the buildings built by the Civilian Conservation Corps stand in the park today and are protected on the list of National Register of Historic Places in three historic districts.\nBlack Moshannon State Park is open year-round for recreation and has an extensive network of trails which allow hiking, biking, and viewing the bog habitat at the Black Moshannon State Natural Area. The park is in a Pennsylvania Important Bird Area, where bird watchers have recorded 175 different species. It is also home to many rare and unusual plants and animals, due to its location atop the Allegheny Plateau; the lake is at an elevation of about 1,900 feet (580 m). Much of the park is open for hunting and the lake and creek are open for fishing, boating, and swimming. In winter it is a popular destination for cross-country skiing, and was home to a small downhill skiing area from 1965 to 1982. Picnics and camping are also popular, and the \"Friends of Black Moshannon State Park\" group promotes the park and all the recreational activities associated with it.","accessed":{"date-parts":[[2020,6,26]]},"container-title":"Wikipedia","issued":{"date-parts":[[2020,6,26]]},"language":"en","note":"Page Version ID: 964588338","source":"Wikipedia","title":"Black Moshannon State Park","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Black_Moshannon_State_Park&oldid=964588338"},
  {"id":"bolyaTIDEGeneralToolbox2020","abstract":"We introduce TIDE, a framework and associated toolbox for analyzing the sources of error in object detection and instance segmentation algorithms. Importantly, our framework is applicable across datasets and can be applied directly to output prediction files without required knowledge of the underlying prediction system. Thus, our framework can be used as a drop-in replacement for the standard mAP computation while providing a comprehensive analysis of each model's strengths and weaknesses. We segment errors into six types and, crucially, are the first to introduce a technique for measuring the contribution of each error in a way that isolates its effect on overall performance. We show that such a representation is critical for drawing accurate, comprehensive conclusions through in-depth analysis across 4 datasets and 7 recognition models. Available at https://dbolya.github.io/tide/","accessed":{"date-parts":[[2020,9,18]]},"author":[{"family":"Bolya","given":"Daniel"},{"family":"Foley","given":"Sean"},{"family":"Hays","given":"James"},{"family":"Hoffman","given":"Judy"}],"container-title":"arXiv:2008.08115 [cs]","issued":{"date-parts":[[2020,8,31]]},"source":"arXiv.org","title":"TIDE: A General Toolbox for Identifying Object Detection Errors","title-short":"TIDE","type":"article-journal","URL":"http://arxiv.org/abs/2008.08115"},
  {"id":"boydDevelopingVisualThinking2017","abstract":"The purpose of this vision paper is to identify how data visualization could transform healthcare. Electronic Health Records (EHRs) are maturing with new technology and tools being applied. Researchers are reaping the benefits of data visualization to better access compilations of EHR data for enhanced clinical research. Data visualization, while still primarily the domain of clinical researchers, is beginning to show promise for other stakeholders. A non-exhaustive review of the literature indicates that respective to the growth and development of the EHR, the maturity of data visualization in healthcare is in its infancy. Visual analytics has been only cursorily applied to healthcare. A fundamental issue contributing to fragmentation and poor coordination of healthcare delivery is that each member of the healthcare team, including patients, has a different view. Summarizing all of this care comprehensively for any member of the healthcare team is a \"wickedly hard\" visual analytics and data visualization problem to solve.","author":[{"family":"Boyd","given":"Andrew D."},{"family":"Young","given":"Christine D."},{"family":"Amatayakul","given":"Margret"},{"family":"Dieter","given":"Michael G."},{"family":"Pawola","given":"Lawrence M."}],"container-title":"Studies in Health Technology and Informatics","container-title-short":"Stud Health Technol Inform","ISSN":"1879-8365","issued":{"date-parts":[[2017]]},"language":"eng","page":"308-312","PMID":"29295105","source":"PubMed","title":"Developing Visual Thinking in the Electronic Health Record","type":"article-journal","volume":"245"},
  {"id":"bradnerWhyDistanceMatters2002","abstract":"In this study, we examine how geographic distance affects collaboration using computer-mediated communication technology. We investigated experimentally the effects of cooperating partners being in the same or distant city on three behaviors: cooperation, persuasion, and deception using video conferencing and instant messaging (IM). Our results indicate that subjects are more likely to deceive, be less persuaded by, and initially cooperate less, with someone they believe is in a distant city, as opposed to in the same city as them. Although people initially cooperate less with someone they believe is far away, their willingness to cooperate increases quickly with interaction. Since the same media were used in both the far and near city conditions, these effects cannot be attributed to the media, but rather to social differences. This study confirms how CSCW needs to be concerned with developing technologies for bridging social distance, as well as geographic distance.","accessed":{"date-parts":[[2020,9,2]]},"author":[{"family":"Bradner","given":"Erin"},{"family":"Mark","given":"Gloria"}],"collection-title":"CSCW '02","container-title":"Proceedings of the 2002 ACM conference on Computer supported cooperative work","DOI":"10.1145/587078.587110","event-place":"New York, NY, USA","ISBN":"978-1-58113-560-2","issued":{"date-parts":[[2002,11,16]]},"page":"226–235","publisher":"Association for Computing Machinery","publisher-place":"New York, NY, USA","source":"ACM Digital Library","title":"Why distance matters: effects on cooperation, persuasion and deception","title-short":"Why distance matters","type":"paper-conference","URL":"https://doi.org/10.1145/587078.587110"},
  {"id":"branwenThisWebsite2010","abstract":"Meta page describing gwern.net site ideals of stable long-term essays which improve over time; technical decisions using Markdown and static hosting; idea sources and writing methodology; metadata definitions; site statistics; copyright license.","accessed":{"date-parts":[[2020,6,26]]},"author":[{"family":"Branwen","given":"Gwern"}],"issued":{"date-parts":[[2010,10,1]]},"language":"en","note":"Last Modified: 15 Aug 2019","source":"www.gwern.net","title":"About This Website","type":"article-journal","URL":"https://www.gwern.net/About"},
  {"id":"brehmerTimelinesRevisitedDesign2017","abstract":"There are many ways to visualize event sequences as timelines. In a storytelling context where the intent is to convey multiple narrative points, a richer set of timeline designs may be more appropriate than the narrow range that has been used for exploratory data analysis by the research community. Informed by a survey of 263 timelines, we present a design space for storytelling with timelines that balances expressiveness and effectiveness, identifying 14 design choices characterized by three dimensions: representation, scale, and layout. Twenty combinations of these choices are viable timeline designs that can be matched to different narrative points, while smooth animated transitions between narrative points allow for the presentation of a cohesive story, an important aspect of both interactive storytelling and data videos. We further validate this design space by realizing the full set of viable timeline designs and transitions in a proof-of-concept sandbox implementation that we used to produce seven example timeline stories. Ultimately, this work is intended to inform and inspire the design of future tools for storytelling with timelines.","accessed":{"date-parts":[[2020,6,2]]},"author":[{"family":"Brehmer","given":"Matthew"},{"family":"Lee","given":"Bongshin"},{"family":"Bach","given":"Benjamin"},{"family":"Riche","given":"Nathalie Henry"},{"family":"Munzner","given":"Tamara"}],"container-title":"IEEE Transactions on Visualization and Computer Graphics","container-title-short":"IEEE Trans. Visual. Comput. Graphics","DOI":"10.1109/TVCG.2016.2614803","ISSN":"1077-2626","issue":"9","issued":{"date-parts":[[2017,9,1]]},"language":"en","page":"2151-2164","source":"DOI.org (Crossref)","title":"Timelines Revisited: A Design Space and Considerations for Expressive Storytelling","title-short":"Timelines Revisited","type":"article-journal","URL":"http://ieeexplore.ieee.org/document/7581076/","volume":"23"},
  {"id":"BuildBetterBallot","abstract":"an interactive guide to alternative voting systems","accessed":{"date-parts":[[2020,7,22]]},"language":"en","source":"ncase.me","title":"To Build a Better Ballot","type":"webpage","URL":"http://ncase.me/ballot/"},
  {"id":"buntTaggedCommentsPromotingIntegrating2014","abstract":"User comments posted to popular online tutorials constitute a rich additional source of information for readers, yet current designs for displaying user comments on tutorial webpages do little to support their use. Instead, comments are separated from the tutorial content they reference and tend to be ordered according to post date. We propose and evaluate the TaggedComments system, a new approach to displaying comments that users post to online tutorials. Using tags supplied by commenters, TaggedComments seeks to enhance the role of user comments by 1) improving their visibility, 2) allowing users to personalize their use of the comments according to their particular information needs, and 3) providing direct access to potentially helpful comments from the tutorial content. A laboratory evaluation with 16 participants shows that, in comparison to the standard comment layout, TaggedComments significantly improves users’ subjective impressions of comment utility when interacting with Photoshop tutorials.","accessed":{"date-parts":[[2020,6,2]]},"author":[{"family":"Bunt","given":"Andrea"},{"family":"Dubois","given":"Patrick"},{"family":"Lafreniere","given":"Ben"},{"family":"Terry","given":"Michael A."},{"family":"Cormack","given":"David T."}],"container-title":"Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI '14","DOI":"10.1145/2556288.2557118","event":"the 32nd annual ACM conference","event-place":"Toronto, Ontario, Canada","ISBN":"978-1-4503-2473-1","issued":{"date-parts":[[2014]]},"language":"en","page":"4037-4046","publisher":"ACM Press","publisher-place":"Toronto, Ontario, Canada","source":"DOI.org (Crossref)","title":"TaggedComments: promoting and integrating user comments in online application tutorials","title-short":"TaggedComments","type":"paper-conference","URL":"http://dl.acm.org/citation.cfm?doid=2556288.2557118"},
  {"id":"BurnoutMedicalErrors","accessed":{"date-parts":[[2020,8,19]]},"title":"Burnout and medical errors among American surgeons - PubMed","type":"webpage","URL":"https://pubmed.ncbi.nlm.nih.gov/19934755/"},
  {"id":"bushWeMayThink1945","abstract":"“Consider a future device …  in which an individual stores all his books, records, and communications, and which is mechanized so that it may be consulted with exceeding speed and flexibility. It is an enlarged intimate supplement to his memory.”","accessed":{"date-parts":[[2020,9,17]]},"author":[{"family":"Bush","given":"Vannevar"}],"container-title":"The Atlantic","issued":{"date-parts":[[1945,7,1]]},"language":"en-US","section":"Technology","title":"As We May Think","type":"webpage","URL":"https://www.theatlantic.com/magazine/archive/1945/07/as-we-may-think/303881/"},
  {"id":"ButterickPracticalTypography","accessed":{"date-parts":[[2020,6,25]]},"title":"Butterick’s Practical Typography","type":"webpage","URL":"https://practicaltypography.com/"},
  {"id":"cacioppoDispositionalDifferencesCognitive1996","abstract":"Need for cognition in contemporary literature refers to an individual's tendency to engage in and enjoy effortful cognitive endeavors. Individual differences in need for cognition have been the focus of investigation in over 100 empirical studies. This literature is reviewed, covering the theory and history of this variable, measures of interindividual variations in it, and empirical relationships between it and personality variables, as well as individuals' tendencies to seek and engage in effortful cognitive activity and enjoy cognitively effortful circumstances. The article concludes with discussions of an elaborated theory of the variable, including antecedent conditions; interindividual variations in it related to the manner information is acquired or processed to guide perceptions, judgments, and behavior; and the relationship between it and the 5-factor model of personality structure. (PsycInfo Database Record (c) 2020 APA, all rights reserved)","author":[{"family":"Cacioppo","given":"John T."},{"family":"Petty","given":"Richard E."},{"family":"Feinstein","given":"Jeffrey A."},{"family":"Jarvis","given":"W. Blair G."}],"container-title":"Psychological Bulletin","DOI":"10.1037/0033-2909.119.2.197","event-place":"US","ISSN":"1939-1455(Electronic),0033-2909(Print)","issue":"2","issued":{"date-parts":[[1996]]},"page":"197-253","publisher":"American Psychological Association","publisher-place":"US","source":"APA PsycNET","title":"Dispositional differences in cognitive motivation: The life and times of individuals varying in need for cognition","title-short":"Dispositional differences in cognitive motivation","type":"article-journal","volume":"119"},
  {"id":"caiHelloAIUncovering2019","accessed":{"date-parts":[[2020,8,5]]},"author":[{"family":"Cai","given":"Carrie J."},{"family":"Winter","given":"Samantha"},{"family":"Steiner","given":"David"},{"family":"Wilcox","given":"Lauren"},{"family":"Terry","given":"Michael"}],"container-title":"Proceedings of the ACM on Human-Computer Interaction","container-title-short":"Proc. ACM Hum.-Comput. Interact.","DOI":"10.1145/3359206","ISSN":"2573-0142, 2573-0142","issue":"CSCW","issued":{"date-parts":[[2019,11,7]]},"language":"en","page":"1-24","source":"DOI.org (Crossref)","title":"\"Hello AI\": Uncovering the Onboarding Needs of Medical Practitioners for Human-AI Collaborative Decision-Making","title-short":"Hello AI","type":"article-journal","URL":"https://dl.acm.org/doi/10.1145/3359206","volume":"3"},
  {"id":"caiHumanCenteredToolsCoping2019","abstract":"Machine learning (ML) is increasingly being used in image retrieval systems for medical decision making. One application of ML is to retrieve visually similar medical images from past patients (e.g. tissue from biopsies) to reference when making a medical decision with a new patient. However, no algorithm can perfectly capture an expert's ideal notion of similarity for every case: an image that is algorithmically determined to be similar may not be medically relevant to a doctor's specific diagnostic needs. In this paper, we identified the needs of pathologists when searching for similar images retrieved using a deep learning algorithm, and developed tools that empower users to cope with the search algorithm on-the-fly, communicating what types of similarity are most important at different moments in time. In two evaluations with pathologists, we found that these tools increased the diagnostic utility of images found and increased user trust in the algorithm. The tools were preferred over a traditional interface, without a loss in diagnostic accuracy. We also observed that users adopted new strategies when using refinement tools, re-purposing them to test and understand the underlying algorithm and to disambiguate ML errors from their own errors. Taken together, these findings inform future human-ML collaborative systems for expert decision-making.","accessed":{"date-parts":[[2020,10,26]]},"author":[{"family":"Cai","given":"Carrie J."},{"family":"Reif","given":"Emily"},{"family":"Hegde","given":"Narayan"},{"family":"Hipp","given":"Jason"},{"family":"Kim","given":"Been"},{"family":"Smilkov","given":"Daniel"},{"family":"Wattenberg","given":"Martin"},{"family":"Viegas","given":"Fernanda"},{"family":"Corrado","given":"Greg S."},{"family":"Stumpe","given":"Martin C."},{"family":"Terry","given":"Michael"}],"collection-title":"CHI '19","container-title":"Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems","DOI":"10.1145/3290605.3300234","event-place":"New York, NY, USA","ISBN":"978-1-4503-5970-2","issued":{"date-parts":[[2019,5,2]]},"page":"1–14","publisher":"Association for Computing Machinery","publisher-place":"New York, NY, USA","source":"ACM Digital Library","title":"Human-Centered Tools for Coping with Imperfect Algorithms During Medical Decision-Making","type":"paper-conference","URL":"https://doi.org/10.1145/3290605.3300234"},
  {"id":"callahanManagingEvolutionDataflows2006","accessed":{"date-parts":[[2020,6,3]]},"author":[{"family":"Callahan","given":"S.P."},{"family":"Freire","given":"J."},{"family":"Santos","given":"E."},{"family":"Scheidegger","given":"C.E."},{"family":"Silva","given":"C.T."},{"literal":"Huy T. Vo"}],"container-title":"22nd International Conference on Data Engineering Workshops (ICDEW'06)","DOI":"10.1109/ICDEW.2006.75","event":"2006 22nd International Conference on Data Engineering Workshops","event-place":"Atlanta, GA, USA","ISBN":"978-0-7695-2571-6","issued":{"date-parts":[[2006]]},"language":"en","page":"71-71","publisher":"IEEE","publisher-place":"Atlanta, GA, USA","source":"DOI.org (Crossref)","title":"Managing the Evolution of Dataflows with VisTrails","type":"paper-conference","URL":"http://ieeexplore.ieee.org/document/1623866/"},
  {"id":"carrollNurnbergFunnelDesigning1990","author":[{"family":"Carroll","given":"John M."}],"call-number":"QA76.27 .C38 1990","collection-title":"Technical communications","event-place":"Cambridge, Mass","ISBN":"978-0-262-03163-9","issued":{"date-parts":[[1990]]},"number-of-pages":"340","publisher":"MIT Press","publisher-place":"Cambridge, Mass","source":"Library of Congress ISBN","title":"The Nurnberg funnel: designing minimalist instruction for practical computer skill","title-short":"The Nurnberg funnel","type":"book"},
  {"id":"carrollTrainingWheelsUser1984","abstract":"New users of high-function application systems can become frustrated and confused by the errors they make in the early stages of learning. A training interface for a commercial word processor was designed to make typical and troublesome error states “unreachable,” thus eliminating the sources of some new-user learning problems. Creating a training environment from the basic function of the system itself afforded substantially faster learning coupled with better learning achievement and better performance on a comprehension post-test. A control group spent almost a quarter of their time recovering from the error states that the training interface blocked off. We speculate on how this training strategy might be refined, and more generally, on how function should be organized in a user interface.","author":[{"family":"Carroll","given":"John"},{"family":"Carrithers","given":"Caroline"}],"container-title":"Commun. ACM","container-title-short":"Commun. ACM","DOI":"10.1145/358198.358218","issued":{"date-parts":[[1984,8,1]]},"page":"800-806","source":"ResearchGate","title":"Training Wheels in a User Interface","type":"article-journal","volume":"27"},
  {"id":"catramboneLearningWordProcessing1986","abstract":"A Training Wheels interface creates a reduced functionality system intended to prevent new users from suffering the consequences of certain types of common errors when they exercise system functions and procedures. This has been shown to be an effective training system design for learning basic text editing functions [4]. We extend this result by examining the extent to which training wheels learners can transfer their skills to interaction with the full-function system. The experiment reported here indicates that training wheels subjects were better able to perform advanced full-system editing functions than subjects who were trained on the full system itself.","accessed":{"date-parts":[[2020,8,21]]},"author":[{"family":"Catrambone","given":"Richard"},{"family":"Carroll","given":"John M."}],"collection-title":"CHI '87","container-title":"Proceedings of the SIGCHI/GI Conference on Human Factors in Computing Systems and Graphics Interface","DOI":"10.1145/29933.275625","event-place":"New York, NY, USA","ISBN":"978-0-89791-213-6","issued":{"date-parts":[[1986,5,1]]},"page":"169–174","publisher":"Association for Computing Machinery","publisher-place":"New York, NY, USA","source":"ACM Digital Library","title":"Learning a word processing system with training wheels and guided exploration","type":"paper-conference","URL":"https://doi.org/10.1145/29933.275625"},
  {"id":"chakravarthiAIMHelpGeneratingHelp2009","abstract":"Help systems are a requirement in most modern applications. However, current mainstream help systems can be improved to provide information that is more relevant and accurate. This paper introduces a new approach for help systems – AIMHelp – that can generate help information from a running application. Instead of developers having to supply all help information a-priori, a lot of information can be retrieved by monitoring the state of the GUI and the interaction between the user and diﬀerent system components. This has the advantage that generated help information is consistent with the actual application, unlike pre-deﬁned help information that can easily get outdated as an application evolves.","accessed":{"date-parts":[[2020,6,17]]},"author":[{"family":"Chakravarthi","given":"Yashasvi Appilla"},{"family":"Lutteroth","given":"Christof"},{"family":"Weber","given":"Gerald"}],"container-title":"Proceedings of the 10th International Conference NZ Chapter of the ACM's Special Interest Group on Human-Computer Interaction - CHINZ '09","DOI":"10.1145/1577782.1577787","event":"the 10th International Conference NZ Chapter of the ACM's Special Interest Group","event-place":"Auckland, New Zealand","ISBN":"978-1-60558-574-1","issued":{"date-parts":[[2009]]},"language":"en","page":"21-28","publisher":"ACM Press","publisher-place":"Auckland, New Zealand","source":"DOI.org (Crossref)","title":"AIMHelp: generating help for GUI applications automatically","title-short":"AIMHelp","type":"paper-conference","URL":"http://portal.acm.org/citation.cfm?doid=1577782.1577787"},
  {"id":"changWorkflowGraphsComputational","abstract":"This paper introduces Workﬂow graphs, or W-graphs, which encode how the approaches taken by multiple users performing a ﬁxed 3D design task converge and diverge from one another. The graph’s nodes represent equivalent intermediate task states across users, and directed edges represent how a user moved between these states, inferred from screen recording videos, command log data, and task content history. The result is a data structure that captures alternative methods for performing sub-tasks (e.g., modeling the legs of a chair) and alternative strategies of the overall task. As a case study, we describe and exemplify a computational pipeline for building W-graphs using screen recordings, command logs, and 3D model snapshots from an instrumented version of the Tinkercad 3D modeling application, and present graphs built for two sample tasks. We also illustrate how W-graphs can facilitate novel user interfaces with scenarios in workﬂow feedback, on-demand task guidance, and instructor dashboards.","author":[{"family":"Chang","given":"Minsuk"},{"family":"Lafreniere","given":"Ben"},{"family":"Kim","given":"Juho"},{"family":"Fitzmaurice","given":"George"},{"family":"Grossman","given":"Tovi"}],"language":"en","page":"11","source":"Zotero","title":"Workﬂow Graphs: A Computational Model of Collective Task Strategies for 3D Design Software","type":"article-journal"},
  {"id":"chasinsSkipBlocksReusing2017","abstract":"With more and more web scripting languages on offer, programmers have access to increasing language support for web scraping tasks. However, in our experiences collaborating with data scientists, we learned that two issues still plague long-running scraping scripts: i) When a network or website goes down mid-scrape, recovery sometimes requires restarting from the beginning, which users find frustratingly slow. ii) Websites do not offer atomic snapshots of their databases; they update their content so frequently that output data is cluttered with slight variations of the same information — e.g., a tweet from profile 1 that is retweeted on profile 2 and scraped from both profiles, once with 52 responses then later with 53 responses. We introduce the skip block, a language construct that addresses both of these disparate problems. Programmers write lightweight annotations to indicate when the current object can be considered equivalent to a previously scraped object and direct the program to skip over the scraping actions in the block. The construct is hierarchical, so programs can skip over long or short script segments, allowing adaptive reuse of prior work. After network and server failures, skip blocks accelerate failure recovery by 7.9x on average. Even scripts that do not encounter failures benefit; because sites display redundant objects, skipping over them accelerates scraping by up to 2.1x. For longitudinal scraping tasks that aim to fetch only new objects, the second run exhibits an average speedup of 5.2x. Our small user study reveals that programmers can quickly produce skip block annotations.","accessed":{"date-parts":[[2020,6,15]]},"author":[{"family":"Chasins","given":"Sarah"},{"family":"Bodik","given":"Rastislav"}],"container-title":"Proceedings of the ACM on Programming Languages","container-title-short":"Proc. ACM Program. Lang.","DOI":"10.1145/3133875","issue":"OOPSLA","issued":{"date-parts":[[2017,10,12]]},"page":"51:1–51:28","source":"October 2017","title":"Skip blocks: reusing execution history to accelerate web scripts","title-short":"Skip blocks","type":"article-journal","URL":"https://doi.org/10.1145/3133875","volume":"1"},
  {"id":"chenNonlinearRevisionControl2011","abstract":"Revision control is a vital component of digital project management and has been widely deployed for text files. Binary files, on the other hand, have received relatively less attention. This can be inconvenient for graphics applications that use a significant amount of binary data, such as images, videos, meshes, and animations. Existing strategies such as storing whole files for individual revisions or simple binary deltas could consume significant storage and obscure vital semantic information. We present a nonlinear revision control system for images, designed with the common digital editing and sketching workflows in mind. We use DAG (directed acyclic graph) as the core structure, with DAG nodes representing editing operations and DAG edges the corresponding spatial, temporal and semantic relationships. We visualize our DAG in RevG (revision graph), which provides not only as a meaningful display of the revision history but also an intuitive interface for common revision control operations such as review, replay, diff, addition, branching, merging, and conflict resolving. Beyond revision control, our system also facilitates artistic creation processes in common image editing and digital painting workflows. We have built a prototype system upon GIMP, an open source image editor, and demonstrate its effectiveness through formative user study and comparisons with alternative revision control systems.","accessed":{"date-parts":[[2020,8,27]]},"author":[{"family":"Chen","given":"Hsiang-Ting"},{"family":"Wei","given":"Li-Yi"},{"family":"Chang","given":"Chun-Fa"}],"container-title":"ACM Transactions on Graphics","container-title-short":"ACM Trans. Graph.","DOI":"10.1145/2010324.1965000","ISSN":"0730-0301","issue":"4","issued":{"date-parts":[[2011,7,25]]},"page":"105:1–105:10","source":"July 2011","title":"Nonlinear revision control for images","type":"article-journal","URL":"https://doi.org/10.1145/2010324.1965000","volume":"30"},
  {"id":"chernowHouseMorganAmerican2010","abstract":"This book is the story of four generations of Morgans and the powerful, secretive firms they spawned that would transform the modern financial world. Tracing the trajectory of J.P. Morgan's empire from its obscure beginnings in Victorian London to the financial crisis of 1987, the author paints a portrait of the family's private saga and the rarefied world of the American and British elite in which they moved, including Charles Lindbergh, Henry Ford, Franklin Roosevelt, Nancy Astor, and Winston Churchill. An account of a remarkable institution and the men who ran it, this book provides a look at the real power -- the money -- behind the historical events, the eminent statesmen, and the industrial empires that have transformed the world in the last century and a half.","author":[{"family":"Chernow","given":"Ron"}],"ISBN":"978-0-8021-4465-2","issued":{"date-parts":[[2010]]},"language":"English","note":"OCLC: 406173315","source":"Open WorldCat","title":"The house of Morgan: an American banking dynasty and the rise of modern finance","title-short":"The house of Morgan","type":"book"},
  {"id":"chiDemoCutGeneratingConcise2013","abstract":"Amateur instructional videos often show a single uninterrupted take of a recorded demonstration without any edits. While easy to produce, such videos are often too long as they include unnecessary or repetitive actions as well as mistakes. We introduce DemoCut, a semi-automatic video editing system that improves the quality of amateur instructional videos for physical tasks. DemoCut asks users to mark key moments in a recorded demonstration using a set of marker types derived from our formative study. Based on these markers, the system uses audio and video analysis to automatically organize the video into meaningful segments and apply appropriate video editing effects. To understand the effectiveness of DemoCut, we report a technical evaluation of seven video tutorials created with DemoCut. In a separate user evaluation, all eight participants successfully created a complete tutorial with a variety of video editing effects using our system.","accessed":{"date-parts":[[2020,8,27]]},"author":[{"family":"Chi","given":"Pei-Yu"},{"family":"Liu","given":"Joyce"},{"family":"Linder","given":"Jason"},{"family":"Dontcheva","given":"Mira"},{"family":"Li","given":"Wilmot"},{"family":"Hartmann","given":"Bjoern"}],"collection-title":"UIST '13","container-title":"Proceedings of the 26th annual ACM symposium on User interface software and technology","DOI":"10.1145/2501988.2502052","event-place":"New York, NY, USA","ISBN":"978-1-4503-2268-3","issued":{"date-parts":[[2013,10,8]]},"page":"141–150","publisher":"Association for Computing Machinery","publisher-place":"New York, NY, USA","source":"ACM Digital Library","title":"DemoCut: generating concise instructional videos for physical demonstrations","title-short":"DemoCut","type":"paper-conference","URL":"https://doi.org/10.1145/2501988.2502052"},
  {"id":"chiDemoWizReperformingSoftware2014","abstract":"Showing a live software demonstration during a talk can be engaging, but it is often not easy: presenters may struggle with (or worry about) unexpected software crashes and encounter issues such as mismatched screen resolutions or faulty network connectivity. Furthermore, it can be difficult to recall the steps to show while talking and operating the system all at the same time. An alternative is to present with pre-recorded screencast videos. It is, however, challenging to precisely match the narration to the video when using existing video players. We introduce DemoWiz, a video presentation system that provides an increased awareness of upcoming actions through glanceable visualizations. DemoWiz supports better control of timing by overlaying visual cues and enabling lightweight editing. A user study shows that our design significantly improves the presenters’ perceived ease of narration and timing compared to a system without visualizations that was similar to a standard playback control. Furthermore, nine (out of ten) participants preferred DemoWiz over the standard playback control with the last expressing no preference.","accessed":{"date-parts":[[2020,6,2]]},"author":[{"family":"Chi","given":"Pei-Yu"},{"family":"Lee","given":"Bongshin"},{"family":"Drucker","given":"Steven M."}],"container-title":"Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI '14","DOI":"10.1145/2556288.2557254","event":"the 32nd annual ACM conference","event-place":"Toronto, Ontario, Canada","ISBN":"978-1-4503-2473-1","issued":{"date-parts":[[2014]]},"language":"en","page":"1581-1590","publisher":"ACM Press","publisher-place":"Toronto, Ontario, Canada","source":"DOI.org (Crossref)","title":"DemoWiz: re-performing software demonstrations for a live presentation","title-short":"DemoWiz","type":"paper-conference","URL":"http://dl.acm.org/citation.cfm?doid=2556288.2557254"},
  {"id":"chilanaLemonAidSelectionbasedCrowdsourced2012","abstract":"Web-based technical support such as discussion forums and social networking sites have been successful at ensuring that most technical support questions eventually receive helpful answers. Unfortunately, finding these answers is still quite difficult, since users’ textual queries are often incomplete, imprecise, or use different vocabularies to describe the same problem. We present LemonAid, a new approach to help that allows users to find help by instead selecting a label, widget, link, image or other user interface (UI) element that they believe is relevant to their problem. LemonAid uses this selection to retrieve previously asked questions and their corresponding answers. The key insight that makes LemonAid work is that users tend to make similar selections in the interface for similar help needs and different selections for different help needs. Our initial evaluation shows that across a corpus of dozens of tasks and thousands of requests, LemonAid retrieved a result for 90% of help requests based on UI selections and, of those, over half had relevant matches in the top 2 results.","accessed":{"date-parts":[[2020,6,2]]},"author":[{"family":"Chilana","given":"Parmit K."},{"family":"Ko","given":"Andrew J."},{"family":"Wobbrock","given":"Jacob O."}],"container-title":"Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems - CHI '12","DOI":"10.1145/2207676.2208620","event":"the 2012 ACM annual conference","event-place":"Austin, Texas, USA","ISBN":"978-1-4503-1015-4","issued":{"date-parts":[[2012]]},"language":"en","page":"1549","publisher":"ACM Press","publisher-place":"Austin, Texas, USA","source":"DOI.org (Crossref)","title":"LemonAid: selection-based crowdsourced contextual help for web applications","title-short":"LemonAid","type":"paper-conference","URL":"http://dl.acm.org/citation.cfm?doid=2207676.2208620"},
  {"id":"chiMixTAutomaticGeneration2012","abstract":"As software interfaces become more complicated, users rely on tutorials to learn, creating an increasing demand for effective tutorials. Existing tutorials, however, are limited in their presentation: Static step-by-step tutorials are easy to scan but hard to create and don't always give all of the necessary information for how to accomplish a step. In contrast, video tutorials provide very detailed information and are easy to create, but they are hard to scan as the video-player timeline does not give an overview of the entire task. We present MixT, which automatically generates mixed media tutorials that combine the strengths of these tutorial types. MixT tutorials include step-by-step text descriptions and images that are easy to scan and short videos for each step that provide additional context and detail as needed. We ground our design in a formative study that shows that mixed-media tutorials outperform both static and video tutorials.","accessed":{"date-parts":[[2020,8,27]]},"author":[{"family":"Chi","given":"Pei-Yu"},{"family":"Ahn","given":"Sally"},{"family":"Ren","given":"Amanda"},{"family":"Hartmann","given":"Björn"},{"family":"Dontcheva","given":"Mira"},{"family":"Li","given":"Wilmot"}],"collection-title":"CHI EA '12","container-title":"CHI '12 Extended Abstracts on Human Factors in Computing Systems","DOI":"10.1145/2212776.2223662","event-place":"New York, NY, USA","ISBN":"978-1-4503-1016-1","issued":{"date-parts":[[2012,5,5]]},"page":"1499–1504","publisher":"Association for Computing Machinery","publisher-place":"New York, NY, USA","source":"ACM Digital Library","title":"MixT: automatic generation of step-by-step mixed media tutorials","title-short":"MixT","type":"paper-conference","URL":"https://doi.org/10.1145/2212776.2223662"},
  {"id":"ChooseComfortableMeasure","accessed":{"date-parts":[[2020,8,7]]},"title":"Choose a comfortable measure | The Elements of Typographic Style Applied to the Web","type":"webpage","URL":"http://webtypography.net/2.1.2"},
  {"id":"christensenInstantAvailabilityPatient2008","abstract":"BACKGROUND: In spite of successful adoption of electronic patient records (EPR) by Norwegian GPs, what constitutes the actual benefits and effects of the use of EPRs in the perspective of the GPs and patients has not been fully characterized. We wanted to study primary care physicians' use of electronic patient record (EPR) systems in terms of use of different EPR functions and the time spent on using the records, as well as the potential effects of EPR systems on the clinician-patient relationship.\nMETHODS: A combined qualitative and quantitative study that uses data collected from focus groups, observations of primary care encounters and a questionnaire survey of a random sample of general practitioners to describe their use of EPR in primary care.\nRESULTS: The overall availability of individual patient records had improved, but the availability of the information within each EPR was not satisfactory. GPs' use of EPRs were efficient and comprehensive, but have resulted in transfer of administrative work from secretaries to physicians. We found no indications of disturbance of the clinician-patient relationship by use of computers in this study.\nCONCLUSION: Although GPs are generally satisfied with their EPRs systems, there are still unmet needs and functionality to be covered. It is urgent to find methods that can make a better representation of information in large patient records as well as prevent EPRs from contributing to increased administrative workload of physicians.","author":[{"family":"Christensen","given":"Tom"},{"family":"Grimsmo","given":"Anders"}],"container-title":"BMC medical informatics and decision making","container-title-short":"BMC Med Inform Decis Mak","DOI":"10.1186/1472-6947-8-12","ISSN":"1472-6947","issued":{"date-parts":[[2008,3,28]]},"language":"eng","page":"12","PMCID":"PMC2386452","PMID":"18373858","source":"PubMed","title":"Instant availability of patient records, but diminished availability of patient information: a multi-method study of GP's use of electronic patient records","title-short":"Instant availability of patient records, but diminished availability of patient information","type":"article-journal","volume":"8"},
  {"id":"clearReadingComprehensionHow2018","abstract":"It's important to read books, but it's just as important to remember what you read. Read this article to learn three reading comprehension strategies.","accessed":{"date-parts":[[2020,7,26]]},"author":[{"family":"Clear","given":"James"}],"container-title":"James Clear","issued":{"date-parts":[[2018,9,3]]},"language":"en-US","source":"jamesclear.com","title":"Reading Comprehension: How to Retain More of Every Book You Read","title-short":"Reading Comprehension","type":"post-weblog","URL":"https://jamesclear.com/reading-comprehension-strategies"},
  {"id":"ColorButterickPractical","accessed":{"date-parts":[[2020,6,30]]},"title":"Color | Butterick’s Practical Typography","type":"webpage","URL":"https://practicaltypography.com/color.html"},
  {"id":"comeauBuildinganeffectivedevportfolio","author":[{"family":"Comeau","given":"Joshua"}],"page":"72","source":"Zotero","title":"building-an-effective-dev-portfolio","type":"article-journal"},
  {"id":"croskerryCognitiveForcingStrategies2003a","abstract":"Cognitive errors underlie most diagnostic errors that are made in the course of clinical decisionmaking in the emergency department. These errors are universal and are prevalent in the special milieu of the ED. Their properties appear to be distinct from those associated with the performance of procedures. They are often costly, but, importantly for both the patient and the physician, they are also highly preventable. Recent developments in education theory provide a means for minimizing and avoiding diagnostic error. Through the process of metacognition, clinicians can develop cognitive forcing strategies to abort such latent errors. Three levels of cognitive forcing strategies are described: universal, generic, and specific. Specific cognitive forcing strategies provide a formal cognitive debiasing approach to deal with what have previously been described as pitfalls in clinical reasoning. This metacognitive approach can be taught to practicing clinicians and to those in training to inoculate them against making diagnostic errors. The adoption of this method provides a systematic approach to cognitive root-cause analysis in the avoidance of adverse outcomes associated with delayed or missed diagnoses and with the clinical management of specific cases.","author":[{"family":"Croskerry","given":"Pat"}],"container-title":"Annals of Emergency Medicine","container-title-short":"Ann Emerg Med","DOI":"10.1067/mem.2003.22","ISSN":"0196-0644","issue":"1","issued":{"date-parts":[[2003,1]]},"language":"eng","page":"110-120","PMID":"12514691","publisher":"Elsevier","source":"PubMed","title":"Cognitive forcing strategies in clinical decisionmaking","type":"article-journal","volume":"41"},
  {"id":"czaplickiAsynchronousFunctionalReactive","abstract":"Graphical user interfaces (GUIs) mediate many of our interactions with computers. Functional Reactive Programming (FRP) is a promising approach to GUI design, providing high-level, declarative, compositional abstractions to describe user interactions and time-dependent computations. We present Elm, a practical FRP language focused on easy creation of responsive GUIs. Elm has two major features: simple declarative support for Asynchronous FRP; and purely functional graphical layout.","author":[{"family":"Czaplicki","given":"Evan"},{"family":"Chong","given":"Stephen"}],"language":"en","page":"12","source":"Zotero","title":"Asynchronous Functional Reactive Programming for GUIs","type":"article-journal"},
  {"id":"dabbishWhyKeepInterrupting2011","abstract":"Self-interruptions account for a significant portion of task switching in information-centric work contexts. However, most of the research to date has focused on understanding, analyzing and designing for external interruptions. The causes of self-interruptions are not well understood. In this paper we present an analysis of 889 hours of observed task switching behavior from 36 individuals across three high-technology information work organizations. Our analysis suggests that self-interruption is a function of organizational environment and individual differences, but also external interruptions experienced. We find that people in open office environments interrupt themselves at a higher rate. We also find that people are significantly more likely to interrupt themselves to return to solitary work associated with central working spheres, suggesting that self-interruption occurs largely as a function of prospective memory events. The research presented contributes substantially to our understanding of attention and multitasking in context.","accessed":{"date-parts":[[2020,9,15]]},"author":[{"family":"Dabbish","given":"Laura"},{"family":"Mark","given":"Gloria"},{"family":"González","given":"Víctor M."}],"collection-title":"CHI '11","container-title":"Proceedings of the SIGCHI Conference on Human Factors in Computing Systems","DOI":"10.1145/1978942.1979405","event-place":"New York, NY, USA","ISBN":"978-1-4503-0228-9","issued":{"date-parts":[[2011,5,7]]},"page":"3127–3130","publisher":"Association for Computing Machinery","publisher-place":"New York, NY, USA","source":"ACM Digital Library","title":"Why do i keep interrupting myself? environment, habit and self-interruption","title-short":"Why do i keep interrupting myself?","type":"paper-conference","URL":"https://doi.org/10.1145/1978942.1979405"},
  {"id":"DataCharacterizationIntelligent","accessed":{"date-parts":[[2020,8,5]]},"title":"Data characterization for intelligent graphics presentation | Proceedings of the SIGCHI Conference on Human Factors in Computing Systems","type":"webpage","URL":"https://dl.acm.org/doi/10.1145/97243.97273"},
  {"id":"denningMeshFlowInteractiveVisualization2011","abstract":"The construction of polygonal meshes remains a complex task in Computer Graphics, taking tens of thousands of individual operations over several hours of modeling time. The complexity of modeling in terms of number of operations and time makes it difficult for artists to understand all details of how meshes are constructed. We present MeshFlow, an interactive system for visualizing mesh construction sequences. MeshFlow hierarchically clusters mesh editing operations to provide viewers with an overview of the model construction while still allowing them to view more details on demand. We base our clustering on an analysis of the frequency of repeated operations and implement it using substituting regular expressions. By filtering operations based on either their type or which vertices they affect, MeshFlow also ensures that viewers can interactively focus on the relevant parts of the modeling process. Automatically generated graphical annotations visualize the clustered operations. We have tested MeshFlow by visualizing five mesh sequences each taking a few hours to model, and we found it to work well for all. We have also evaluated MeshFlow with a case study using modeling students. We conclude that our system provides useful visualizations that are found to be more helpful than video or document-form instructions in understanding mesh construction.","accessed":{"date-parts":[[2020,8,27]]},"author":[{"family":"Denning","given":"Jonathan D."},{"family":"Kerr","given":"William B."},{"family":"Pellacini","given":"Fabio"}],"container-title":"ACM Transactions on Graphics","container-title-short":"ACM Trans. Graph.","DOI":"10.1145/2010324.1964961","ISSN":"0730-0301","issue":"4","issued":{"date-parts":[[2011,7,25]]},"page":"66:1–66:8","source":"July 2011","title":"MeshFlow: interactive visualization of mesh construction sequences","title-short":"<i>MeshFlow</i>","type":"article-journal","URL":"https://doi.org/10.1145/2010324.1964961","volume":"30"},
  {"id":"derthickEnhancingDataExploration2001","abstract":"Backtracking and investigating alternative scenarios are a integral parts of exploratory data analysis. Yet today's interfaces cannot represent alternative exploration paths as a branching history, forcing the user to recognize conceptual branch points in a linear history. Further, the interface can only show information from one state at a time, forcing users to rely on memory to compare scenarios. Our system includes a tree-structured visualization for navigating across time and scenarios. The visualization also allows browsing the history and selectively undoing/redoing events within a scenario or across scenarios. It uses the AI formalism of contexts to maintain multiple, possibly mutually inconsistent, knowledge base states. Cross-context formulas can be written for explicit scenario comparison, including visualizations of scenario differences.","author":[{"family":"Derthick","given":"Mark"},{"family":"Roth","given":"Steven F."}],"issued":{"date-parts":[[2001]]},"source":"CiteSeer","title":"Enhancing Data Exploration with a Branching History of User Operations","type":"book"},
  {"id":"DesktopNeoRethinking","accessed":{"date-parts":[[2020,7,27]]},"title":"Desktop Neo – rethinking the desktop interface for productivity.","type":"webpage","URL":"https://desktopneo.com/"},
  {"id":"desmondEvictedPovertyProfit2016","author":[{"family":"Desmond","given":"Matthew"}],"edition":"First edition","event-place":"New York","ISBN":"978-0-553-44743-9 978-0-553-44744-6","issued":{"date-parts":[[2016]]},"language":"eng","number-of-pages":"418","publisher":"Crown Publishers","publisher-place":"New York","source":"Gemeinsamer Bibliotheksverbund ISBN","title":"Evicted: poverty and profit in the American city","title-short":"Evicted","type":"book"},
  {"id":"dietvorstAlgorithmAversionPeople2014","abstract":"Research shows that evidence-based algorithms more accurately predict the future than do human forecasters. Yet when forecasters are deciding whether to use a human forecaster or a statistical algorithm, they often choose the human forecaster. This phenomenon, which we call algorithm aversion, is costly, and it is important to understand its causes. We show that people are especially averse to algorithmic forecasters after seeing them perform, even when they see them outperform a human forecaster. This is because people more quickly lose confidence in algorithmic than human forecasters after seeing them make the same mistake. In 5 studies, participants either saw an algorithm make forecasts, a human make forecasts, both, or neither. They then decided whether to tie their incentives to the future predictions of the algorithm or the human. Participants who saw the algorithm perform were less confident in it, and less likely to choose it over an inferior human forecaster. This was true even among those who saw the algorithm outperform the human. (PsycINFO Database Record (c) 2014 APA, all rights reserved).","author":[{"family":"Dietvorst","given":"Berkeley"},{"family":"Simmons","given":"Joseph"},{"family":"Massey","given":"Cade"}],"container-title":"Journal of experimental psychology. General","container-title-short":"Journal of experimental psychology. General","DOI":"10.1037/xge0000033","issued":{"date-parts":[[2014,11,17]]},"source":"ResearchGate","title":"Algorithm Aversion: People Erroneously Avoid Algorithms After Seeing Them Err","title-short":"Algorithm Aversion","type":"article-journal","volume":"144"},
  {"id":"dixonPrefabImplementingAdvanced2010","abstract":"Current chasms between applications implemented with different user interface toolkits make it difficult to implement and explore potentially important interaction techniques in new and existing applications, limiting the progress and impact of human-computer interaction research. We examine an approach based in the single most common characteristic of all graphical user interface toolkits, that they ultimately paint pixels to a display. We present Prefab, a system for implementing advanced behaviors through the reverse engineering of the pixels in graphical interfaces. Informed by how user interface toolkits paint interfaces, Prefab features a separation of the modeling of widget layout from the recognition of widget appearance. We validate Prefab in implementations of three applications: target-aware pointing techniques, Phosphor transitions, and Side Views parameter spectrums. Working only from pixels, we demonstrate a single implementation of these enhancements in complex existing applications created in different user interface toolkits running on different windowing systems.","accessed":{"date-parts":[[2020,6,2]]},"author":[{"family":"Dixon","given":"Morgan"},{"family":"Fogarty","given":"James"}],"container-title":"Proceedings of the 28th international conference on Human factors in computing systems - CHI '10","DOI":"10.1145/1753326.1753554","event":"the 28th international conference","event-place":"Atlanta, Georgia, USA","ISBN":"978-1-60558-929-9","issued":{"date-parts":[[2010]]},"language":"en","page":"1525","publisher":"ACM Press","publisher-place":"Atlanta, Georgia, USA","source":"DOI.org (Crossref)","title":"Prefab: implementing advanced behaviors using pixel-based reverse engineering of interface structure","title-short":"Prefab","type":"paper-conference","URL":"http://portal.acm.org/citation.cfm?doid=1753326.1753554"},
  {"id":"DoctorsPerceptionsLinks","accessed":{"date-parts":[[2020,8,19]]},"title":"Doctors' perceptions of the links between stress and lowered clinical care - PubMed","type":"webpage","URL":"https://pubmed.ncbi.nlm.nih.gov/9089922/"},
  {"id":"doshi-velezRigorousScienceInterpretable2017","abstract":"As machine learning systems become ubiquitous, there has been a surge of interest in interpretable machine learning: systems that provide explanation for their outputs. These explanations are often used to qualitatively assess other criteria such as safety or non-discrimination. However, despite the interest in interpretability, there is very little consensus on what interpretable machine learning is and how it should be measured. In this position paper, we first define interpretability and describe when interpretability is needed (and when it is not). Next, we suggest a taxonomy for rigorous evaluation and expose open questions towards a more rigorous science of interpretable machine learning.","accessed":{"date-parts":[[2020,9,18]]},"author":[{"family":"Doshi-Velez","given":"Finale"},{"family":"Kim","given":"Been"}],"container-title":"arXiv:1702.08608 [cs, stat]","issued":{"date-parts":[[2017,3,2]]},"source":"arXiv.org","title":"Towards A Rigorous Science of Interpretable Machine Learning","type":"article-journal","URL":"http://arxiv.org/abs/1702.08608"},
  {"id":"drososWrexUnifiedProgrammingbyExample2020","abstract":"Data wrangling is a diffcult and time-consuming activity in computational notebooks, and existing wrangling tools do not ft the exploratory workfow for data scientists in these environments. We propose a unifed interaction model based on programming-by-example that generates readable code for a variety of useful data transformations, implemented as a Jupyter notebook extension called WREX. User study results demonstrate that data scientists are signifcantly more effective and effcient at data wrangling with WREX over manual programming. Qualitative participant feedback indicates that WREX was useful and reduced barriers in having to recall or look up the usage of various data transform functions. The synthesized code allowed data scientists to verify the intended data transformation, increased their trust and confdence in WREX, and ft seamlessly within their cell-based notebook workfows. This work suggests that presenting readable code to professional data scientists is an indispensable component of offering data wrangling tools in notebooks.","accessed":{"date-parts":[[2020,6,1]]},"author":[{"family":"Drosos","given":"Ian"},{"family":"Barik","given":"Titus"},{"family":"Guo","given":"Philip J."},{"family":"DeLine","given":"Robert"},{"family":"Gulwani","given":"Sumit"}],"container-title":"Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems","DOI":"10.1145/3313831.3376442","event":"CHI '20: CHI Conference on Human Factors in Computing Systems","event-place":"Honolulu HI USA","ISBN":"978-1-4503-6708-0","issued":{"date-parts":[[2020,4,21]]},"language":"en","page":"1-12","publisher":"ACM","publisher-place":"Honolulu HI USA","source":"DOI.org (Crossref)","title":"Wrex: A Unified Programming-by-Example Interaction for Synthesizing Readable Code for Data Scientists","title-short":"Wrex","type":"paper-conference","URL":"https://dl.acm.org/doi/10.1145/3313831.3376442"},
  {"id":"ekstrandSearchingSoftwareLearning2011","abstract":"Users of complex software applications frequently need to consult documentation, tutorials, and support resources to learn how to use the software and further their understanding of its capabilities. Existing online help systems provide limited context awareness through “what’s this?” and similar techniques. We examine the possibility of making more use of the user’s current context in a particular application to provide useful help resources. We provide an analysis and taxonomy of various aspects of application context and how they may be used in retrieving software help artifacts with web browsers, present the design of a context-aware augmented web search system, and describe a prototype implementation and initial user study of this system. We conclude with a discussion of open issues and an agenda for further research.","accessed":{"date-parts":[[2020,6,3]]},"author":[{"family":"Ekstrand","given":"Michael"},{"family":"Li","given":"Wei"},{"family":"Grossman","given":"Tovi"},{"family":"Matejka","given":"Justin"},{"family":"Fitzmaurice","given":"George"}],"container-title":"Proceedings of the 24th annual ACM symposium on User interface software and technology - UIST '11","DOI":"10.1145/2047196.2047220","event":"the 24th annual ACM symposium","event-place":"Santa Barbara, California, USA","ISBN":"978-1-4503-0716-1","issued":{"date-parts":[[2011]]},"language":"en","page":"195","publisher":"ACM Press","publisher-place":"Santa Barbara, California, USA","source":"DOI.org (Crossref)","title":"Searching for software learning resources using application context","type":"paper-conference","URL":"http://dl.acm.org/citation.cfm?doid=2047196.2047220"},
  {"id":"elliottGroundedTheoryApproach2002","abstract":"Abstract.  One potential barrier to the development of educational hypermedia is the design of current hypermedia authoring tools (HATs) that unfortunately requ","accessed":{"date-parts":[[2020,6,15]]},"author":[{"family":"Elliott","given":"G. J."},{"family":"Jones","given":"E."},{"family":"Barker","given":"P."}],"container-title":"Interacting with Computers","container-title-short":"Interact Comput","DOI":"10.1016/S0953-5438(02)00021-8","ISSN":"0953-5438","issue":"5","issued":{"date-parts":[[2002,10,1]]},"language":"en","page":"547-574","publisher":"Oxford Academic","source":"academic.oup.com","title":"A grounded theory approach to modelling learnability of hypermedia authoring tools","type":"article-journal","URL":"https://academic.oup.com/iwc/article/14/5/547/709320","volume":"14"},
  {"id":"farkasJohnCarrollNurnberg1990","abstract":"In The Nurnberg Funnel, J.M. Carroll (1990) reviews and reformulates his research on minimalism, a well-known approach to both print and online software documentation in which explicit instruction is severely reduced and users learn through a predominantly exploratory process. The authors examine the book and conclude that although it is stimulating and valuable, Carroll fails to make a compelling case of minimalism as a broadly applicable alternative to the contemporary multicomponent documentation set.<>","author":[{"family":"Farkas","given":"D.K."},{"family":"Williams","given":"T.R."}],"container-title":"IEEE Transactions on Professional Communication","DOI":"10.1109/47.62813","ISSN":"1558-1500","issue":"4","issued":{"date-parts":[[1990,12]]},"page":"182-187","source":"IEEE Xplore","title":"John Carroll's The Nurnberg Funnel and minimalist documentation","type":"article-journal","volume":"33"},
  {"id":"farkasRoleBalloonHelp1993","accessed":{"date-parts":[[2020,8,21]]},"author":[{"family":"Farkas","given":"David K."}],"container-title":"ACM SIGDOC Asterisk Journal of Computer Documentation","container-title-short":"SIGDOC Asterisk J. Comput. Doc.","DOI":"10.1145/154425.154426","ISSN":"0731-1001","issue":"2","issued":{"date-parts":[[1993,5]]},"language":"en","page":"3-19","source":"DOI.org (Crossref)","title":"The role of balloon help","type":"article-journal","URL":"https://dl.acm.org/doi/10.1145/154425.154426","volume":"17"},
  {"id":"farriImpactPrototypeVisualization2012","abstract":"BACKGROUND: EHR clinical document synthesis by clinicians may be time-consuming and error-prone due to the complex organization of narratives, excessive redundancy within documents, and, at times, inadvertent proliferation of data inconsistencies. Development of EHR systems that are easily adaptable to the user's work processes requires research into visualization techniques that can optimize information synthesis at the point of care.\nOBJECTIVE: To evaluate the effect of a prototype visualization tool for clinically relevant new information on clinicians' synthesis of EHR clinical documents and to understand how the tool may support future designs of clinical document user interfaces.\nMETHODS: A mixed methods approach to analyze the impact of the visualization tool was used with a sample of eight medical interns as they synthesized EHR clinical documents to accomplish a set of four pre-formed clinical scenarios using a think-aloud protocol.\nRESULTS: Differences in the missing (unretrieved) patient information (2.3±1.2 [with the visualization tool] vs. 6.8±1.2 [without the visualization tool], p = 0.08) and accurate inferences (1.3±0.3 vs 2.3±0.3, p = 0.09) were not statistically significant but suggest some improvement with the new information visualization tool. Despite the non-significant difference in total times to task completion (43±4 mins vs 36±4 mins, p = 0.35) we observed shorter times for two scenarios with the visualization tool, suggesting that the time-saving benefits may be more evident with certain clinical processes. Other observed effects of the tool include more intuitive navigation between patient details and increased efforts towards methodical synthesis of clinical documents.\nCONCLUSION: Our study provides some evidence that new information visualization in clinical notes may positively influence synthesis of patient information from EHR clinical documents. Our findings provide groundwork towards a more effective display of EHR clinical documents using advanced visualization applications.","author":[{"family":"Farri","given":"O."},{"family":"Rahman","given":"A."},{"family":"Monsen","given":"K. A."},{"family":"Zhang","given":"R."},{"family":"Pakhomov","given":"S. V."},{"family":"Pieczkiewicz","given":"D. S."},{"family":"Speedie","given":"S. M."},{"family":"Melton","given":"G. B."}],"container-title":"Applied Clinical Informatics","container-title-short":"Appl Clin Inform","DOI":"10.4338/ACI-2012-05-RA-0017","ISSN":"1869-0327","issue":"4","issued":{"date-parts":[[2012]]},"language":"eng","page":"404-418","PMCID":"PMC3613039","PMID":"23646087","source":"PubMed","title":"Impact of a prototype visualization tool for new information in EHR clinical documents","type":"article-journal","volume":"3"},
  {"id":"fernquistSketchsketchRevolutionEngaging2011","abstract":"We describe Sketch-Sketch Revolution, a new tutorial system that allows any user to experience the success of drawing content previously created by an expert artist. Sketch-Sketch Revolution not only guides users through the application user interface, it also provides assistance with the actual sketching. In addition, the system offers an authoring tool that enables artists to create content and then automatically generates a tutorial from their recorded workflow history. Sketch-Sketch Revolution is a unique hybrid tutorial system that combines in-product, content-centric and reactive tutorial methods to provide an engaging learning experience. A qualitative user study showed that our system successfully taught users how to interact with a drawing application user interface, gave users confidence they could recreate expert content, and was uniformly considered useful and easy to use.","accessed":{"date-parts":[[2020,8,28]]},"author":[{"family":"Fernquist","given":"Jennifer"},{"family":"Grossman","given":"Tovi"},{"family":"Fitzmaurice","given":"George"}],"collection-title":"UIST '11","container-title":"Proceedings of the 24th annual ACM symposium on User interface software and technology","DOI":"10.1145/2047196.2047245","event-place":"New York, NY, USA","ISBN":"978-1-4503-0716-1","issued":{"date-parts":[[2011,10,16]]},"page":"373–382","publisher":"Association for Computing Machinery","publisher-place":"New York, NY, USA","source":"ACM Digital Library","title":"Sketch-sketch revolution: an engaging tutorial system for guided sketching and application learning","title-short":"Sketch-sketch revolution","type":"paper-conference","URL":"https://doi.org/10.1145/2047196.2047245"},
  {"id":"fourneyCharacterizingUsabilityInteractive2011","abstract":"People routinely rely on Internet search engines to support their use of interactive systems: they issue queries to learn how to accomplish tasks, troubleshoot problems, and otherwise educate themselves on products. Given this common behavior, we argue that search query logs can usefully augment traditional usability methods by revealing the primary tasks and needs of a product’s user population. We term this use of search query logs CUTS—characterizing usability through search. In this paper, we introduce CUTS and describe an automated process for harvesting, ordering, labeling, ﬁltering, and grouping search queries related to a given product. Importantly, this data set can be assembled in minutes, is timely, has a high degree of ecological validity, and is arguably less prone to self-selection bias than data gathered via traditional usability methods. We demonstrate the utility of this approach by applying it to a number of popular software and hardware systems.","accessed":{"date-parts":[[2020,6,8]]},"author":[{"family":"Fourney","given":"Adam"},{"family":"Mann","given":"Richard"},{"family":"Terry","given":"Michael"}],"container-title":"Proceedings of the 2011 annual conference on Human factors in computing systems - CHI '11","DOI":"10.1145/1978942.1979205","event":"the 2011 annual conference","event-place":"Vancouver, BC, Canada","ISBN":"978-1-4503-0228-9","issued":{"date-parts":[[2011]]},"language":"en","page":"1817","publisher":"ACM Press","publisher-place":"Vancouver, BC, Canada","source":"DOI.org (Crossref)","title":"Characterizing the usability of interactive applications through query log analysis","type":"paper-conference","URL":"http://dl.acm.org/citation.cfm?doid=1978942.1979205"},
  {"id":"fourneyMiningOnlineSoftware2014","abstract":"Web-based software tutorials contain a wealth of information describing software tasks and workflows. There is growing interest in mining these resources for task modeling, automation, machine-guided help, interface search, and other applications. As a first step, past work has shown success in extracting individual commands from textual instructions. In this paper, we ask: How much further do we have to go to more fully interpret or automate a tutorial? We take a bottom-up approach, asking what it would take to: (1) interpret individual steps, (2) follow sequences of steps, and (3) locate procedural content in larger texts.","accessed":{"date-parts":[[2020,6,3]]},"author":[{"family":"Fourney","given":"Adam"},{"family":"Terry","given":"Michael"}],"container-title":"Proceedings of the extended abstracts of the 32nd annual ACM conference on Human factors in computing systems - CHI EA '14","DOI":"10.1145/2559206.2578862","event":"the extended abstracts of the 32nd annual ACM conference","event-place":"Toronto, Ontario, Canada","ISBN":"978-1-4503-2474-8","issued":{"date-parts":[[2014]]},"language":"en","page":"653-664","publisher":"ACM Press","publisher-place":"Toronto, Ontario, Canada","source":"DOI.org (Crossref)","title":"Mining online software tutorials: challenges and open problems","title-short":"Mining online software tutorials","type":"paper-conference","URL":"http://dl.acm.org/citation.cfm?doid=2559206.2578862"},
  {"id":"fourneyQueryfeatureGraphsBridging2011","abstract":"This paper introduces query-feature graphs, or QF-graphs. QF-graphs encode associations between high-level descriptions of user goals (articulated as natural language search queries) and the speciﬁc features of an interactive system relevant to achieving those goals. For example, a QF-graph for the GIMP graphics manipulation software links the query “GIMP black and white” to the commands “desaturate” and “grayscale.” We demonstrate how QF-graphs can be constructed using search query logs, search engine results, web page content, and localization data from interactive systems. An analysis of QF-graphs shows that the associations produced by our approach exhibit levels of accuracy that make them eminently usable in a range of real-world applications. Finally, we present three hypothetical user interface mechanisms that illustrate the potential of QF-graphs: search-driven interaction, dynamic tooltips, and app-to-app analogy search.","accessed":{"date-parts":[[2020,6,8]]},"author":[{"family":"Fourney","given":"Adam"},{"family":"Mann","given":"Richard"},{"family":"Terry","given":"Michael"}],"container-title":"Proceedings of the 24th annual ACM symposium on User interface software and technology - UIST '11","DOI":"10.1145/2047196.2047224","event":"the 24th annual ACM symposium","event-place":"Santa Barbara, California, USA","ISBN":"978-1-4503-0716-1","issued":{"date-parts":[[2011]]},"language":"en","page":"207","publisher":"ACM Press","publisher-place":"Santa Barbara, California, USA","source":"DOI.org (Crossref)","title":"Query-feature graphs: bridging user vocabulary and system functionality","title-short":"Query-feature graphs","type":"paper-conference","URL":"http://dl.acm.org/citation.cfm?doid=2047196.2047224"},
  {"id":"fowlerBlikiTwoHardThings","abstract":"There are only two hard things in Computer Science: cache invalidation and naming things -- Phil Karlton (bonus variations on the page)","accessed":{"date-parts":[[2020,7,3]]},"author":[{"family":"Fowler","given":"Martin"}],"container-title":"martinfowler.com","source":"martinfowler.com","title":"bliki: TwoHardThings","title-short":"bliki","type":"webpage","URL":"https://martinfowler.com/bliki/TwoHardThings.html"},
  {"id":"friedbergFactorsAffectingPhysician2013","abstract":"One of the American Medical Association's core strategic objectives is to advance health care delivery and payment models that enable high-quality, affordable care and restore and preserve physician satisfaction. Such changes could yield a more sustainable and effective health care system with highly motivated physicians. To that end, the AMA asked RAND Health to characterize the factors that lead to physician satisfaction. RAND sought to identify high-priority determinants of professional satisfaction that can be targeted within a variety of practice types, especially as smaller and independent practices are purchased by or become affiliated with hospitals and larger delivery systems. Researchers gathered data from 30 physician practices in six states, using a combination of surveys and semistructured interviews. This report presents the results of the subsequent analysis, addressing such areas as physicians' perceptions of the quality of care, use of electronic health records, autonomy, practice leadership, and work quantity and pace. Among other things, the researchers found that physicians who perceived themselves or their practices as providing high-quality care reported better professional satisfaction. Physicians, especially those in primary care, were frustrated when demands for greater quantity of care limited the time they could spend with each patient, detracting from the quality of care in some cases. Electronic health records were a source of both promise and frustration, with major concerns about interoperability between systems and with the amount of physician time involved in data entry--","author":[{"family":"Friedberg","given":"Mark W."}],"call-number":"R690 .F75 2013","collection-title":"Research report","event-place":"Santa Monica, CA","ISBN":"978-0-8330-8220-6","issued":{"date-parts":[[2013]]},"language":"en","note":"OCLC: ocn860753776","number-of-pages":"122","publisher":"Rand Health, American Medical Association","publisher-place":"Santa Monica, CA","source":"Library of Congress ISBN","title":"Factors affecting physician professional satisfaction and their implications for patient care, health systems, and health policy","type":"book"},
  {"id":"furlowInformationOverloadUnsustainable2020","abstract":"Electronic health records (EHRs) were supposed to usher in a golden age of improved\ncare, efficiency, and safety in the USA, increasing patient engagement and even reducing\nhealth-care disparities. But these systems have complicated interdisciplinary communication\nand worsened clinician workloads, contributing to clinician burnout, and opportunities\nfor error, researchers told The Lancet Respiratory Medicine. “Manufacturers told us\nEHRs would make our lives easier but when we counted the number of tasks and the time\nrequired, we found that a frighteningly large fraction of physicians' available time\nwas consumed by EHR tasks”, said Craig M Lilly (University of Massachusetts Medical\nSchool, Worcester, MA, USA).","accessed":{"date-parts":[[2020,9,9]]},"author":[{"family":"Furlow","given":"Bryant"}],"container-title":"The Lancet Respiratory Medicine","container-title-short":"The Lancet Respiratory Medicine","DOI":"10.1016/S2213-2600(20)30010-2","ISSN":"2213-2600, 2213-2619","issue":"3","issued":{"date-parts":[[2020,3,1]]},"language":"English","page":"243-244","PMID":"32135094","publisher":"Elsevier","source":"www.thelancet.com","title":"Information overload and unsustainable workloads in the era of electronic health records","type":"article-journal","URL":"https://www.thelancet.com/journals/lanres/article/PIIS2213-2600(20)30010-2/abstract","volume":"8"},
  {"id":"GitBottom","accessed":{"date-parts":[[2020,7,26]]},"title":"Git from the Bottom Up","type":"webpage","URL":"https://jwiegley.github.io/git-from-the-bottom-up/"},
  {"id":"glaserItTimeNew2020","abstract":"We need to shift from reactive to preventative care.","accessed":{"date-parts":[[2020,9,9]]},"author":[{"family":"Glaser","given":"John"}],"container-title":"Harvard Business Review","ISSN":"0017-8012","issued":{"date-parts":[[2020,6,12]]},"section":"Analytics","source":"hbr.org","title":"It’s Time for a New Kind of Electronic Health Record","type":"article-magazine","URL":"https://hbr.org/2020/06/its-time-for-a-new-kind-of-electronic-health-record"},
  {"id":"goetzgoldbergEHRsPrimaryCare2012","abstract":"OBJECTIVES: To understand the current use of electronic health records (EHRs) in small primary care practices and to explore experiences and perceptions of physicians and staff toward the benefits, challenges, and successful strategies for implementation and meaningful use of advanced EHR functions.\nSTUDY DESIGN: Qualitative case study of 6 primary care practices in Virginia.\nMETHODS: We performed surveys and in-depth interviews with clinicians and administrative staff (N = 38) and observed interpersonal relations and use of EHR functions over a 16-month period. Practices with an established EHR were selected based on a maximum variation of quality activities, location, and ownership.\nRESULTS: Physicians and staff report increased efficiency in retrieving medical records, storing patient information, coordination of care, and office operations. Costs, lack of knowledge of EHR functions, and problems transforming office operations were barriers reported for meaningful use of EHRs. Major disruption to patient care during upgrades and difficulty utilizing performance tracking and quality functions were also reported. Facilitators for adopting and using advanced EHR functions include team-based care, adequate technical support, communication and training for employees and physicians, alternative strategies for patient care during transition, and development of new processes and work flow procedures.\nCONCLUSIONS: Small practices experience difficulty with implementation and utilization of advanced EHR functions. Federal and state policies should continue to support practices by providing technical assistance and financial incentives, grants, and/or loans. Small practices should consider using regional extension center services and reaching out to colleagues and other healthcare organizations with similar EHR systems for advice and guidance.","author":[{"family":"Goetz Goldberg","given":"Debora"},{"family":"Kuzel","given":"Anton J."},{"family":"Feng","given":"Lisa Bo"},{"family":"DeShazo","given":"Jonathan P."},{"family":"Love","given":"Linda E."}],"container-title":"The American Journal of Managed Care","container-title-short":"Am J Manag Care","ISSN":"1936-2692","issue":"2","issued":{"date-parts":[[2012,2,1]]},"language":"eng","page":"e48-54","PMID":"22435884","source":"PubMed","title":"EHRs in primary care practices: benefits, challenges, and successful strategies","title-short":"EHRs in primary care practices","type":"article-journal","volume":"18"},
  {"id":"goodallOnlineHelpPart1992","accessed":{"date-parts":[[2020,6,15]]},"author":[{"family":"Goodall","given":"Susan D."}],"collection-title":"SIGDOC '92","container-title":"Proceedings of the 10th annual international conference on Systems documentation","DOI":"10.1145/147001.147024","event-place":"Ottawa, Ontario, Canada","ISBN":"978-0-89791-532-8","issued":{"date-parts":[[1992,11,1]]},"page":"169–174","publisher":"Association for Computing Machinery","publisher-place":"Ottawa, Ontario, Canada","source":"ACM Digital Library","title":"Online help: a part of documentation","title-short":"Online help","type":"paper-conference","URL":"https://doi.org/10.1145/147001.147024"},
  {"id":"goodallOnlineHelpReal1991","accessed":{"date-parts":[[2020,8,20]]},"author":[{"family":"Goodall","given":"Susan D."}],"collection-title":"SIGDOC '91","container-title":"Proceedings of the 9th annual international conference on Systems documentation","DOI":"10.1145/122778.122783","event-place":"New York, NY, USA","ISBN":"978-0-89791-452-9","issued":{"date-parts":[[1991,10,1]]},"page":"21–29","publisher":"Association for Computing Machinery","publisher-place":"New York, NY, USA","source":"ACM Digital Library","title":"Online help in the real world","type":"paper-conference","URL":"https://doi.org/10.1145/122778.122783"},
  {"id":"gopinathMLDrivenClinicalDocumentation","abstract":"Electronic health records (EHRs) have irrevocably changed the practice of medicine by systematizing the collection of patient-level data. However, clinicians currently spend more time documenting information in EHRs than interacting directly with patients, and have adapted to time-intensive note-writing by authoring free-text notes overloaded with jargon and acronyms. Clinical notes are therefore difficult to parse and largely unstructured. This negatively impacts the ability of EHR systems to convey information between different clinicians and institutions, to communicate medical findings to patients, and to allow for programmatic ingestion of data to derive further automatically-learned insights. In this thesis, we present a new EHR system that addresses these problems by using novel machine learning methods to streamline the processes by which clinicians enter in new information and surface relevant details from past medical records. Our intelligent interface aids physicians as they type, allowing for automatic suggestion and live-tagging of clinical concepts to alleviate documentation burden, while simultaneously enabling clinical decision support and contextual information synthesis. Furthermore, as clinicians craft notes we automatically structure and curate their free-text inputs, allowing for further data-driven innovation and improvement. This EHR can reduce physician burnout, decrease diagnostic error, and improve patient outcomes, all while collecting a corpus of clean, labelled clinical data. Our system is currently deployed live at the Beth Israel Deaconess Medical Center Emergency Department and is in use by doctors.","author":[{"family":"Gopinath","given":"Divya"}],"language":"en","page":"175","source":"Zotero","title":"ML-Driven Clinical Documentation","type":"article-journal"},
  {"id":"gordonStructuresWhyThings2003","author":[{"family":"Gordon","given":"James Edward"}],"edition":"2nd Da Capo Press ed","event-place":"New York","ISBN":"978-0-306-81283-5","issued":{"date-parts":[[2003]]},"language":"eng","note":"OCLC: ocm56414140","number-of-pages":"395","publisher":"Da Capo Press","publisher-place":"New York","source":"Gemeinsamer Bibliotheksverbund ISBN","title":"Structures, or, Why things don't fall down","type":"book"},
  {"id":"grablerGeneratingPhotoManipulation2009","abstract":"We present a demonstration-based system for automatically generating succinct step-by-step visual tutorials of photo manipulations. An author ﬁrst demonstrates the manipulation using an instrumented version of GIMP that records all changes in interface and application state. From the example recording, our system automatically generates tutorials that illustrate the manipulation using images, text, and annotations. It leverages automated image labeling (recognition of facial features and outdoor scene structures in our implementation) to generate more precise text descriptions of many of the steps in the tutorials. A user study comparing our automatically generated tutorials to hand-designed tutorials and screencapture video recordings ﬁnds that users are 20–44% faster and make 60–95% fewer errors using our tutorials. While our system focuses on tutorial generation, we also present some initial work on generating content-dependent macros that use image recognition to automatically transfer selection operations from the example image used in the demonstration to new target images. While our macros are limited to transferring selection operations we demonstrate automatic transfer of several common retouching techniques including eye recoloring, whitening teeth and sunset enhancement.","accessed":{"date-parts":[[2020,6,3]]},"author":[{"family":"Grabler","given":"Floraine"},{"family":"Agrawala","given":"Maneesh"},{"family":"Li","given":"Wilmot"},{"family":"Dontcheva","given":"Mira"},{"family":"Igarashi","given":"Takeo"}],"container-title":"ACM Transactions on Graphics","container-title-short":"ACM Trans. Graph.","DOI":"10.1145/1531326.1531372","ISSN":"0730-0301, 1557-7368","issue":"3","issued":{"date-parts":[[2009,7,27]]},"language":"en","page":"1-9","source":"DOI.org (Crossref)","title":"Generating photo manipulation tutorials by demonstration","type":"article-journal","URL":"https://dl.acm.org/doi/10.1145/1531326.1531372","volume":"28"},
  {"id":"grolWorkSatisfactionGeneral1985","abstract":"The emotional reactions of 57 general practitioners to three aspects of work was assessed by means of questionnaires. The quality of patient care was assessed by means of observations of general practice consultations, assessment of audiotaped consulting hour contacts and an analysis of the referral and prescription figures. A distinction was made between the degree of positive and the degree of negative feelings general practitioners have about their work. Many positive feelings (satisfaction, feeling at ease) correlated with more openness to patients, more attention to psychosocial aspects of the complaints but also with a higher rate of referral to medical specialists. On the other hand, many negative feelings (frustration, tension, lack of time) correlated with a high prescription rate and with giving little explanation to patients. To some extent the way that work is experienced by general practitioners correlated with the quality of care for the patients, but what constitutes cause and effect requires further study. A reflection of a doctor's own feelings about work should become part of training, continuing education and medical audit programmes.","author":[{"family":"Grol","given":"R."},{"family":"Mokkink","given":"H."},{"family":"Smits","given":"A."},{"family":"Eijk","given":"J.","non-dropping-particle":"van"},{"family":"Beek","given":"M."},{"family":"Mesker","given":"P."},{"family":"Mesker-Niesten","given":"J."}],"container-title":"Family Practice","container-title-short":"Fam Pract","DOI":"10.1093/fampra/2.3.128","ISSN":"0263-2136","issue":"3","issued":{"date-parts":[[1985,9]]},"language":"eng","page":"128-135","PMID":"4043602","source":"PubMed","title":"Work satisfaction of general practitioners and the quality of patient care","type":"article-journal","volume":"2"},
  {"id":"grossmanChronicleCaptureExploration2010","abstract":"We describe Chronicle, a new system that allows users to explore document workflow histories. Chronicle captures the entire video history of a graphical document, and provides links between the content and the relevant areas of the history. Users can indicate specific content of interest, and see the workflows, tools, and settings needed to reproduce the associated results, or to better understand how it was constructed to allow for informed modification. Thus, by storing the rich information regarding the document’s history workflow, Chronicle makes any working document a potentially powerful learning tool. We outline some of the challenges surrounding the development of such a system, and then describe our implementation within an image editing application. A qualitative user study produced extremely encouraging results, as users unanimously found the system both useful and easy to use.","accessed":{"date-parts":[[2020,6,3]]},"author":[{"family":"Grossman","given":"Tovi"},{"family":"Matejka","given":"Justin"},{"family":"Fitzmaurice","given":"George"}],"container-title":"Proceedings of the 23nd annual ACM symposium on User interface software and technology - UIST '10","DOI":"10.1145/1866029.1866054","event":"the 23nd annual ACM symposium","event-place":"New York, New York, USA","ISBN":"978-1-4503-0271-5","issued":{"date-parts":[[2010]]},"language":"en","page":"143","publisher":"ACM Press","publisher-place":"New York, New York, USA","source":"DOI.org (Crossref)","title":"Chronicle: capture, exploration, and playback of document workflow histories","title-short":"Chronicle","type":"paper-conference","URL":"http://portal.acm.org/citation.cfm?doid=1866029.1866054"},
  {"id":"grossmanStrategiesAcceleratingOnline2007","abstract":"Hotkeys are extremely useful in leveraging expert performance, but learning them is a slow process. This paper investigates alternative menu designs that can motivate and help users remember associations between menu commands and hotkeys. Building upon previous work on paired-associate learning, we suggest that the transition to expert use can be accelerated by manipulating feedback and cost associated with menu selection. We evaluate five designs in a pilot study and then two of the most promising ones in a formal experiment, showing that the speed of hotkey learning can indeed be significantly increased with little modifications to the standard menu/hotkey paradigm.","accessed":{"date-parts":[[2020,6,15]]},"author":[{"family":"Grossman","given":"Tovi"},{"family":"Dragicevic","given":"Pierre"},{"family":"Balakrishnan","given":"Ravin"}],"collection-title":"CHI '07","container-title":"Proceedings of the SIGCHI Conference on Human Factors in Computing Systems","DOI":"10.1145/1240624.1240865","event-place":"San Jose, California, USA","ISBN":"978-1-59593-593-9","issued":{"date-parts":[[2007,4,29]]},"page":"1591–1600","publisher":"Association for Computing Machinery","publisher-place":"San Jose, California, USA","source":"ACM Digital Library","title":"Strategies for accelerating on-line learning of hotkeys","type":"paper-conference","URL":"https://doi.org/10.1145/1240624.1240865"},
  {"id":"grossmanSurveySoftwareLearnability2009","abstract":"It is well-accepted that learnability is an important aspect of usability, yet there is little agreement as to how learnability should be defined, measured, and evaluated. In this paper, we present a survey of the previous definitions, metrics, and evaluation methodologies which have been used for software learnability. Our survey of evaluation methodologies leads us to a new question-suggestion protocol, which, in a user study, was shown to expose a significantly higher number of learnability issues in comparison to a more traditional think-aloud protocol. Based on the issues identified in our study, we present a classification system of learnability issues, and demonstrate how these categories can lead to guidelines for addressing the associated challenges.","author":[{"family":"Grossman","given":"Tovi"},{"family":"Fitzmaurice","given":"George"},{"family":"Attar","given":"Ramtin"}],"issued":{"date-parts":[[2009]]},"language":"en","page":"10","source":"Zotero","title":"A Survey of Software Learnability: Metrics, Methodologies and Guidelines","type":"article-journal"},
  {"id":"grossmanToolClipsInvestigationContextual2010","abstract":"We investigate the use of on-line contextual video assistance to improve the learnability of software functionality. After discussing motivations and design goals for such forms of assistance, we present our new technique, ToolClips. ToolClips augment traditional tooltips to provide users with quick and contextual access to both textual and video assistance. In an initial study we found that users successfully integrated ToolClip usage into the flow of their primary tasks to overcome learnability difficulties. In a second study, we found that with ToolClips, users successfully completed 7 times as many unfamiliar tasks, in comparison to using a commercial professionally developed on-line help system. Users also retained the information obtained from ToolClips, performing tasks significantly faster one week later.","accessed":{"date-parts":[[2020,6,3]]},"author":[{"family":"Grossman","given":"Tovi"},{"family":"Fitzmaurice","given":"George"}],"container-title":"Proceedings of the 28th international conference on Human factors in computing systems - CHI '10","DOI":"10.1145/1753326.1753552","event":"the 28th international conference","event-place":"Atlanta, Georgia, USA","ISBN":"978-1-60558-929-9","issued":{"date-parts":[[2010]]},"language":"en","page":"1515","publisher":"ACM Press","publisher-place":"Atlanta, Georgia, USA","source":"DOI.org (Crossref)","title":"ToolClips: an investigation of contextual video assistance for functionality understanding","title-short":"ToolClips","type":"paper-conference","URL":"http://portal.acm.org/citation.cfm?doid=1753326.1753552"},
  {"id":"halbertProgrammingExample1984","author":[{"family":"Halbert","given":"Daniel Conrad"}],"genre":"phd","issued":{"date-parts":[[1984]]},"note":"AAI8512843","number-of-pages":"132","publisher":"University of California, Berkeley","source":"ACM Digital Library","title":"Programming by example","type":"thesis"},
  {"id":"hanschVideoOnlineLearning2015","accessed":{"date-parts":[[2020,6,2]]},"author":[{"family":"Hansch","given":"Anna"},{"family":"Hillers","given":"Lisa"},{"family":"McConachie","given":"Katherine"},{"family":"Newman","given":"Christopher"},{"family":"Schildhauer","given":"Thomas"},{"family":"Schmidt","given":"Philipp"}],"container-title":"SSRN Electronic Journal","container-title-short":"SSRN Journal","DOI":"10.2139/ssrn.2577882","ISSN":"1556-5068","issued":{"date-parts":[[2015]]},"language":"en","source":"DOI.org (Crossref)","title":"Video and Online Learning: Critical Reflections and Findings from the Field","title-short":"Video and Online Learning","type":"article-journal","URL":"http://www.ssrn.com/abstract=2577882"},
  {"id":"harariSapiensBriefHistory2015","abstract":"\"From a renowned historian comes a groundbreaking narrative of humanity's creation and evolution--a #1 international bestseller--that explores the ways in which biology and history have defined us and enhanced our understanding of what it means to be \"human.\" One hundred thousand years ago, at least six different species of humans inhabited Earth. Yet today there is only one--homo sapiens. What happened to the others? And what may happen to us? Most books about the history of humanity pursue either a historical or a biological approach, but Dr. Yuval Noah Harari breaks the mold with this highly original book that begins about 70,000 years ago with the appearance of modern cognition. From examining the role evolving humans have played in the global ecosystem to charting the rise of empires, Sapiens integrates history and science to reconsider accepted narratives, connect past developments with contemporary concerns, and examine specific events within the context of larger ideas .Dr. Harari also compels us to look ahead, because over the last few decades humans have begun to bend laws of natural selection that have governed life for the past four billion years. We are acquiring the ability to design not only the world around us, but also ourselves. Where is this leading us, and what do we want to become? Featuring 27 photographs, 6 maps, and 25 illustrations/diagrams, this provocative and insightful work is sure to spark debate and is essential reading for aficionados of Jared Diamond, James Gleick, Matt Ridley, Robert Wright, and Sharon Moalem\"--","author":[{"family":"Harari","given":"Yuval N."}],"call-number":"CB113.H4 H3713 2015","edition":"First U.S. edition","event-place":"New York","ISBN":"978-0-06-231609-7 978-0-06-231611-0","issued":{"date-parts":[[2015]]},"language":"eng","number-of-pages":"443","publisher":"Harper","publisher-place":"New York","source":"Library of Congress ISBN","title":"Sapiens: a brief history of humankind","title-short":"Sapiens","type":"book"},
  {"id":"harrisonComparisonStillAnimated1995","accessed":{"date-parts":[[2020,6,15]]},"author":[{"family":"Harrison","given":"Susan M."}],"collection-title":"CHI '95","container-title":"Proceedings of the SIGCHI Conference on Human Factors in Computing Systems","DOI":"10.1145/223904.223915","event-place":"Denver, Colorado, USA","ISBN":"978-0-201-84705-5","issued":{"date-parts":[[1995,5,1]]},"page":"82–89","publisher":"ACM Press/Addison-Wesley Publishing Co.","publisher-place":"Denver, Colorado, USA","source":"ACM Digital Library","title":"A comparison of still, animated, or nonillustrated on-line help with written or spoken instructions in a graphical user interface","type":"paper-conference","URL":"https://doi.org/10.1145/223904.223915"},
  {"id":"hartmannHyperSourceBridgingGap2011","abstract":"Programmers frequently use the Web while writing code: they search for libraries, code examples, tutorials, and documentation. This link between code and visited Web pages remains implicit today. Connecting source code and browsing histories might help programmers maintain context, reduce the cost of Web page re-retrieval, and enhance understanding when code is shared. This note introduces HyperSource, an IDE augmentation that associates browsing histories with source code edits. HyperSource comprises a browser extension that logs visited pages; an IDE that tracks user activity and maps pages to code edits; a source document model that tracks visited pages at a character level; and a user interface that enables interaction with these histories. We discuss relevance heuristics and privacy issues inherent in this approach. Informal log analyses and user feedback suggest that our annotation model is promising for code editing and might also apply to other document authoring tasks after refinement.","author":[{"family":"Hartmann","given":"Björn"},{"family":"Dhillon","given":"Mark"},{"family":"Chan","given":"Matthew K"}],"issued":{"date-parts":[[2011]]},"language":"en","page":"4","source":"Zotero","title":"HyperSource: bridging the gap between source and code-related web sites","type":"article-journal"},
  {"id":"heerAgencyAutomationDesigning2019","abstract":"Much contemporary rhetoric regards the prospects and pitfalls of using artificial intelligence techniques to automate an increasing range of tasks, especially those once considered the purview of people alone. These accounts are often wildly optimistic, understating outstanding challenges while turning a blind eye to the human labor that undergirds and sustains ostensibly “automated” services. This long-standing focus on purely automated methods unnecessarily cedes a promising design space: one in which computational assistance augments and enriches, rather than replaces, people’s intellectual work. This tension between human agency and machine automation poses vital challenges for design and engineering. In this work, we consider the design of systems that enable rich, adaptive interaction between people and algorithms. We seek to balance the often-complementary strengths and weaknesses of each, while promoting human control and skillful action. We share case studies of interactive systems we have developed in three arenas—data wrangling, exploratory analysis, and natural language translation—that integrate proactive computational support into interactive systems. To improve outcomes and support learning by both people and machines, we describe the use of shared representations of tasks augmented with predictive models of human capabilities and actions. We conclude with a discussion of future prospects and scientific frontiers for intelligence augmentation research.","accessed":{"date-parts":[[2020,10,21]]},"author":[{"family":"Heer","given":"Jeffrey"}],"container-title":"Proceedings of the National Academy of Sciences","container-title-short":"PNAS","DOI":"10.1073/pnas.1807184115","ISSN":"0027-8424, 1091-6490","issue":"6","issued":{"date-parts":[[2019,2,5]]},"language":"en","page":"1844-1850","PMID":"30718389","publisher":"National Academy of Sciences","section":"Colloquium Paper","source":"www.pnas.org","title":"Agency plus automation: Designing artificial intelligence into interactive systems","title-short":"Agency plus automation","type":"article-journal","URL":"https://www.pnas.org/content/116/6/1844","volume":"116"},
  {"id":"heerAnimatedTransitionsStatistical2007","abstract":"In this paper we investigate the effectiveness of animated transitions between common statistical data graphics such as bar charts, pie charts, and scatter plots. We extend theoretical models of data graphics to include such transitions, introducing a taxonomy of transition types. We then propose design principles for creating effective transitions and illustrate the application of these principles in DynaVis, a visualization system featuring animated data graphics. Two controlled experiments were conducted to assess the efficacy of various transition types, finding that animated transitions can significantly improve graphical perception.","accessed":{"date-parts":[[2020,8,9]]},"author":[{"family":"Heer","given":"Jeffrey"},{"family":"Robertson","given":"George"}],"container-title":"IEEE Transactions on Visualization and Computer Graphics","container-title-short":"IEEE Transactions on Visualization and Computer Graphics","DOI":"10.1109/TVCG.2007.70539","ISSN":"1077-2626","issue":"6","issued":{"date-parts":[[2007,11,1]]},"page":"1240–1247","source":"November 2007","title":"Animated Transitions in Statistical Data Graphics","type":"article-journal","URL":"https://doi.org/10.1109/TVCG.2007.70539","volume":"13"},
  {"id":"heerGraphicalHistoriesVisualization2008","abstract":"Interactive history tools, ranging from basic undo and redo to branching timelines of user actions, facilitate iterative forms of interaction. In this paper, we investigate the design of history mechanisms for information visualization. We present a design space analysis of both architectural and interface issues, identifying design decisions and associated trade-offs. Based on this analysis, we contribute a design study of graphical history tools for Tableau, a database visualization system. These tools record and visualize interaction histories, support data analysis and communication of findings, and contribute novel mechanisms for presenting, managing, and exporting histories. Furthermore, we have analyzed aggregated collections of history sessions to evaluate Tableau usage. We describe additional tools for analyzing userspsila history logs and how they have been applied to study usage patterns in Tableau.","author":[{"family":"Heer","given":"Jeffrey"},{"family":"Mackinlay","given":"Jock"},{"family":"Stolte","given":"Chris"},{"family":"Agrawala","given":"Maneesh"}],"container-title":"IEEE Transactions on Visualization and Computer Graphics","DOI":"10.1109/TVCG.2008.137","ISSN":"1941-0506","issue":"6","issued":{"date-parts":[[2008,11]]},"page":"1189-1196","source":"IEEE Xplore","title":"Graphical Histories for Visualization: Supporting Analysis, Communication, and Evaluation","title-short":"Graphical Histories for Visualization","type":"article-journal","volume":"14"},
  {"id":"hellersteinLookingBackPostgres2019","abstract":"This is a recollection of the UC Berkeley Postgres project, which was led by Mike Stonebraker from the mid-1980's to the mid-1990's. The article was solicited for Stonebraker's Turing Award book, as one of many personal/historical recollections. As a result it focuses on Stonebraker's design ideas and leadership. But Stonebraker was never a coder, and he stayed out of the way of his development team. The Postgres codebase was the work of a team of brilliant students and the occasional university \"staff programmers\" who had little more experience (and only slightly more compensation) than the students. I was lucky to join that team as a student during the latter years of the project. I got helpful input on this writeup from some of the more senior students on the project, but any errors or omissions are mine. If you spot any such, please contact me and I will try to fix them.","accessed":{"date-parts":[[2020,6,15]]},"author":[{"family":"Hellerstein","given":"Joseph M."}],"container-title":"arXiv:1901.01973 [cs]","issued":{"date-parts":[[2019,1,7]]},"source":"arXiv.org","title":"Looking Back at Postgres","type":"article-journal","URL":"http://arxiv.org/abs/1901.01973"},
  {"id":"hillEditWearRead1992","abstract":"We describe two applications that illustrate the idea of computational wear in the domain of document processing. By graphically depicting the history of author and reader interactions with documents, these applications offer otherwise unavailable information to guide work. We discuss how their design accords with a theory of professional work and an informational physics perspective on interface design.","accessed":{"date-parts":[[2020,6,2]]},"author":[{"family":"Hill","given":"William C."},{"family":"Hollan","given":"James D."},{"family":"Wroblewski","given":"Dave"},{"family":"McCandless","given":"Tim"}],"container-title":"Proceedings of the SIGCHI conference on Human factors in computing systems  - CHI '92","DOI":"10.1145/142750.142751","event":"the SIGCHI conference","event-place":"Monterey, California, United States","ISBN":"978-0-89791-513-7","issued":{"date-parts":[[1992]]},"language":"en","page":"3-9","publisher":"ACM Press","publisher-place":"Monterey, California, United States","source":"DOI.org (Crossref)","title":"Edit wear and read wear","type":"paper-conference","URL":"http://portal.acm.org/citation.cfm?doid=142750.142751"},
  {"id":"horvitzPrinciplesMixedinitiativeUser1999","abstract":"Recent debate has centered on the relative promise of focusing user-interface research on developing new metaphors and tools that enhance users abilities to directly manipulate objects versus directing effort toward developing interface agents that provide automation. In this paper, we review principles that show promise for allowing engineers to enhance human-computer interaction through an elegant coupling of automated services with direct manipulation. Key ideas will be highlighted in terms of the Lookout system for scheduling and meeting management.","accessed":{"date-parts":[[2020,10,14]]},"author":[{"family":"Horvitz","given":"Eric"}],"collection-title":"CHI '99","container-title":"Proceedings of the SIGCHI conference on Human Factors in Computing Systems","DOI":"10.1145/302979.303030","event-place":"New York, NY, USA","ISBN":"978-0-201-48559-2","issued":{"date-parts":[[1999,5,1]]},"page":"159–166","publisher":"Association for Computing Machinery","publisher-place":"New York, NY, USA","source":"ACM Digital Library","title":"Principles of mixed-initiative user interfaces","type":"paper-conference","URL":"https://doi.org/10.1145/302979.303030"},
  {"id":"huangGraphstractMinimalGraphical2007","abstract":"We explore the use of abstracted screenshots as part of a new help interface. Graphstract, an implementation of a graphical help system, extends the ideas of textually oriented Minimal Manuals to the use of screenshots, allowing multiple small graphical elements to be shown in a limited space. This allows a user to get an overview of a complex sequential task as a whole. The ideas have been developed by three iterations of prototyping and evaluation. A user study shows that Graphstract helps users perform tasks faster on some but not all tasks. Due to their graphical nature, it is possible to construct Graphstracts automatically from pre-recorded interactions. A second study shows that automated capture and replay is a low-cost method for authoring Graphstracts, and the resultant help is as understandable as manually constructed help.","accessed":{"date-parts":[[2020,6,3]]},"author":[{"family":"Huang","given":"Jeff"},{"family":"B. Twidale","given":"Michael B."}],"container-title":"Proceedings of the 20th annual ACM symposium on User interface software and technology  - UIST '07","DOI":"10.1145/1294211.1294248","event":"the 20th annual ACM symposium","event-place":"Newport, Rhode Island, USA","issued":{"date-parts":[[2007]]},"language":"en","page":"203","publisher":"ACM Press","publisher-place":"Newport, Rhode Island, USA","source":"DOI.org (Crossref)","title":"Graphstract: minimal graphical help for computers","title-short":"Graphstract","type":"paper-conference","URL":"http://portal.acm.org/citation.cfm?doid=1294211.1294248"},
  {"id":"hudsonInvestigatingHowOnline2018","abstract":"3D design software is increasingly available to children through libraries, maker spaces, and for free on the web. This unprecedented availability has the potential to unleash children's creativity in cutting edge domains, but is limited by the steep learning curve of the software. Unfortunately, there is little past work studying the breakdowns faced by children in this domain-most past work has focused on adults in professional settings. In this paper, we present a study of online learning resources and help-seeking strategies available to children starting out with 3D design software. We find that children face a range of challenges when trying to learn 3D design independently-tutorials present instructions at a granularity that leads to overlooked and incorrectly-performed actions, and online help-seeking is largely ineffective due to challenges with query formulation and evaluating found information. Based on our findings, we recommend design directions for next-generation help and learning systems tailored to children.","accessed":{"date-parts":[[2020,8,27]]},"author":[{"family":"Hudson","given":"Nathaniel"},{"family":"Lafreniere","given":"Benjamin"},{"family":"Chilana","given":"Parmit K."},{"family":"Grossman","given":"Tovi"}],"collection-title":"CHI '18","container-title":"Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems","DOI":"10.1145/3173574.3173831","event-place":"New York, NY, USA","ISBN":"978-1-4503-5620-6","issued":{"date-parts":[[2018,4,21]]},"page":"1–14","publisher":"Association for Computing Machinery","publisher-place":"New York, NY, USA","source":"ACM Digital Library","title":"Investigating How Online Help and Learning Resources Support Children's Use of 3D Design Software","type":"paper-conference","URL":"https://doi.org/10.1145/3173574.3173831"},
  {"id":"InclusiveComponentsBook","abstract":"The book (ePub, PDF and Kindle) examines common web UI patterns through the lens of inclusion. The aim is to find more accessible and robust solutions for the patterns we author every day.","accessed":{"date-parts":[[2020,7,25]]},"language":"en","source":"book.inclusive-components.design","title":"Inclusive Components: The Book","title-short":"Inclusive Components","type":"webpage","URL":"http://book.inclusive-components.design"},
  {"id":"instituteofmedicineuscommitteeonqualityofhealthcareinamericaErrHumanBuilding2000","abstract":"Experts estimate that as many as 98,000 people die in any given year from medical errors that occur in hospitals. That's more than die from motor vehicle accidents, breast cancer, or AIDS--three causes that receive far more public attention. Indeed, more people die annually from medication errors than from workplace injuries. Add the financial cost to the human tragedy, and medical error easily rises to the top ranks of urgent, widespread public problems. To Err Is Human breaks the silence that has surrounded medical errors and their consequence--but not by pointing fingers at caring health care professionals who make honest mistakes. After all, to err is human. Instead, this book sets forth a national agenda--with state and local implications--for reducing medical errors and improving patient safety through the design of a safer health system. This volume reveals the often startling statistics of medical error and the disparity between the incidence of error and public perception of it, given many patients' expectations that the medical profession always performs perfectly. A careful examination is made of how the surrounding forces of legislation, regulation, and market activity influence the quality of care provided by health care organizations and then looks at their handling of medical mistakes. Using a detailed case study, the book reviews the current understanding of why these mistakes happen. A key theme is that legitimate liability concerns discourage reporting of errors--which begs the question, \"How can we learn from our mistakes?\" Balancing regulatory versus market-based initiatives and public versus private efforts, the Institute of Medicine presents wide-ranging recommendations for improving patient safety, in the areas of leadership, improved data collection and analysis, and development of effective systems at the level of direct patient care. To Err Is Human asserts that the problem is not bad people in health care--it is that good people are working in bad systems that need to be made safer. Comprehensive and straightforward, this book offers a clear prescription for raising the level of patient safety in American health care. It also explains how patients themselves can influence the quality of care that they receive once they check into the hospital. This book will be vitally important to federal, state, and local health policy makers and regulators, health professional licensing officials, hospital administrators, medical educators and students, health caregivers, health journalists, patient advocates--as well as patients themselves.  First in a series of publications from the Quality of Health Care in America, a project initiated by the Institute of Medicine","accessed":{"date-parts":[[2020,8,6]]},"author":[{"literal":"Institute of Medicine (US) Committee on Quality of Health Care in America"}],"call-number":"NBK225182","editor":[{"family":"Kohn","given":"Linda T."},{"family":"Corrigan","given":"Janet M."},{"family":"Donaldson","given":"Molla S."}],"event-place":"Washington (DC)","ISBN":"978-0-309-06837-6","issued":{"date-parts":[[2000]]},"language":"eng","PMID":"25077248","publisher":"National Academies Press (US)","publisher-place":"Washington (DC)","source":"PubMed","title":"To Err is Human: Building a Safer Health System","title-short":"To Err is Human","type":"book","URL":"http://www.ncbi.nlm.nih.gov/books/NBK225182/"},
  {"id":"jacksonEditingComputerHardware2001","accessed":{"date-parts":[[2020,6,15]]},"author":[{"family":"Jackson","given":"Sue"}],"collection-title":"SIGDOC '01","container-title":"Proceedings of the 19th annual international conference on Computer documentation","DOI":"10.1145/501516.501530","event-place":"Sante Fe, New Mexico, USA","ISBN":"978-1-58113-295-3","issued":{"date-parts":[[2001,10,21]]},"page":"68–72","publisher":"Association for Computing Machinery","publisher-place":"Sante Fe, New Mexico, USA","source":"ACM Digital Library","title":"Editing computer hardware procedures for multimedia presentation","type":"paper-conference","URL":"https://doi.org/10.1145/501516.501530"},
  {"id":"johnsonAnimatedPedagogicalAgents","abstract":"Recent years have witnessed the birth of a new paradigm for learning environments: animated pedagogical agents. These lifelike autonomous characters cohabit learning environments with students to create rich, face-to-face learning interactions. This opens up exciting new possibilities; for example, agents can demonstrate complex tasks, employ locomotion and gesture to focus students’ attention on the most salient aspect of the task at hand, and convey emotional responses to the tutorial situation. Animated pedagogical agents offer great promise for broadening the bandwidth of tutorial communication and increasing learning environments’ ability to engage and motivate students. This article sets forth the motivations behind animated pedagogical agents, describes the key capabilities they offer, and discusses the technical issues they raise. The discussion is illustrated with descriptions of a number of animated agents that represent the current state of the art.","author":[{"family":"Johnson","given":"W Lewis"},{"family":"Rickel","given":"Jeff W"},{"family":"Lester","given":"James C"}],"language":"en","page":"32","source":"Zotero","title":"Animated Pedagogical Agents: Face-to-Face Interaction in Interactive Learning Environments","type":"article-journal"},
  {"id":"kaipioUsabilityProblemsNot2017","abstract":"Purpose\nSurvey studies of health information systems use tend to focus on availability of functionalities, adoption and intensity of use. Usability surveys have not been systematically conducted by any healthcare professional groups on a national scale on a repeated basis. This paper presents results from two cross-sectional surveys of physicians’ experiences with the usability of currently used EHR systems in Finland. The research questions were: To what extent has the overall situation improved between 2010 and 2014? What differences are there between healthcare sectors?\nMethods\nIn the spring of 2014, a survey was conducted in Finland using a questionnaire that measures usability and respondents’ user experiences with electronic health record (EHR) systems. The survey was targeted to physicians who were actively doing clinical work. Twenty-four usability-related statements, that were identical in 2010 and 2014, were analysed from the survey. The respondents were also asked to give an overall rating of the EHR system they used. The study data comprised responses from 3081 physicians from the year 2014 and from 3223 physicians in the year 2010, who were using the nine most commonly used EHR system brands in Finland.\nResults\nPhysicians’ assessments of the usability of their EHR system remain as critical as they were in 2010. On a scale from 1 (‘fail’) to 7 (‘excellent’) the average of overall ratings of their principally used EHR systems varied from 3.2 to 4.4 in 2014 (and in 2010 from 2.5 to 4.3). The results show some improvements in the following EHR functionalities and characteristics: summary view of patient’s health status, prevention of errors associated with medication ordering, patient’s medication list as well as support for collaboration and information exchange between the physician and the nurses. Even so, support for cross-organizational collaboration between physicians and for physician-patient collaboration were still considered inadequate. Satisfaction with technical features had not improved in four years. The results show marked differences between the EHR system brands as well as between healthcare sectors (private sector, public hospitals, primary healthcare). Compared to responses from the public sector, physicians working in the private sector were more satisfied with their EHR systems with regards to statements about user interface characteristics and support for routine tasks. Overall, the study findings are similar to our previous study conducted in 2010.\nConclusions\nSurveys about the usability of EHR systems are needed to monitor their development at regional and national levels. To our knowledge, this study is the first national eHealth observatory questionnaire that focuses on usability and is used to monitor the long-term development of EHRs. The results do not show notable improvements in physician’s ratings for their EHRs between the years 2010 and 2014 in Finland. Instead, the results indicate the existence of serious problems and deficiencies which considerably hinder the efficiency of EHR use and physician’s routine work. The survey results call for considerable amount of development work in order to achieve the expected benefits of EHR systems and to avoid technology-induced errors which may endanger patient safety. The findings of repeated surveys can be used to inform healthcare providers, decision makers and politicians about the current state of EHR usability and differences between brands as well as for improvements of EHR usability. This survey will be repeated in 2017 and there is a plan to include other healthcare professional groups in future surveys.","accessed":{"date-parts":[[2020,8,5]]},"author":[{"family":"Kaipio","given":"Johanna"},{"family":"Lääveri","given":"Tinja"},{"family":"Hyppönen","given":"Hannele"},{"family":"Vainiomäki","given":"Suvi"},{"family":"Reponen","given":"Jarmo"},{"family":"Kushniruk","given":"Andre"},{"family":"Borycki","given":"Elizabeth"},{"family":"Vänskä","given":"Jukka"}],"container-title":"International Journal of Medical Informatics","container-title-short":"International Journal of Medical Informatics","DOI":"10.1016/j.ijmedinf.2016.10.010","ISSN":"1386-5056","issued":{"date-parts":[[2017,1,1]]},"language":"en","page":"266-281","source":"ScienceDirect","title":"Usability problems do not heal by themselves: National survey on physicians’ experiences with EHRs in Finland","title-short":"Usability problems do not heal by themselves","type":"article-journal","URL":"http://www.sciencedirect.com/science/article/pii/S1386505616302258","volume":"97"},
  {"id":"kaurInterpretingInterpretabilityUnderstanding2020","abstract":"Machine learning (ML) models are now routinely deployed in domains ranging from criminal justice to healthcare. With this newfound ubiquity, ML has moved beyond academia and grown into an engineering discipline. To that end, interpretability tools have been designed to help data scientists and machine learning practitioners better understand how ML models work. However, there has been little evaluation of the extent to which these tools achieve this goal. We study data scientists’ use of two existing interpretability tools, the InterpretML implementation of GAMs and the SHAP Python package. We conduct a contextual inquiry (N=11) and a survey (N=197) of data scientists to observe how they use interpretability tools to uncover common issues that arise when building and evaluating ML models. Our results indicate that data scientists over-trust and misuse interpretability tools. Furthermore, few of our participants were able to accurately describe the visualizations output by these tools. We highlight qualitative themes for data scientists’ mental models of interpretability tools. We conclude with implications for researchers and tool designers, and contextualize our ﬁndings in the social science literature.","accessed":{"date-parts":[[2020,9,28]]},"author":[{"family":"Kaur","given":"Harmanpreet"},{"family":"Nori","given":"Harsha"},{"family":"Jenkins","given":"Samuel"},{"family":"Caruana","given":"Rich"},{"family":"Wallach","given":"Hanna"},{"family":"Wortman Vaughan","given":"Jennifer"}],"container-title":"Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems","DOI":"10.1145/3313831.3376219","event":"CHI '20: CHI Conference on Human Factors in Computing Systems","event-place":"Honolulu HI USA","ISBN":"978-1-4503-6708-0","issued":{"date-parts":[[2020,4,21]]},"language":"en","page":"1-14","publisher":"ACM","publisher-place":"Honolulu HI USA","source":"DOI.org (Crossref)","title":"Interpreting Interpretability: Understanding Data Scientists' Use of Interpretability Tools for Machine Learning","title-short":"Interpreting Interpretability","type":"paper-conference","URL":"https://dl.acm.org/doi/10.1145/3313831.3376219"},
  {"id":"kayWhenIshMy2016","abstract":"Users often rely on realtime predictions in everyday contexts like riding the bus, but may not grasp that such predictions are subject to uncertainty. Existing uncertainty visualizations may not align with user needs or how they naturally reason about probability. We present a novel mobile interface design and visualization of uncertainty for transit predictions on mobile phones based on discrete outcomes. To develop it, we identified domain specific design requirements for visualizing uncertainty in transit prediction through: 1) a literature review, 2) a large survey of users of a popular realtime transit application, and 3) an iterative design process. We present several candidate visualizations of uncertainty for realtime transit predictions in a mobile context, and we propose a novel discrete representation of continuous outcomes designed for small screens, quantile dotplots. In a controlled experiment we find that quantile dotplots reduce the variance of probabilistic estimates by ~1.15 times compared to density plots and facilitate more confident estimation by end-users in the context of realtime transit prediction scenarios.","accessed":{"date-parts":[[2020,10,26]]},"author":[{"family":"Kay","given":"Matthew"},{"family":"Kola","given":"Tara"},{"family":"Hullman","given":"Jessica R."},{"family":"Munson","given":"Sean A."}],"collection-title":"CHI '16","container-title":"Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems","DOI":"10.1145/2858036.2858558","event-place":"New York, NY, USA","ISBN":"978-1-4503-3362-7","issued":{"date-parts":[[2016,5,7]]},"page":"5092–5103","publisher":"Association for Computing Machinery","publisher-place":"New York, NY, USA","source":"ACM Digital Library","title":"When (ish) is My Bus? User-centered Visualizations of Uncertainty in Everyday, Mobile Predictive Systems","title-short":"When (ish) is My Bus?","type":"paper-conference","URL":"https://doi.org/10.1145/2858036.2858558"},
  {"id":"kelleherStencilsbasedTutorialsDesign2005","abstract":"Users of traditional tutorials and help systems often have difficulty finding the components described or pictured in the procedural instructions. Users also unintentionally miss steps, and perform actions that the documentation’s authors did not intend, moving the application into an unknown state. We introduce Stencils, an interaction technique for presenting tutorials that uses translucent colored stencils containing holes that direct the user’s attention to the correct interface component and prevent the user from interacting with other components. Sticky notes on the stencil’s surface provide necessary tutorial material in the context of the application. In a user study comparing a Stencils-based and paper-based version of the same tutorial in Alice, a complex software application designed to teach introductory computer programming, we found that users of a Stencils-based tutorial were able complete the tutorial 26% faster, with fewer errors, and less reliance on human assistance. Users of the Stencils-based and paper-based tutorials attained statistically similar levels of learning.","accessed":{"date-parts":[[2020,6,3]]},"author":[{"family":"Kelleher","given":"Caitlin"},{"family":"Pausch","given":"Randy"}],"container-title":"Proceedings of the SIGCHI conference on Human factors in computing systems  - CHI '05","DOI":"10.1145/1054972.1055047","event":"the SIGCHI conference","event-place":"Portland, Oregon, USA","ISBN":"978-1-58113-998-3","issued":{"date-parts":[[2005]]},"language":"en","page":"541","publisher":"ACM Press","publisher-place":"Portland, Oregon, USA","source":"DOI.org (Crossref)","title":"Stencils-based tutorials: design and evaluation","title-short":"Stencils-based tutorials","type":"paper-conference","URL":"http://portal.acm.org/citation.cfm?doid=1054972.1055047"},
  {"id":"keshavHowReadPaper2007","abstract":"Researchers spend a great deal of time reading research papers. However, this skill is rarely taught, leading to much wasted effort. This article outlines a practical and efficient three-pass method for reading research papers. I also describe how to use this method to do a literature survey.","accessed":{"date-parts":[[2020,8,26]]},"author":[{"family":"Keshav","given":"S."}],"container-title":"ACM SIGCOMM Computer Communication Review","container-title-short":"SIGCOMM Comput. Commun. Rev.","DOI":"10.1145/1273445.1273458","ISSN":"0146-4833","issue":"3","issued":{"date-parts":[[2007,7,20]]},"page":"83–84","source":"July 2007","title":"How to read a paper","type":"article-journal","URL":"https://doi.org/10.1145/1273445.1273458","volume":"37"},
  {"id":"khoussainovaSnipSuggestContextawareAutocompletion2010","abstract":"In this paper, we present SnipSuggest, a system that provides onthe-go, context-aware assistance in the SQL composition process. SnipSuggest aims to help the increasing population of non-expert database users, who need to perform complex analysis on their large-scale datasets, but have difﬁculty writing SQL queries. As a user types a query, SnipSuggest recommends possible additions to various clauses in the query using relevant snippets collected from a log of past queries. SnipSuggest’s current capabilities include suggesting tables, views, and table-valued functions in the FROM clause, columns in the SELECT clause, predicates in the WHERE clause, columns in the GROUP BY clause, aggregates, and some support for sub-queries. SnipSuggest adjusts its recommendations according to the context: as the user writes more of the query, it is able to provide more accurate suggestions.","accessed":{"date-parts":[[2018,9,27]]},"author":[{"family":"Khoussainova","given":"Nodira"},{"family":"Kwon","given":"YongChul"},{"family":"Balazinska","given":"Magdalena"},{"family":"Suciu","given":"Dan"}],"container-title":"Proceedings of the VLDB Endowment","DOI":"10.14778/1880172.1880175","ISSN":"21508097","issue":"1","issued":{"date-parts":[[2010,10,1]]},"language":"en","page":"22-33","source":"Crossref","title":"SnipSuggest: context-aware autocompletion for SQL","title-short":"SnipSuggest","type":"article-journal","URL":"http://dl.acm.org/citation.cfm?doid=1880172.1880175","volume":"4"},
  {"id":"kimDatadrivenInteractionTechniques2014","abstract":"With an unprecedented scale of learners watching educational videos on online platforms such as MOOCs and YouTube, there is an opportunity to incorporate data generated from their interactions into the design of novel video interaction techniques. Interaction data has the potential to help not only instructors to improve their videos, but also to enrich the learning experience of educational video watchers. This paper explores the design space of data-driven interaction techniques for educational video navigation. We introduce a set of techniques that augment existing video interface widgets, including: a 2D video timeline with an embedded visualization of collective navigation traces; dynamic and non-linear timeline scrubbing; data-enhanced transcript search and keyword summary; automatic display of relevant still frames next to the video; and a visual summary representing points with high learner activity. To evaluate the feasibility of the techniques, we ran a laboratory user study with simulated learning tasks. Participants rated watching lecture videos with interaction data to be efﬁcient and useful in completing the tasks. However, no signiﬁcant differences were found in task performance, suggesting that interaction data may not always align with moment-by-moment information needs during the tasks.","accessed":{"date-parts":[[2020,6,2]]},"author":[{"family":"Kim","given":"Juho"},{"family":"Guo","given":"Philip J."},{"family":"Cai","given":"Carrie J."},{"family":"Li","given":"Shang-Wen (Daniel)"},{"family":"Gajos","given":"Krzysztof Z."},{"family":"Miller","given":"Robert C."}],"container-title":"Proceedings of the 27th annual ACM symposium on User interface software and technology - UIST '14","DOI":"10.1145/2642918.2647389","event":"the 27th annual ACM symposium","event-place":"Honolulu, Hawaii, USA","ISBN":"978-1-4503-3069-5","issued":{"date-parts":[[2014]]},"language":"en","page":"563-572","publisher":"ACM Press","publisher-place":"Honolulu, Hawaii, USA","source":"DOI.org (Crossref)","title":"Data-driven interaction techniques for improving navigation of educational videos","type":"paper-conference","URL":"http://dl.acm.org/citation.cfm?doid=2642918.2647389"},
  {"id":"kimUnderstandingInvideoDropouts2014","abstract":"With thousands of learners watching the same online lecture videos, analyzing video watching patterns provides a unique opportunity to understand how students learn with videos. This paper reports a large-scale analysis of in-video dropout and peaks in viewership and student activity, using second-by-second user interaction data from 862 videos in four Massive Open Online Courses (MOOCs) on edX. We ﬁnd higher dropout rates in longer videos, re-watching sessions (vs ﬁrst-time), and tutorials (vs lectures). Peaks in rewatching sessions and play events indicate points of interest and confusion. Results show that tutorials (vs lectures) and re-watching sessions (vs ﬁrst-time) lead to more frequent and sharper peaks. In attempting to reason why peaks occur by sampling 80 videos, we observe that 61% of the peaks accompany visual transitions in the video, e.g., a slide view to a classroom view. Based on this observation, we identify ﬁve student activity patterns that can explain peaks: starting from the beginning of a new material, returning to missed content, following a tutorial step, replaying a brief segment, and repeating a non-visual explanation. Our analysis has design implications for video authoring, editing, and interface design, providing a richer understanding of video learning on MOOCs.","accessed":{"date-parts":[[2020,6,2]]},"author":[{"family":"Kim","given":"Juho"},{"family":"Guo","given":"Philip J."},{"family":"Seaton","given":"Daniel T."},{"family":"Mitros","given":"Piotr"},{"family":"Gajos","given":"Krzysztof Z."},{"family":"Miller","given":"Robert C."}],"container-title":"Proceedings of the first ACM conference on Learning @ scale conference - L@S '14","DOI":"10.1145/2556325.2566237","event":"the first ACM conference","event-place":"Atlanta, Georgia, USA","ISBN":"978-1-4503-2669-8","issued":{"date-parts":[[2014]]},"language":"en","page":"31-40","publisher":"ACM Press","publisher-place":"Atlanta, Georgia, USA","source":"DOI.org (Crossref)","title":"Understanding in-video dropouts and interaction peaks inonline lecture videos","type":"paper-conference","URL":"http://dl.acm.org/citation.cfm?doid=2556325.2566237"},
  {"id":"kleppmannConflictFreeReplicatedJSON2017","abstract":"Many applications model their data in a general-purpose storage format such as JSON. This data structure is modified by the application as a result of user input. Such modifications are well understood if performed sequentially on a single copy of the data, but if the data is replicated and modified concurrently on multiple devices, it is unclear what the semantics should be. In this paper we present an algorithm and formal semantics for a JSON data structure that automatically resolves concurrent modifications such that no updates are lost, and such that all replicas converge towards the same state (a conflict-free replicated datatype or CRDT). It supports arbitrarily nested list and map types, which can be modified by insertion, deletion and assignment. The algorithm performs all merging client-side and does not depend on ordering guarantees from the network, making it suitable for deployment on mobile devices with poor network connectivity, in peer-to-peer networks, and in messaging systems with end-to-end encryption.","accessed":{"date-parts":[[2020,7,27]]},"author":[{"family":"Kleppmann","given":"Martin"},{"family":"Beresford","given":"Alastair R."}],"container-title":"IEEE Transactions on Parallel and Distributed Systems","container-title-short":"IEEE Trans. Parallel Distrib. Syst.","DOI":"10.1109/TPDS.2017.2697382","ISSN":"1045-9219","issue":"10","issued":{"date-parts":[[2017,10,1]]},"page":"2733-2746","source":"arXiv.org","title":"A Conflict-Free Replicated JSON Datatype","type":"article-journal","URL":"http://arxiv.org/abs/1608.03960","volume":"28"},
  {"id":"kleppmannDesigningDataintensiveApplications2017","abstract":"Data is at the center of many challenges in system design today. Difficult issues need to be figured out, such as scalability, consistency, reliability, efficiency, and mainteinability. In addition, we have an overwhelming variet of tools, including relational databases, NoSQL datastores, stream or batch processors, and message brokers. What are the right choices for your application? How do you make sense of all these buzzwords? In this practical and comprehensive gjuide, author Martin Kleppmann helps you navigate this diverse landscape by examining the pros and cons of various technologies for processing and storing data. Software keeps changing, but the fundamental principles remain the same. With this book, software engineers and architects will learn how to apply those ideas in practice, and how to make full use of data in modern applications.","accessed":{"date-parts":[[2020,7,27]]},"author":[{"family":"Kleppmann","given":"Martin"}],"ISBN":"978-1-4919-0311-7 978-1-4919-0310-0 978-1-4919-0306-3","issued":{"date-parts":[[2017]]},"language":"English","note":"OCLC: 976434277","source":"Open WorldCat","title":"Designing data-intensive applications: the big ideas behind reliable, scalable, and maintainable systems","title-short":"Designing data-intensive applications","type":"book","URL":"http://www.dawsonera.com/depp/reader/protected/external/AbstractView/S9781491903117"},
  {"id":"klokmoseWebstratesShareableDynamic2015","abstract":"We revisit Alan Kay’s early vision of dynamic media that blurs the distinction between documents and applications. We introduce shareable dynamic media that are malleable by users, who may appropriate them in idiosyncratic ways; shareable among users, who collaborate on multiple aspects of the media; and distributable across diverse devices and platforms. We present Webstrates, an environment for exploring shareable dynamic media. Webstrates augment web technology with real-time sharing. They turn web pages into substrates, i.e. software entities that act as applications or documents depending upon use. We illustrate Webstrates with two implemented case studies: users collaboratively author an article with functionally and visually different editors that they can personalize and extend at run-time; and they orchestrate its presentation and audience participation with multiple devices. We demonstrate the simplicity and generative power of Webstrates with three additional prototypes and evaluate it from a systems perspective.","accessed":{"date-parts":[[2018,9,26]]},"author":[{"family":"Klokmose","given":"Clemens N."},{"family":"Eagan","given":"James R."},{"family":"Baader","given":"Siemen"},{"family":"Mackay","given":"Wendy"},{"family":"Beaudouin-Lafon","given":"Michel"}],"container-title":"Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology - UIST '15","DOI":"10.1145/2807442.2807446","event":"the 28th Annual ACM Symposium","event-place":"Daegu, Kyungpook, Republic of Korea","ISBN":"978-1-4503-3779-3","issued":{"date-parts":[[2015]]},"language":"en","page":"280-290","publisher":"ACM Press","publisher-place":"Daegu, Kyungpook, Republic of Korea","source":"Crossref","title":"<i>Webstrates</i>: Shareable Dynamic Media","title-short":"<i>Webstrates</i>","type":"paper-conference","URL":"http://dl.acm.org/citation.cfm?doid=2807442.2807446"},
  {"id":"knabeAppleGuideCase1995","accessed":{"date-parts":[[2020,6,15]]},"author":[{"family":"Knabe","given":"Kevin"}],"collection-title":"CHI '95","container-title":"Conference Companion on Human Factors in Computing Systems","DOI":"10.1145/223355.223677","event-place":"Denver, Colorado, USA","ISBN":"978-0-89791-755-1","issued":{"date-parts":[[1995,5,7]]},"page":"286–287","publisher":"Association for Computing Machinery","publisher-place":"Denver, Colorado, USA","source":"ACM Digital Library","title":"Apple guide: a case study in user-aided design of online help","title-short":"Apple guide","type":"paper-conference","URL":"https://doi.org/10.1145/223355.223677"},
  {"id":"kongDeltaToolRepresenting2012","abstract":"Tutorials and sample workflows for complicated, featurerich software packages are widely available online. As a result users must differentiate between workflows to choose the most suitable one for their task. We present Delta, an interactive workflow visualization and comparison tool that helps users identify the tradeoffs between workflows. We conducted an initial study to identify the set of attributes users attend to when comparing workflows, finding that they consider result quality, their knowledge of commands, and the efficiency of the workflow. We then designed Delta to surface these attributes at three granularities: a highlevel, clustered view; an intermediate-level list view that contains workflow summaries; and a low-level detail view that allows users to compare two individual workflows. Finally, we conducted an evaluation of Delta on a small corpus of 30 workflows and found that the intermediate list view provided the best information density. We conclude with thoughts on how such a workflow comparison system could be scaled up to larger corpora in the future.","accessed":{"date-parts":[[2020,6,1]]},"author":[{"family":"Kong","given":"Nicholas"},{"family":"Grossman","given":"Tovi"},{"family":"Hartmann","given":"Björn"},{"family":"Agrawala","given":"Maneesh"},{"family":"Fitzmaurice","given":"George"}],"container-title":"Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems - CHI '12","DOI":"10.1145/2207676.2208549","event":"the 2012 ACM annual conference","event-place":"Austin, Texas, USA","ISBN":"978-1-4503-1015-4","issued":{"date-parts":[[2012]]},"language":"en","page":"1027","publisher":"ACM Press","publisher-place":"Austin, Texas, USA","source":"DOI.org (Crossref)","title":"Delta: a tool for representing and comparing workflows","title-short":"Delta","type":"paper-conference","URL":"http://dl.acm.org/citation.cfm?doid=2207676.2208549"},
  {"id":"krugDonMakeMe2014","author":[{"family":"Krug","given":"Steve"}],"event-place":"San Francisco, Calif","ISBN":"978-0-321-96551-6","issued":{"date-parts":[[2014]]},"language":"eng","note":"OCLC: 876406593","number-of-pages":"200","publisher":"New Riders","publisher-place":"San Francisco, Calif","source":"Gemeinsamer Bibliotheksverbund ISBN","title":"Don't make me think, revisited: a common sense approach to web [and mobile] usability","title-short":"Don't make me think, revisited","type":"book"},
  {"id":"kurlanderEditableGraphicalHistories1991","accessed":{"date-parts":[[2020,8,27]]},"author":[{"family":"Kurlander","given":"David"},{"family":"Feiner","given":"Steven"}],"collection-title":"CHI '91","container-title":"Proceedings of the SIGCHI Conference on Human Factors in Computing Systems","DOI":"10.1145/108844.108998","event-place":"New York, NY, USA","ISBN":"978-0-89791-383-6","issued":{"date-parts":[[1991,3,1]]},"page":"451–452","publisher":"Association for Computing Machinery","publisher-place":"New York, NY, USA","source":"ACM Digital Library","title":"Editable graphical histories: the video","title-short":"Editable graphical histories","type":"paper-conference","URL":"https://doi.org/10.1145/108844.108998"},
  {"id":"kurlanderHistorybasedMacroExample1992","abstract":"Many tasks performed using computer interfaces are very repetitive. While programmers can write macros or procedures to automate these repetitive tasks, this requires special skills. Demonstrational systems make macro building accessible to all users, but most provide either no visual representation of the macro or only a textual representation. We have developed a history-based visual representation of commands in a graphical user interface. This representation supports the definition of macros by example in several novel ways. At any time, a user can open a history window, review the commands executed in a session, select operations to encapsulate into a macro, and choose objects and their attributes as arguments. The system has facilities to generalize the macro automatically, save it for future use, and edit it.","accessed":{"date-parts":[[2020,6,3]]},"author":[{"family":"Kurlander","given":"David"},{"family":"Feiner","given":"Steven"}],"container-title":"Proceedings of the 5th annual ACM symposium on User interface software and technology  - UIST '92","DOI":"10.1145/142621.142633","event":"the 5th annual ACM symposium","event-place":"Monteray, California, United States","ISBN":"978-0-89791-549-6","issued":{"date-parts":[[1992]]},"language":"en","page":"99-106","publisher":"ACM Press","publisher-place":"Monteray, California, United States","source":"DOI.org (Crossref)","title":"A history-based macro by example system","type":"paper-conference","URL":"http://portal.acm.org/citation.cfm?doid=142621.142633"},
  {"id":"kurlanderVisualLanguageBrowsing1989","abstract":"We present the concept of an editable graphical history that allows the user to review and modify the actions performed with a graphical user interface. Using a pictorial metaphor borrowed from comic strips, an editable graphical history consists of a series of panels that depict in chronological order the important events in the history of a user's session. We discuss the visual language used in editable graphical histories, and describe Chimera, a graphical editor that generates these histories automatically. The user may scroll through the sequence of panels, reviewing actions at different levels of detail, and selectively undoing, modifying, and redoing previous actions. Chimera's editable graphical histories are constructed from parts of the editor window, the editor control panel, and the editor's pop up menus. Panels indicate both the objects that are modified and the actions performed on them. We describe the heuristics used to determine the objects depicted in each panel, the style in which they are drawn, and how actions are distributed among panels.","accessed":{"date-parts":[[2020,6,3]]},"author":[{"family":"Kurlander","given":"David"},{"family":"Feiner","given":"Steven K."}],"DOI":"10.7916/D8W95NFS","issued":{"date-parts":[[1989]]},"language":"en","source":"academiccommons.columbia.edu","title":"A Visual Language for Browsing, Undoing, and Redoing Graphical Interface Commands","type":"article-journal","URL":"https://doi.org/10.7916/D8W95NFS"},
  {"id":"kushnirukTechnologyInducedError2005","abstract":"This paper describes an innovative approach to the evaluation of a handheld prescription writing application. Participants (10 physicians) were asked to perform a series of tasks involving entering prescriptions into the application from a medication list. The study procedure involved the collection of data consisting of transcripts of the subjects who were asked to “think aloud” while interacting with the prescription writing program to enter medications. All user interactions with the device were video and audio recorded. Analysis of the protocols was conducted in two phases: (1) usability problems were identified from coding of the transcripts and video data, (2) actual errors in entering prescription data were also identified. The results indicated that there were a variety of usability problems, with most related to interface design issues. In examining the relationship between usability problems and errors, it was found that certain types of usability problems were closely associated with the occurrence of specific types of errors in prescription of medications. Implications for identifying and predicting technology-induced error are discussed in the context of improving the safety of health care information systems.","accessed":{"date-parts":[[2020,8,5]]},"author":[{"family":"Kushniruk","given":"Andre W."},{"family":"Triola","given":"Marc M."},{"family":"Borycki","given":"Elizabeth M."},{"family":"Stein","given":"Ben"},{"family":"Kannry","given":"Joseph L."}],"collection-title":"MedInfo 2004","container-title":"International Journal of Medical Informatics","container-title-short":"International Journal of Medical Informatics","DOI":"10.1016/j.ijmedinf.2005.01.003","ISSN":"1386-5056","issue":"7","issued":{"date-parts":[[2005,8,1]]},"language":"en","page":"519-526","source":"ScienceDirect","title":"Technology induced error and usability: The relationship between usability problems and prescription errors when using a handheld application","title-short":"Technology induced error and usability","type":"article-journal","URL":"http://www.sciencedirect.com/science/article/pii/S1386505605000110","volume":"74"},
  {"id":"kwekOnlyOne102011","abstract":"About 90 per cent of computer users don't use CTRL-F to search for a word - as they don't know such a keyboard shortcut exists, a Google survey found.","accessed":{"date-parts":[[2020,8,7]]},"author":[{"family":"Kwek","given":"Glenda"}],"container-title":"The Sydney Morning Herald","issued":{"date-parts":[[2011,11,30]]},"language":"en","section":"Technology","source":"www.smh.com.au","title":"Only one in 10 know what Ctrl-F does - here are shortcuts you should know","type":"webpage","URL":"https://www.smh.com.au/technology/only-one-in-10-know-what-ctrlf-does--here-are-shortcuts-you-should-know-20111130-1o69d.html"},
  {"id":"lafreniereAdaptableGIMPDesigningSociallyadaptable2011","abstract":"We introduce the concept of a socially-adaptable interface, an interface that provides instant access to task-specific interface customizations created, edited, and documented by the application’s user community. We demonstrate this concept in AdaptableGIMP, a modified version of the GIMP image editor that we have developed.","accessed":{"date-parts":[[2020,8,28]]},"author":[{"family":"Lafreniere","given":"Benjamin"},{"family":"Bunt","given":"Andrea"},{"family":"Lount","given":"Matthew"},{"family":"Krynicki","given":"Filip"},{"family":"Terry","given":"Michael A."}],"container-title":"Proceedings of the 24th annual ACM symposium adjunct on User interface software and technology - UIST '11 Adjunct","DOI":"10.1145/2046396.2046437","event":"the 24th annual ACM symposium adjunct","event-place":"Santa Barbara, California, USA","ISBN":"978-1-4503-1014-7","issued":{"date-parts":[[2011]]},"language":"en","page":"89","publisher":"ACM Press","publisher-place":"Santa Barbara, California, USA","source":"DOI.org (Crossref)","title":"AdaptableGIMP: designing a socially-adaptable interface","title-short":"AdaptableGIMP","type":"paper-conference","URL":"http://dl.acm.org/citation.cfm?doid=2046396.2046437"},
  {"id":"lafreniereCommunityEnhancedTutorials2013","abstract":"Web-based tutorials are a popular help resource for learning how to perform unfamiliar tasks in complex software. However, in their current form, web tutorials are isolated from the applications that they support. In this paper we present FollowUs, a web-tutorial system that integrates a fully-featured application into a web-based tutorial. This novel architecture enables community enhanced tutorials, which continuously improve as more users work with them. FollowUs captures video demonstrations of users as they perform a tutorial. Subsequent users can use the original tutorial, or choose from a library of captured community demonstrations of each tutorial step. We conducted a user study to test the benefits of making multiple demonstrations available to users, and found that users perform significantly better using our system with a library of multiple demonstrations in comparison to its equivalent baseline system with only the original authored content.","accessed":{"date-parts":[[2020,6,2]]},"author":[{"family":"Lafreniere","given":"Benjamin"},{"family":"Grossman","given":"Tovi"},{"family":"Fitzmaurice","given":"George"}],"container-title":"Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '13","DOI":"10.1145/2470654.2466235","event":"the SIGCHI Conference","event-place":"Paris, France","ISBN":"978-1-4503-1899-0","issued":{"date-parts":[[2013]]},"language":"en","page":"1779","publisher":"ACM Press","publisher-place":"Paris, France","source":"DOI.org (Crossref)","title":"Community enhanced tutorials: improving tutorials with multiple demonstrations","title-short":"Community enhanced tutorials","type":"paper-conference","URL":"http://dl.acm.org/citation.cfm?doid=2470654.2466235"},
  {"id":"lafreniereInvestigatingFeasibilityExtracting2014","abstract":"Short video demonstrations are effective resources for helping users to learn tools in feature-rich software. However manually creating demonstrations for the hundreds (or thousands) of individual features in these programs would be impractical. In this paper, we investigate the potential for identifying good tool demonstrations from within screen recordings of users performing real-world tasks. Using an instrumented image-editing application, we collected workflow video content and log data from actual end users. We then developed a heuristic for identifying demonstration clips, and had the quality of a sample set of clips evaluated by both domain experts and end users. This multi-step approach allowed us to characterize the quality of 'naturally occurring' tool demonstrations, and to derive a list of good and bad features of these videos. Finally, we conducted an initial investigation into using machine learning techniques to distinguish between good and bad demonstrations.","accessed":{"date-parts":[[2020,8,27]]},"author":[{"family":"Lafreniere","given":"Ben"},{"family":"Grossman","given":"Tovi"},{"family":"Matejka","given":"Justin"},{"family":"Fitzmaurice","given":"George"}],"collection-title":"CHI '14","container-title":"Proceedings of the SIGCHI Conference on Human Factors in Computing Systems","DOI":"10.1145/2556288.2557142","event-place":"New York, NY, USA","ISBN":"978-1-4503-2473-1","issued":{"date-parts":[[2014,4,26]]},"page":"4007–4016","publisher":"Association for Computing Machinery","publisher-place":"New York, NY, USA","source":"ACM Digital Library","title":"Investigating the feasibility of extracting tool demonstrations from in-situ video content","type":"paper-conference","URL":"https://doi.org/10.1145/2556288.2557142"},
  {"id":"lakkarajuHowFoolYou2020","abstract":"As machine learning black boxes are increasingly being deployed in critical domains such as healthcare and criminal justice, there has been a growing emphasis on developing techniques for explaining these black boxes in a human interpretable manner. There has been recent concern that a high-fidelity explanation of a black box ML model may not accurately reflect the biases in the black box. As a consequence, explanations have the potential to mislead human users into trusting a problematic black box. In this work, we rigorously explore the notion of misleading explanations and how they influence user trust in black box models. Specifically, we propose a novel theoretical framework for understanding and generating misleading explanations, and carry out a user study with domain experts to demonstrate how these explanations can be used to mislead users. Our work is the first to empirically establish how user trust in black box models can be manipulated via misleading explanations.","accessed":{"date-parts":[[2020,9,28]]},"author":[{"family":"Lakkaraju","given":"Himabindu"},{"family":"Bastani","given":"Osbert"}],"container-title":"Proceedings of the AAAI/ACM Conference on AI, Ethics, and Society","DOI":"10.1145/3375627.3375833","event":"AIES '20: AAAI/ACM Conference on AI, Ethics, and Society","event-place":"New York NY USA","ISBN":"978-1-4503-7110-0","issued":{"date-parts":[[2020,2,7]]},"language":"en","page":"79-85","publisher":"ACM","publisher-place":"New York NY USA","source":"DOI.org (Crossref)","title":"\"How do I fool you?\": Manipulating User Trust via Misleading Black Box Explanations","title-short":"\"How do I fool you?","type":"paper-conference","URL":"https://dl.acm.org/doi/10.1145/3375627.3375833"},
  {"id":"laputTutorialbasedInterfacesCloudenabled2012","abstract":"Powerful image editing software like Adobe Photoshop and GIMP have complex interfaces that can be hard to master. To help users perform image editing tasks, we introduce tutorial-based applications (tapps) that retain the step-by-step structure and descriptive text of tutorials but can also automatically apply tutorial steps to new images. Thus, tapps can be used to batch process many images automatically, similar to traditional macros. Tapps also support interactive exploration of parameters, automatic variations, and direct manipulation (e.g., selection, brushing). Another key feature of tapps is that they execute on remote instances of Photoshop, which allows users to edit their images on any Web-enabled device. We demonstrate a working prototype system called TappCloud for creating, managing and using tapps. Initial user feedback indicates support for both the interactive features of tapps and their ability to automate image editing. We conclude with a discussion of approaches and challenges of pushing monolithic direct-manipulation GUIs to the cloud.","accessed":{"date-parts":[[2020,8,28]]},"author":[{"family":"Laput","given":"Gierad"},{"family":"Adar","given":"Eytan"},{"family":"Dontcheva","given":"Mira"},{"family":"Li","given":"Wilmot"}],"collection-title":"UIST '12","container-title":"Proceedings of the 25th annual ACM symposium on User interface software and technology","DOI":"10.1145/2380116.2380132","event-place":"New York, NY, USA","ISBN":"978-1-4503-1580-7","issued":{"date-parts":[[2012,10,7]]},"page":"113–122","publisher":"Association for Computing Machinery","publisher-place":"New York, NY, USA","source":"ACM Digital Library","title":"Tutorial-based interfaces for cloud-enabled applications","type":"paper-conference","URL":"https://doi.org/10.1145/2380116.2380132"},
  {"id":"lazarWorkplaceUserFrustration2006","abstract":"When hard-to-use computers cause users to become frustrated, it can affect workplace productivity, user mood and interactions with other co-workers. Previous research has examined the frustration that students and their families face in using computers. To learn more about the causes and measure the severity of user frustration with computers in the workplace, we collected modified time diaries from 50 workplace users, who spent an average of 5.1 hours on the computer. In this exploratory research, users reported wasting on average, 42 – 43% of their time on the computer due to frustrating experiences. The largest number of frustrating experiences occurred while using word processors, email and web browsers. The causes of the frustrating experiences, the time lost due to the frustrating experiences, and the effects of the frustrating experiences on the mood of the users are discussed in this paper. Implications for designers, managers, users, information technology staff and policymakers are discussed.","accessed":{"date-parts":[[2020,6,15]]},"author":[{"family":"Lazar","given":"Jonathan"},{"family":"Jones","given":"Adam"},{"family":"Shneiderman","given":"Ben"}],"container-title":"Behaviour & Information Technology","DOI":"10.1080/01449290500196963","ISSN":"0144-929X","issue":"3","issued":{"date-parts":[[2006,5,1]]},"note":"_eprint: https://doi.org/10.1080/01449290500196963","page":"239-251","publisher":"Taylor & Francis","source":"Taylor and Francis+NEJM","title":"Workplace user frustration with computers: an exploratory investigation of the causes and severity","title-short":"Workplace user frustration with computers","type":"article-journal","URL":"https://doi.org/10.1080/01449290500196963","volume":"25"},
  {"id":"leeTrustAutomationDesigning2004","abstract":"Automation is often problematic because people fail to rely upon it appropriately. Because people respond to technology socially, trust influences reliance on automation. In particular, trust guides reliance when complexity and unanticipated situations make a complete understanding of the automation impractical. This review considers trust from the organizational, sociological, interpersonal, psychological, and neurological perspectives. It considers how the context, automation characteristics, and cognitive processes affect the appropriateness of trust. The context in which the automation is used influences automation performance and provides a goal-oriented perspective to assess automation characteristics along a dimension of attributional abstraction. These characteristics can influence trust through analytic, analogical, and affective processes. The challenges of extrapolating the concept of trust in people to trust in automation are discussed. A conceptual model integrates research regarding trust in automation and describes the dynamics of trust, the role of context, and the influence of display characteristics. Actual or potential applications of this research include improved designs of systems that require people to manage imperfect automation.","author":[{"family":"Lee","given":"John D."},{"family":"See","given":"Katrina A."}],"container-title":"Human Factors","container-title-short":"Hum Factors","DOI":"10.1518/hfes.46.1.50_30392","ISSN":"0018-7208","issue":"1","issued":{"date-parts":[[2004]]},"language":"eng","page":"50-80","PMID":"15151155","source":"PubMed","title":"Trust in automation: designing for appropriate reliance","title-short":"Trust in automation","type":"article-journal","volume":"46"},
  {"id":"leshedCoScripterAutomatingSharing2008","abstract":"Modern enterprises are replete with numerous online processes. Many must be performed frequently and are tedious, while others are done less frequently yet are complex or hard to remember. We present interviews with knowledge workers that reveal a need for mechanisms to automate the execution of and to share knowledge about these processes. In response, we have developed the CoScripter system (formerly Koala [11]), a collaborative scripting environment for recording, automating, and sharing web-based processes. We have deployed CoScripter within a large corporation for more than 10 months. Through usage log analysis and interviews with users, we show that CoScripter has addressed many user automation and sharing needs, to the extent that more than 50 employees have voluntarily incorporated it into their work practice. We also present ways people have used CoScripter and general issues for tools that support automation and sharing of how-to knowledge.","accessed":{"date-parts":[[2020,8,28]]},"author":[{"family":"Leshed","given":"Gilly"},{"family":"Haber","given":"Eben M."},{"family":"Matthews","given":"Tara"},{"family":"Lau","given":"Tessa"}],"collection-title":"CHI '08","container-title":"Proceedings of the SIGCHI Conference on Human Factors in Computing Systems","DOI":"10.1145/1357054.1357323","event-place":"New York, NY, USA","ISBN":"978-1-60558-011-1","issued":{"date-parts":[[2008,4,6]]},"page":"1719–1728","publisher":"Association for Computing Machinery","publisher-place":"New York, NY, USA","source":"ACM Digital Library","title":"CoScripter: automating &amp; sharing how-to knowledge in the enterprise","title-short":"CoScripter","type":"paper-conference","URL":"https://doi.org/10.1145/1357054.1357323"},
  {"id":"LetLearnWaveforms","abstract":"An interactive guide that introduces and explores waveforms.","accessed":{"date-parts":[[2020,8,10]]},"container-title":"The Pudding","language":"en","title":"Let's Learn About Waveforms","type":"webpage","URL":"https://pudding.cool/2018/02/waveforms"},
  {"id":"liebermanMondrianTeachableGraphical1993","accessed":{"date-parts":[[2020,6,3]]},"author":[{"family":"Lieberman","given":"Henry"}],"container-title":"Proceedings of the SIGCHI conference on Human factors in computing systems  - CHI '93","DOI":"10.1145/169059.169120","event":"the SIGCHI conference","event-place":"Amsterdam, The Netherlands","ISBN":"978-0-89791-575-5","issued":{"date-parts":[[1993]]},"language":"en","page":"144","publisher":"ACM Press","publisher-place":"Amsterdam, The Netherlands","source":"DOI.org (Crossref)","title":"Mondrian: a teachable graphical editor","title-short":"Mondrian","type":"paper-conference","URL":"http://portal.acm.org/citation.cfm?doid=169059.169120"},
  {"id":"linReimaginingClinicalDocumentation2018","accessed":{"date-parts":[[2020,8,5]]},"author":[{"family":"Lin","given":"Steven Y."},{"family":"Shanafelt","given":"Tait D."},{"family":"Asch","given":"Steven M."}],"container-title":"Mayo Clinic Proceedings","container-title-short":"Mayo Clinic Proceedings","DOI":"10.1016/j.mayocp.2018.02.016","ISSN":"00256196","issue":"5","issued":{"date-parts":[[2018,5]]},"language":"en","page":"563-565","source":"DOI.org (Crossref)","title":"Reimagining Clinical Documentation With Artificial Intelligence","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S0025619618301423","volume":"93"},
  {"id":"LinusTorvaldsGit","accessed":{"date-parts":[[2020,7,26]]},"title":"Linus Torvalds: Git proved I could be more than a one-hit wonder | Hacker News","type":"webpage","URL":"https://news.ycombinator.com/item?id=21418033"},
  {"id":"LocalfirstSoftwareYou","abstract":"A new generation of collaborative software that allows users to retain ownership of their data.","accessed":{"date-parts":[[2020,7,26]]},"language":"en-US","source":"www.inkandswitch.com","title":"Local-first software: You own your data, in spite of the cloud","title-short":"Local-first software","type":"webpage","URL":"https://www.inkandswitch.com/local-first.html"},
  {"id":"lowryTechnicalEvaluationTesting2015","accessed":{"date-parts":[[2020,8,13]]},"author":[{"family":"Lowry","given":"Svetlana Z."},{"family":"Ramaiah","given":"Mala"},{"family":"Taylor","given":"Sheryl"},{"family":"Patterson","given":"Emily S."},{"family":"Spickard Prettyman","given":"Sandra"},{"family":"Simmons","given":"Debora"},{"family":"Brick","given":"David"},{"family":"Latkany","given":"Paul"},{"family":"Gibbons","given":"Michael C."}],"DOI":"10.6028/NIST.IR.7804-1","issued":{"date-parts":[[2015,10]]},"language":"en","number":"NIST IR 7804-1","page":"NIST IR 7804-1","publisher":"National Institute of Standards and Technology","source":"DOI.org (Crossref)","title":"Technical Evaluation, Testing, and Validation of the Usability of Electronic Health Records: Empirically Based Use Cases for Validating Safety-Enhanced Usability and Guidelines for Standardization","title-short":"Technical Evaluation, Testing, and Validation of the Usability of Electronic Health Records","type":"report","URL":"https://nvlpubs.nist.gov/nistpubs/ir/2015/NIST.IR.7804-1.pdf"},
  {"id":"mackayHowEscapeProcrastination2018","abstract":"Why do we feel so helpless once we start procrastinating? And is there a way we can break free from the procrastination doom loop even if it has a grip on us?","accessed":{"date-parts":[[2020,7,26]]},"author":[{"family":"MacKay","given":"Jory"}],"container-title":"RescueTime Blog","issued":{"date-parts":[[2018,4,12]]},"language":"en-US","section":"Time Management","source":"blog.rescuetime.com","title":"How to Escape the Procrastination Doom Loop","type":"webpage","URL":"https://blog.rescuetime.com/procrastination-doom-loop/"},
  {"id":"mandriginOptimisticUI2016","abstract":"Optimistic UIs don’t wait for an operation to finish to update to the final state. They immediately switch to the final state, showing fake data for the time while the real operation is still…","accessed":{"date-parts":[[2020,7,27]]},"author":[{"family":"Mandrigin","given":"Igor"}],"container-title":"Medium","issued":{"date-parts":[[2016,12,5]]},"language":"en","source":"uxplanet.org","title":"Optimistic UI","type":"webpage","URL":"https://uxplanet.org/optimistic-1000-34d9eefe4c05"},
  {"id":"MarcAndreessenProductivity2012","abstract":"Marc Andreessen has a surprising trick to feeling productive. He keeps a daily anti-todo list, which is a list of everything he's accomplished.","accessed":{"date-parts":[[2020,7,21]]},"container-title":"I Done This Blog","issued":{"date-parts":[[2012,10,23]]},"language":"en-US","section":"Done List","source":"blog.idonethis.com","title":"Marc Andreessen's Productivity Trick to Feeling Marvelously Efficient","type":"webpage","URL":"http://blog.idonethis.com/marc-andreessen-productivity-trick/"},
  {"id":"martonNecessaryConditionsLearning2015","author":[{"family":"Marton","given":"Ference"}],"event-place":"New York, N.Y.; London","ISBN":"978-0-415-73914-6","issued":{"date-parts":[[2015]]},"language":"English","note":"OCLC: 935669326","publisher":"Routledge","publisher-place":"New York, N.Y.; London","source":"Open WorldCat","title":"Necessary conditions of learning","type":"book"},
  {"id":"matuschakHowCanWe2019","abstract":"🛠🧠🖌💥🌎✨🔜","accessed":{"date-parts":[[2020,6,1]]},"author":[{"family":"Matuschak","given":"Andy"},{"family":"Nielsen","given":"Michael"},{"family":"Matuschak","given":"Andy"},{"family":"Nielsen","given":"Michael"}],"issued":{"date-parts":[[2019]]},"source":"numinous.productions","title":"How can we develop transformative tools for thought?","type":"article-journal","URL":"https://numinous.productions/ttft"},
  {"id":"matuschakQuantumCountry2019","abstract":"A free introduction to quantum computing and quantum mechanics","accessed":{"date-parts":[[2020,6,1]]},"author":[{"family":"Matuschak","given":"Andy"},{"family":"Nielsen","given":"Michael"}],"issued":{"date-parts":[[2019]]},"source":"quantum.country","title":"Quantum Country","type":"article-journal","URL":"https://quantum.country"},
  {"id":"matuschakTimefulTexts2020","abstract":"How might one escape a book’s shackled sense of time, extending the authored experience over weeks and months?","accessed":{"date-parts":[[2020,8,4]]},"author":[{"family":"Matuschak","given":"Andy"},{"family":"Nielsen","given":"Michael"}],"issued":{"date-parts":[[2020]]},"language":"en","source":"numinous.productions","title":"Timeful Texts","type":"article-journal","URL":"https://numinous.productions/timeful"},
  {"id":"milesMoreThisQuery","author":[{"family":"Miles","given":"Christopher"}],"language":"en","page":"9","source":"Zotero","title":"More Like This: Query Recommendations for SQL","type":"article-journal"},
  {"id":"morenoInteractiveMultimodalLearning2007","abstract":"What are interactive multimodal learning environments and how should they be designed to promote students’ learning? In this paper, we offer a cognitive–affective theory of learning with media from which instructional design principles are derived. Then, we review a set of experimental studies in which we found empirical support for five design principles: guided activity, reflection, feedback, control, and pretraining. Finally, we offer directions for future instructional technology research.","accessed":{"date-parts":[[2020,6,1]]},"author":[{"family":"Moreno","given":"Roxana"},{"family":"Mayer","given":"Richard"}],"container-title":"Educational Psychology Review","container-title-short":"Educ Psychol Rev","DOI":"10.1007/s10648-007-9047-2","ISSN":"1040-726X, 1573-336X","issue":"3","issued":{"date-parts":[[2007,9,10]]},"language":"en","page":"309-326","source":"DOI.org (Crossref)","title":"Interactive Multimodal Learning Environments: Special Issue on Interactive Learning Environments: Contemporary Issues and Trends","title-short":"Interactive Multimodal Learning Environments","type":"article-journal","URL":"http://link.springer.com/10.1007/s10648-007-9047-2","volume":"19"},
  {"id":"MorningPagesJulia","accessed":{"date-parts":[[2020,7,21]]},"title":"Morning Pages | Julia Cameron Live","type":"webpage","URL":"https://juliacameronlive.com/basic-tools/morning-pages/"},
  {"id":"MyProductivityApp","accessed":{"date-parts":[[2020,8,11]]},"title":"My productivity app is a single .txt file","type":"webpage","URL":"https://jeffhuang.com/productivity_text_file//"},
  {"id":"mysorePortaProfilingSoftware2018","abstract":"It can be hard for tutorial creators to get fine-grained feedback about how learners are actually stepping through their tutorials and which parts lead to the most struggle. To provide such feedback for technical software tutorials, we introduce the idea of tutorial profiling, which is inspired by software code profiling. We prototyped this idea in a system called Porta that automatically tracks how users navigate through a tutorial webpage and what actions they take on their computer such as running shell commands, invoking compilers, and logging into remote servers. Porta surfaces this trace data in the form of profiling visualizations that augment the tutorial with heatmaps of activity hotspots and markers that expand to show event details, error messages, and embedded screencast videos of user actions. We found through a user study of 3 tutorial creators and 12 students who followed their tutorials that Porta enabled both the tutorial creators and the students to provide more specific, targeted, and actionable feedback about how to improve these tutorials. Porta opens up possibilities for performing user testing of technical documentation in a more systematic and scalable way.","accessed":{"date-parts":[[2020,6,1]]},"author":[{"family":"Mysore","given":"Alok"},{"family":"Guo","given":"Philip J."}],"collection-title":"UIST '18","container-title":"Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology","DOI":"10.1145/3242587.3242633","event-place":"Berlin, Germany","ISBN":"978-1-4503-5948-1","issued":{"date-parts":[[2018,10,11]]},"page":"201–212","publisher":"Association for Computing Machinery","publisher-place":"Berlin, Germany","source":"ACM Digital Library","title":"Porta: Profiling Software Tutorials Using Operating-System-Wide Activity Tracing","title-short":"Porta","type":"paper-conference","URL":"https://doi.org/10.1145/3242587.3242633"},
  {"id":"mysoreTortaGeneratingMixedMedia2017","abstract":"Tutorials are vital for helping people perform complex software-based tasks in domains such as programming, data science, system administration, and computational research. However, it is tedious to create detailed step-by-step tutorials for tasks that span multiple interrelated GUI and commandline applications. To address this challenge, we created Torta, an end-to-end system that automatically generates step-bystep GUI and command-line app tutorials by demonstration, provides an editor to trim, organize, and add validation criteria to these tutorials, and provides a web-based viewer that can validate step-level progress and automatically run certain steps. The core technical insight that underpins Torta is that combining operating-system-wide activity tracing and screencast recording makes it easier to generate mixed-media (text+video) tutorials that span multiple GUI and commandline apps. An exploratory study on 10 computer science teaching assistants (TAs) found that they all preferred the experience and results of using Torta to record programming and sysadmin tutorials relevant to classes they teach rather than manually writing tutorials. A follow-up study on 6 students found that they all preferred following the Torta tutorials created by those TAs over the manually-written versions.","accessed":{"date-parts":[[2020,6,2]]},"author":[{"family":"Mysore","given":"Alok"},{"family":"Guo","given":"Philip J."}],"container-title":"Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology","DOI":"10.1145/3126594.3126628","event":"UIST '17: The 30th Annual ACM Symposium on User Interface Software and Technology","event-place":"Québec City QC Canada","ISBN":"978-1-4503-4981-9","issued":{"date-parts":[[2017,10,20]]},"language":"en","page":"703-714","publisher":"ACM","publisher-place":"Québec City QC Canada","source":"DOI.org (Crossref)","title":"Torta: Generating Mixed-Media GUI and Command-Line App Tutorials Using Operating-System-Wide Activity Tracing","title-short":"Torta","type":"paper-conference","URL":"https://dl.acm.org/doi/10.1145/3126594.3126628"},
  {"id":"nakamuraApplicationindependentSystemVisualizing2008","abstract":"A history-of-user-operations function helps make applications easier to use. For example, users may have access to an operation history list in an application to undo or redo a past operation. To provide an overview of a long operation history and help users find target interactions or application states quickly, visual representations of operation history have been proposed. However, most previous systems are tightly integrated with target applications and difficult to apply to new applications. We propose an applicationindependent method that can visualize the operation history of arbitrary GUI applications by monitoring the input and output GUI events from outside of the target application. We implemented a prototype system that visualizes operation sequences of generic Java Awt/Swing applications using an annotated comic strip metaphor. We tested the system with various applications and present results from a user study.","accessed":{"date-parts":[[2020,6,3]]},"author":[{"family":"Nakamura","given":"Toshio"},{"family":"Igarashi","given":"Takeo"}],"container-title":"Proceedings of the 21st annual ACM symposium on User interface software and technology - UIST '08","DOI":"10.1145/1449715.1449721","event":"the 21st annual ACM symposium","event-place":"Monterey, CA, USA","ISBN":"978-1-59593-975-3","issued":{"date-parts":[[2008]]},"language":"en","page":"23","publisher":"ACM Press","publisher-place":"Monterey, CA, USA","source":"DOI.org (Crossref)","title":"An application-independent system for visualizing user operation history","type":"paper-conference","URL":"http://portal.acm.org/citation.cfm?doid=1449715.1449721"},
  {"id":"nandiAssistedQueryingUsing2007","abstract":"We demonstrate a novel query interface that enables users to construct a rich search query without any prior knowledge of the underlying schema or data. The interface, which is in the form of a single text input box, interacts in real-time with the users as they type, guiding them through the query construction. We discuss the issues of schema and data complexity, result size estimation, and query validity; and provide novel approaches to solving these problems. We demonstrate our query interface on two popular applications; an enterprise-wide personnel search, and a biological information database.","accessed":{"date-parts":[[2018,9,27]]},"author":[{"family":"Nandi","given":"Arnab"},{"family":"Jagadish","given":"H. V."}],"container-title":"Proceedings of the 2007 ACM SIGMOD international conference on Management of data  - SIGMOD '07","DOI":"10.1145/1247480.1247640","event":"the 2007 ACM SIGMOD international conference","event-place":"Beijing, China","ISBN":"978-1-59593-686-8","issued":{"date-parts":[[2007]]},"language":"en","page":"1156","publisher":"ACM Press","publisher-place":"Beijing, China","source":"Crossref","title":"Assisted querying using instant-response interfaces","type":"paper-conference","URL":"http://portal.acm.org/citation.cfm?doid=1247480.1247640"},
  {"id":"nandiGuidedInteractionRethinking","abstract":"Many decades of research, coupled with continuous increases in computing power, have enabled highly efficient execution of queries on large databases. In consequence, for many databases, far more time is spent by users formulating queries than by the system evaluating them. It stands to reason that, looking at the overall query experience we provide users, we should pay attention to how we can assist users in the holistic process of obtaining the information they desire from the database, and not just the constituent activity of efficiently generating a result given a complete precise query. In this paper, we examine the conventional query-result paradigm employed by databases and demonstrate challenges encountered when following this paradigm for an information seeking task. We recognize that the process of query specification itself is a major stumbling block. With current computational abilities, we are at a point where we can make use of the data in the database to aid in this process. To this end, we propose a new paradigm, guided interaction, to solve the noted challenges, by using interaction to guide the user through the query formulation, query execution and result examination processes. The user can be given advance information during query specification that can not only assist in query formulation, but may also lead to abandonment of an unproductive query direction or the satisfaction of information need even before the query specification is complete. There are significant engineering challenges to constructing the system we envision, and the technological building blocks to address these challenges exist today. 1.","author":[{"family":"Nandi","given":"Arnab"}],"source":"CiteSeer","title":"Guided Interaction: Rethinking the Query-Result Paradigm ABSTRACT","title-short":"Guided Interaction","type":"book"},
  {"id":"natarajanAnalysisClinicalQueries2010","abstract":"Purpose\nWhile search engines have become nearly ubiquitous on the Web, electronic health records (EHRs) generally lack search functionality; furthermore, there is no knowledge on how and what healthcare providers search while using an EHR-based search utility. In this study, we sought to understand user needs as captured by their search queries.\nMethods\nThis post-implementation study analyzed user search log files for 6 months from an EHR-based, free-text search utility at our large academic institution. The search logs were de-identified and then analyzed in two steps. First, two investigators classified all the unique queries as navigational, transactional, or informational searches. Second, three physician reviewers categorized a random sample of 357 informational searches into high-level semantic types derived from the Unified Medical Language System (UMLS). The reviewers were given overlapping data sets, such that two physicians reviewed each query.\nResults\nWe analyzed 2207 queries performed by 436 unique users over a 6-month period. Of the 2207 queries, 980 were unique queries. Users of the search utility included clinicians, researchers and administrative staff. Across the whole user population, approximately 14.5% of the user searches were navigational searches and 85.1% were informational. Within informational searches, we found that users predominantly searched for laboratory results and specific diseases.\nConclusions\nA variety of user types, ranging from clinicians to administrative staff, took advantage of the EHR-based search utility. Though these users’ search behavior differed, they predominantly performed informational searches related to laboratory results and specific diseases. Additionally, a number of queries were part of words, implying the need for a free-text module to be included in any future concept-based search algorithm.","accessed":{"date-parts":[[2020,9,9]]},"author":[{"family":"Natarajan","given":"Karthik"},{"family":"Stein","given":"Daniel"},{"family":"Jain","given":"Samat"},{"family":"Elhadad","given":"Noémie"}],"container-title":"International Journal of Medical Informatics","container-title-short":"International Journal of Medical Informatics","DOI":"10.1016/j.ijmedinf.2010.03.004","ISSN":"1386-5056","issue":"7","issued":{"date-parts":[[2010,7,1]]},"language":"en","page":"515-522","source":"ScienceDirect","title":"An analysis of clinical queries in an electronic health record search utility","type":"article-journal","URL":"http://www.sciencedirect.com/science/article/pii/S1386505610000638","volume":"79"},
  {"id":"nguyenMakingSoftwareTutorial2015","accessed":{"date-parts":[[2020,6,3]]},"author":[{"family":"Nguyen","given":"Cuong"},{"family":"Liu","given":"Feng"}],"container-title":"Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15","DOI":"10.1145/2702123.2702209","event":"the 33rd Annual ACM Conference","event-place":"Seoul, Republic of Korea","ISBN":"978-1-4503-3145-6","issued":{"date-parts":[[2015]]},"language":"en","page":"1565-1568","publisher":"ACM Press","publisher-place":"Seoul, Republic of Korea","source":"DOI.org (Crossref)","title":"Making Software Tutorial Video Responsive","type":"paper-conference","URL":"http://dl.acm.org/citation.cfm?doid=2702123.2702209"},
  {"id":"nielsenAugmentingLongtermMemory2018","accessed":{"date-parts":[[2020,6,8]]},"author":[{"family":"Nielsen","given":"Michael"}],"issued":{"date-parts":[[2018]]},"source":"augmentingcognition.com","title":"Augmenting Long-term Memory","type":"article-journal","URL":"http://augmentingcognition.com/ltm.html"},
  {"id":"nielsenUsabilityEngineering2010","author":[{"family":"Nielsen","given":"Jakob"}],"edition":"Nachdr.","event-place":"Amsterdam","ISBN":"978-0-12-518406-9","issued":{"date-parts":[[2010]]},"language":"eng","note":"OCLC: 760142137","number-of-pages":"362","publisher":"Kaufmann","publisher-place":"Amsterdam","source":"Gemeinsamer Bibliotheksverbund ISBN","title":"Usability engineering","type":"book"},
  {"id":"normanDesignEverydayThings2013","abstract":"\"Even the smartest among us can feel inept as we fail to figure out which light switch or oven burner to turn on, or whether to push, pull, or slide a door. The fault, argues this ingenious-even liberating-book, lies not in ourselves, but in product design that ignores the needs of users and the principles of cognitive psychology. The problems range from ambiguous and hidden controls to arbitrary relationships between controls and functions, coupled with a lack of feedback or other assistance and unreasonable demands on memorization. The Design of Everyday Things shows that good, usable design is possible. The rules are simple: make things visible, exploit natural relationships that couple function and control, and make intelligent use of constraints. The goal: guide the user effortlessly to the right action on the right control at the right time. In this entertaining and insightful analysis, cognitive scientist Don Norman hails excellence of design as the most important key to regaining the competitive edge in influencing consumer behavior. Now fully expanded and updated, with a new introduction by the author, The Design of Everyday Things is a powerful primer on how-and why-some products satisfy customers while others only frustrate them. \"--","author":[{"family":"Norman","given":"Donald A."}],"edition":"Revised and expanded edition","event-place":"New York, NY","ISBN":"978-0-465-05065-9 978-0-465-00394-5","issued":{"date-parts":[[2013]]},"language":"eng","note":"OCLC: 867161104","number-of-pages":"347","publisher":"Basic Books","publisher-place":"New York, NY","source":"Gemeinsamer Bibliotheksverbund ISBN","title":"The design of everyday things","type":"book"},
  {"id":"normanInvisibleComputerWhy1999","author":[{"family":"Norman","given":"Donald A."}],"edition":"1. MIT Press paperback ed","event-place":"Cambridge, Mass. [u.a.] MIT","ISBN":"978-0-262-64041-1 978-0-262-14065-2","issued":{"date-parts":[[1999]]},"language":"eng","note":"OCLC: 246991881","number-of-pages":"302","publisher-place":"Cambridge, Mass. [u.a.] MIT","source":"Gemeinsamer Bibliotheksverbund ISBN","title":"The invisible computer: why good products can fail, the personal computer is so complex, and information appliances are the solution","title-short":"The invisible computer","type":"book"},
  {"id":"normanLivingComplexity2016","author":[{"family":"Norman","given":"Donald A"}],"ISBN":"978-0-262-52894-8","issued":{"date-parts":[[2016]]},"language":"English","note":"OCLC: 953318971","source":"Open WorldCat","title":"Living with complexity","type":"book"},
  {"id":"OvercomingProcrastinationUltimate2019","abstract":"Tired of putting off tasks you need to get done? This guide covers everything you need to know about what procrastination is and how to banish it.","accessed":{"date-parts":[[2020,7,17]]},"container-title":"RescueTime Blog","issued":{"date-parts":[[2019,2,12]]},"language":"en-US","section":"Workplace Productivity","source":"blog.rescuetime.com","title":"Overcoming Procrastination: The ultimate guide to finishing what you start","title-short":"Overcoming Procrastination","type":"webpage","URL":"https://blog.rescuetime.com/procrastination/"},
  {"id":"palaigeorgiouKnownUnknownWeaknesses2010","accessed":{"date-parts":[[2020,6,17]]},"author":[{"family":"Palaigeorgiou","given":"George"},{"family":"Despotakis","given":"Theofanis"}],"container-title":"Journal of Information Technology Education: Research","container-title-short":"JITE:Research","DOI":"10.28945/1129","ISSN":"1547-9714, 1539-3585","issued":{"date-parts":[[2010]]},"language":"en","page":"081-098","source":"DOI.org (Crossref)","title":"Known and Unknown Weaknesses in Software Animated Demonstrations (Screencasts): A Study in Self-Paced Learning Settings","title-short":"Known and Unknown Weaknesses in Software Animated Demonstrations (Screencasts)","type":"article-journal","URL":"https://www.informingscience.org/Publications/1129","volume":"9"},
  {"id":"palmiterAnimatedDemonstrationsVs1989","abstract":"Animated demonstrations have been created due to the development of direct manipulation i terfaces and the need for faster learning, so that users can learn interface procedures by watching. To compare animated emonstrations with written inst~~ions we observed users learning and performing HyperCardTMS authoring tasks on the Ma~nt~h ~ during three performance sessions. In the training session, users were asked either to watch a demonstration or read the procedures needed for the task and then to perform the task. In the later two sessions users were asked to perform tasks identical or similar to the tasks used in the training session. Results showed that demons~ations provided faster and more accurate learning during the training session. However, during the later sessions those who saw demonstrated procedures took longer to perform the tasks than did users of written instructions. Users appeared to be mimicking the training demonstrations without processing the information which would he needed later. In fact, when users had to infer procedures for tasks which were similar to those seen in the training session, the text group was much better at deducing the necessary procedures than the demons~ation","author":[{"family":"Palmiter","given":"Susan"},{"family":"Elkerton","given":"Jay"},{"family":"Baggett","given":"Patricia"}],"issued":{"date-parts":[[1989]]},"source":"CiteSeer","title":"Animated demonstrations vs written instructions for learning procedural tasks: a preliminary investigation","title-short":"Animated demon rations vs written instructions for learning procedural tasks","type":"book"},
  {"id":"palmiterEvaluationAnimatedDemonstrations1991","accessed":{"date-parts":[[2020,6,15]]},"author":[{"family":"Palmiter","given":"Susan"},{"family":"Elkerton","given":"Jay"}],"collection-title":"CHI '91","container-title":"Proceedings of the SIGCHI Conference on Human Factors in Computing Systems","DOI":"10.1145/108844.108906","event-place":"New Orleans, Louisiana, USA","ISBN":"978-0-89791-383-6","issued":{"date-parts":[[1991,3,1]]},"page":"257–263","publisher":"Association for Computing Machinery","publisher-place":"New Orleans, Louisiana, USA","source":"ACM Digital Library","title":"An evaluation of animated demonstrations of learning computer-based tasks","type":"paper-conference","URL":"https://doi.org/10.1145/108844.108906"},
  {"id":"pangoliAutomaticGenerationTaskoriented1995","abstract":"This work presents an approach to the design of the software component of an Interactive System, which supports the generation of automatic task-oriented help. Help can easily be generated from the abstract formal specification of the associated system without any further effort. The architectural description is obtained in a taskclriven way, where tasks are specified by indicating temporal ordering constraints using operators of a concurrent formal notation. The association of user tasks with software interaction objects, which inherit constraints of related tasks, gives the information to structure task-oriented help in an immediate way. The help given is thus more expressive with a consequent improvement in the usability of an Interactive System.","accessed":{"date-parts":[[2020,6,17]]},"author":[{"family":"Pangoli","given":"S."},{"family":"Paternó","given":"F."}],"container-title":"Proceedings of the 8th annual ACM symposium on User interface and software technology  - UIST '95","DOI":"10.1145/215585.215971","event":"the 8th annual ACM symposium","event-place":"Pittsburgh, Pennsylvania, United States","ISBN":"978-0-89791-709-4","issued":{"date-parts":[[1995]]},"language":"en","page":"181-187","publisher":"ACM Press","publisher-place":"Pittsburgh, Pennsylvania, United States","source":"DOI.org (Crossref)","title":"Automatic generation of task-oriented help","type":"paper-conference","URL":"http://portal.acm.org/citation.cfm?doid=215585.215971"},
  {"id":"pieczkiewiczDesignEvaluationWebbased2007","abstract":"We describe the implementation and evaluation of an interactive system for displaying patient pulmonary information from a lung transplant home monitoring program. Software was designed to take case information and render it as Scalable Vector Graphics (SVG) in a web browser. Twelve clinician readers reviewed twenty randomly-ordered, retrospective cases in each of three display formats (graphical, graphical interactive, and tabular) and determined whether they showed signs of infection or graft rejection. Decision times and reader preferences were also recorded. No statistically significant differences were found with respect to decision accuracy. However, the graphical displays yielded up to 25% faster decision times than numerical tables. Readers overwhelmingly preferred the graphical formats, particularly the interactive displays. We believe that graphical, interactive displays of patient data would be well-accepted and efficacious tools in clinical practice, whether for transplant care, or any care involving the assessment of large bodies of time-oriented, multivariable data.","author":[{"family":"Pieczkiewicz","given":"David S."},{"family":"Finkelstein","given":"Stanley M."},{"family":"Hertz","given":"Marshall I."}],"container-title":"AMIA ... Annual Symposium proceedings. AMIA Symposium","container-title-short":"AMIA Annu Symp Proc","ISSN":"1942-597X","issued":{"date-parts":[[2007,10,11]]},"language":"eng","page":"598-602","PMCID":"PMC2655794","PMID":"18693906","source":"PubMed","title":"Design and evaluation of a web-based interactive visualization system for lung transplant home monitoring data","type":"article-journal"},
  {"id":"pierceTypesProgrammingLanguages2002","author":[{"family":"Pierce","given":"Benjamin C."}],"call-number":"QA76.7 .P54 2002","event-place":"Cambridge, Mass","ISBN":"978-0-262-16209-8","issued":{"date-parts":[[2002]]},"number-of-pages":"623","publisher":"MIT Press","publisher-place":"Cambridge, Mass","source":"Library of Congress ISBN","title":"Types and programming languages","type":"book"},
  {"id":"pivovarovCanPatientRecord2016","abstract":"We present a pre/post intervention study, where HARVEST, a general-purpose patient record summarization tool, was introduced to ten data abstraction specialists. The specialists are responsible for reviewing hundreds of patient charts each month and reporting disease-specific quality metrics to a variety of online registries and databases. We qualitatively and quantitatively investigated whether HARVEST improved the process of quality metric abstraction. Study instruments included pre/post questionnaires and log analyses of the specialists' actions in the electronic health record (EHR). The specialists reported favorable impressions of HARVEST and suggested that it was most useful when abstracting metrics from patients with long hospitalizations and for metrics that were not consistently captured in a structured manner in the EHR. A statistically significant reduction in time spent per chart before and after use of HARVEST was observed for 50% of the specialists and 90% of the specialists continue to use HARVEST after the study period.","author":[{"family":"Pivovarov","given":"Rimma"},{"family":"Coppleson","given":"Yael Judith"},{"family":"Gorman","given":"Sharon Lipsky"},{"family":"Vawdrey","given":"David K."},{"family":"Elhadad","given":"Noémie"}],"container-title":"AMIA ... Annual Symposium proceedings. AMIA Symposium","container-title-short":"AMIA Annu Symp Proc","ISSN":"1942-597X","issued":{"date-parts":[[2016]]},"language":"eng","page":"1020-1029","PMCID":"PMC5333341","PMID":"28269899","source":"PubMed","title":"Can Patient Record Summarization Support Quality Metric Abstraction?","type":"article-journal","volume":"2016"},
  {"id":"plaisantShowMeGuidelines2005","abstract":"Although recorded demonstrations (screen capture animations with narration) have become a popular form of instruction for user interfaces, little work has been done to describe guidelines for their design. Based on our experience in several projects, we offer a starting set of guidelines for the design of visually appealing and cognitively effective recorded demonstrations. Technical guidelines encourage users to keep file sizes small, strive for universal usability, and ensure user control etc. and provide tips to achieve those goals. Content guidelines include: create short demonstrations that focus on tasks, highlight each step with auditory and visual cues, synchronize narration and animation carefully, and create demonstrations with a clear beginning, middle, and end.","accessed":{"date-parts":[[2020,6,15]]},"author":[{"family":"Plaisant","given":"Catherine"},{"family":"Shneiderman","given":"Ben"}],"collection-title":"VLHCC '05","container-title":"Proceedings of the 2005 IEEE Symposium on Visual Languages and Human-Centric Computing","DOI":"10.1109/VLHCC.2005.57","event-place":"USA","ISBN":"978-0-7695-2443-6","issued":{"date-parts":[[2005,9,20]]},"page":"171–178","publisher":"IEEE Computer Society","publisher-place":"USA","source":"ACM Digital Library","title":"Show Me! Guidelines for Producing Recorded Demonstrations","type":"paper-conference","URL":"https://doi.org/10.1109/VLHCC.2005.57"},
  {"id":"pongnumkulPauseandplayAutomaticallyLinking2011","abstract":"Video tutorials provide a convenient means for novices to learn new software applications. Unfortunately, staying in sync with a video while trying to use the target application at the same time requires users to repeatedly switch from the application to the video to pause or scrub backwards to replay missed steps. We present Pause-and-Play, a system that helps users work along with existing video tutorials. Pause-and-Play detects important events in the video and links them with corresponding events in the target application as the user tries to replicate the depicted procedure. This linking allows our system to automatically pause and play the video to stay in sync with the user. Pause-and-Play also supports convenient video navigation controls that are accessible from within the target application and allow the user to easily replay portions of the video without switching focus out of the application. Finally, since our system uses computer vision to detect events in existing videos and leverages application scripting APIs to obtain real time usage traces, our approach is largely independent of the specific target application and does not require access or modifications to application source code. We have implemented Pause-and-Play for two target applications, Google SketchUp and Adobe Photoshop, and we report on a user study that shows our system improves the user experience of working with video tutorials.","accessed":{"date-parts":[[2020,8,20]]},"author":[{"family":"Pongnumkul","given":"Suporn"},{"family":"Dontcheva","given":"Mira"},{"family":"Li","given":"Wilmot"},{"family":"Wang","given":"Jue"},{"family":"Bourdev","given":"Lubomir"},{"family":"Avidan","given":"Shai"},{"family":"Cohen","given":"Michael F."}],"collection-title":"UIST '11","container-title":"Proceedings of the 24th annual ACM symposium on User interface software and technology","DOI":"10.1145/2047196.2047213","event-place":"New York, NY, USA","ISBN":"978-1-4503-0716-1","issued":{"date-parts":[[2011,10,16]]},"page":"135–144","publisher":"Association for Computing Machinery","publisher-place":"New York, NY, USA","source":"ACM Digital Library","title":"Pause-and-play: automatically linking screencast video tutorials with applications","title-short":"Pause-and-play","type":"paper-conference","URL":"https://doi.org/10.1145/2047196.2047213"},
  {"id":"poursabzi-sangdehManipulatingMeasuringModel2019","abstract":"With the increased use of machine learning in decision-making scenarios, there has been a growing interest in creating human-interpretable machine learning models. While many such models have been proposed, there have been relatively few experimental studies of whether these models achieve their intended effects, such as encouraging people to follow the model's predictions when the model is correct and to deviate when it makes a mistake. We present a series of randomized, pre-registered experiments comprising 3,800 participants in which people were shown functionally identical models that varied only in two factors thought to influence interpretability: the number of input features and the model transparency (clear or black-box). Predictably, participants who were shown a clear model with a small number of features were better able to simulate the model's predictions. However, contrary to what one might expect when manipulating interpretability, we found no improvements in the degree to which participants followed the model's predictions when it was beneficial to do so. Even more surprisingly, increased transparency hampered people's ability to detect when the model makes a sizable mistake and correct for it, seemingly due to information overload. These counterintuitive results suggest that decision scientists creating interpretable models should harbor a healthy skepticism of their intuitions and empirically verify that interpretable models achieve their intended effects.","accessed":{"date-parts":[[2020,9,28]]},"author":[{"family":"Poursabzi-Sangdeh","given":"Forough"},{"family":"Goldstein","given":"Daniel G."},{"family":"Hofman","given":"Jake M."},{"family":"Vaughan","given":"Jennifer Wortman"},{"family":"Wallach","given":"Hanna"}],"container-title":"arXiv:1802.07810 [cs]","issued":{"date-parts":[[2019,11,8]]},"source":"arXiv.org","title":"Manipulating and Measuring Model Interpretability","type":"article-journal","URL":"http://arxiv.org/abs/1802.07810"},
  {"id":"PowerPredict2020","accessed":{"date-parts":[[2020,8,27]]},"title":"The Power to Predict: 2020 CBS Report","type":"webpage","URL":"https://www.rmf.harvard.edu/Malpractice-Data/Annual-Benchmark-Reports/The-Power-to-Predict"},
  {"id":"PunchedCard2020","abstract":"A punched card or punch card is a piece of stiff paper that can be used to contain digital data represented by the presence or absence of holes in predefined positions. Digital data can be used for data processing applications or used to directly control automated machinery.\nPunched cards were widely used through much of the 20th century in the data processing industry, where specialized and increasingly complex unit record machines, organized into semiautomatic data processing systems, used punched cards for data input, output, and storage.  The IBM 12-row/80-column punched card format came to dominate the industry. Many early digital computers used punched cards as the primary medium for input of both computer programs and data.\nWhile punched cards are now obsolete as a storage medium, as of 2012, some voting machines still use punched cards to record votes.","accessed":{"date-parts":[[2020,8,7]]},"container-title":"Wikipedia","issued":{"date-parts":[[2020,8,7]]},"language":"en","note":"Page Version ID: 971639399","source":"Wikipedia","title":"Punched card","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=Punched_card&oldid=971639399"},
  {"id":"raderExplanationsMechanismsSupporting2018","abstract":"Transparency can empower users to make informed choices about how they use an algorithmic decision-making system and judge its potential consequences. However, transparency is often conceptualized by the outcomes it is intended to bring about, not the speciﬁcs of mechanisms to achieve those outcomes. We conducted an online experiment focusing on how different ways of explaining Facebook’s News Feed algorithm might affect participants’ beliefs and judgments about the News Feed. We found that all explanations caused participants to become more aware of how the system works, and helped them to determine whether the system is biased and if they can control what they see. The explanations were less effective for helping participants evaluate the correctness of the system’s output, and form opinions about how sensible and consistent its behavior is. We present implications for the design of transparency mechanisms in algorithmic decision-making systems based on these results.","accessed":{"date-parts":[[2020,10,5]]},"author":[{"family":"Rader","given":"Emilee"},{"family":"Cotter","given":"Kelley"},{"family":"Cho","given":"Janghee"}],"container-title":"Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems  - CHI '18","DOI":"10.1145/3173574.3173677","event":"the 2018 CHI Conference","event-place":"Montreal QC, Canada","ISBN":"978-1-4503-5620-6","issued":{"date-parts":[[2018]]},"language":"en","page":"1-13","publisher":"ACM Press","publisher-place":"Montreal QC, Canada","source":"DOI.org (Crossref)","title":"Explanations as Mechanisms for Supporting Algorithmic Transparency","type":"paper-conference","URL":"http://dl.acm.org/citation.cfm?doid=3173574.3173677"},
  {"id":"rajwanMedicalInformationVisualization2010","abstract":"Communication between patients and health care providers may require sharing of data and knowledge that is complex and of high-volume. To support communication of these types of information, visualization techniques and tools can reduce cognitive burden in informed patient-centered health decisions and empower patients in their own care. Designing and implementing effective visualization depend on iterative consideration of cognitive needs and tasks of the patient (physical, intellectual, and linguistic), conceptual needs of the communication process (encoding and decoding, shared mental models, and common ground), and pragmatic requirements of care (culture and values) in making health choices. We discuss the evidence, experience, and motivation for a model, the Medical Information Visualization --- Conceptual Model (MIV-CM), to guide the process of patient-oriented visualization design and implementation.","accessed":{"date-parts":[[2020,8,5]]},"author":[{"family":"Rajwan","given":"Yair G."},{"family":"Kim","given":"George R."}],"collection-title":"IHI '10","container-title":"Proceedings of the 1st ACM International Health Informatics Symposium","DOI":"10.1145/1882992.1883074","event-place":"Arlington, Virginia, USA","ISBN":"978-1-4503-0030-8","issued":{"date-parts":[[2010,11,11]]},"page":"512–516","publisher":"Association for Computing Machinery","publisher-place":"Arlington, Virginia, USA","source":"ACM Digital Library","title":"Medical information visualization conceptual model for patient-physician health communication","type":"paper-conference","URL":"https://doi.org/10.1145/1882992.1883074"},
  {"id":"rameshShowMeHowTranslatingUser2011","abstract":"Many people learn how to use complex authoring applications through tutorials. However, user interfaces for authoring tools differ between versions, platforms, and competing products, limiting the utility of tutorials. Our goal is to make tutorials more useful by enabling users to repurpose tutorials between similar applications. We introduce UI translation interfaces which enable users to locate commands in one application using the interface language of another application. Our end-user tool, ShowMeHow, demonstrates two interaction techniques to accomplish translations: 1) direct manipulation of interface fac¸ades and 2) text search for commands using the vocabulary of another application. We discuss tools needed to construct the translation maps that enable these techniques. An initial study (n=12) shows that users can locate unfamiliar commands twice as fast with interface fac¸ades. A second study shows that ShowMeHow enables users to work through tutorials written for one application in another application.","author":[{"family":"Ramesh","given":"Vidya"},{"family":"Hsu","given":"Charlie"},{"family":"Agrawala","given":"Maneesh"},{"family":"Hartmann","given":"Bjorn"}],"container-title":"Social Learning","issued":{"date-parts":[[2011]]},"language":"en","page":"8","source":"Zotero","title":"ShowMeHow: Translating User Interface Instructions Between Similar Applications","type":"article-journal"},
  {"id":"RefactoringUIBook","accessed":{"date-parts":[[2020,7,25]]},"title":"Refactoring UI: The Book","type":"webpage","URL":"https://refactoringui.com/book/"},
  {"id":"ReLicensingLibrary","accessed":{"date-parts":[[2020,7,26]]},"title":"Re: Licensing and the library version of git [LWN.net]","type":"webpage","URL":"https://lwn.net/Articles/193245/"},
  {"id":"RethinkingHowTechnology","abstract":"This essay explores visually how keeping data and AI on‑device could empower not only users, but also companies.","accessed":{"date-parts":[[2020,7,27]]},"language":"en","source":"thecloudfall.com","title":"Rethinking how technology uses our personal data","type":"webpage","URL":"https://thecloudfall.com"},
  {"id":"rettigNobodyReadsDocumentation1991","accessed":{"date-parts":[[2020,6,15]]},"author":[{"family":"Rettig","given":"Marc"}],"container-title":"Communications of the ACM","container-title-short":"Commun. ACM","DOI":"10.1145/105783.105788","ISSN":"0001-0782","issue":"7","issued":{"date-parts":[[1991,7,1]]},"page":"19–24","source":"July 1991","title":"Nobody reads documentation","type":"article-journal","URL":"https://doi.org/10.1145/105783.105788","volume":"34"},
  {"id":"rieberComputersGraphicsLearning1994","author":[{"family":"Rieber","given":"Lloyd P."}],"call-number":"LB1028.43 .R53 1994","event-place":"Madison, Wis","ISBN":"978-0-697-14894-0","issued":{"date-parts":[[1994]]},"number-of-pages":"287","publisher":"Brown & Benchmark","publisher-place":"Madison, Wis","source":"Library of Congress ISBN","title":"Computers, graphics & learning","type":"book"},
  {"id":"riemanFieldStudyExploratory1996","accessed":{"date-parts":[[2020,6,15]]},"author":[{"family":"Rieman","given":"John"}],"container-title":"ACM Transactions on Computer-Human Interaction (TOCHI)","container-title-short":"ACM Trans. Comput.-Hum. Interact.","DOI":"10.1145/234526.234527","ISSN":"1073-0516, 1557-7325","issue":"3","issued":{"date-parts":[[1996,9]]},"language":"en","page":"189-218","source":"DOI.org (Crossref)","title":"A field study of exploratory learning strategies","type":"article-journal","URL":"http://dl.acm.org/doi/10.1145/234526.234527","volume":"3"},
  {"id":"rindInteractiveInformationVisualization2013","abstract":"Physicians are confronted with increasingly complex patient histories based on which they must make life-critical treatment decisions. At the same time, clinical researchers are eager to study the growing databases of patient histories to detect unknown patterns, ensure quality control, and discover surprising outcomes. Designers of Electronic Health Record systems (EHRs) have great potential to apply innovative visual methods to support clinical decision-making and research. This work surveys the state-of-the-art of information visualization systems for exploring and querying EHRs, as described in the scientiﬁc literature.","accessed":{"date-parts":[[2020,8,5]]},"author":[{"family":"Rind","given":"Alexander"}],"container-title":"Foundations and Trends® in Human–Computer Interaction","container-title-short":"FNT in Human–Computer Interaction","DOI":"10.1561/1100000039","ISSN":"1551-3955, 1551-3963","issue":"3","issued":{"date-parts":[[2013]]},"language":"en","page":"207-298","source":"DOI.org (Crossref)","title":"Interactive Information Visualization to Explore and Query Electronic Health Records","type":"article-journal","URL":"http://www.nowpublishers.com/article/Details/HCI-039","volume":"5"},
  {"id":"rosenbloomManagingFloodCodes2012","abstract":"In a medical record, the problem list is a centralized place where healthcare providers can summarize key clinical information about patients. While problem-oriented medical records have been promulgated since Larry Weed described them in 1968, recent advances in health information technologies, evolution in clinical workflows and the emergence of several federal programs have elevated the importance of up to date problem lists. However, each of these forces have also added requirements to how problem lists are structured, formatted and used. For example, current federal programs encourage healthcare providers using electronic health record systems to document problem lists using either SNOMED CT or ICD-9, while federal reimbursement practices are migrating towards ICD-10. None of these problem list standards have been demonstrated to be usable for direct problem list entry. Busy healthcare providers have found it challenging to maintain patient problem lists that accommodate these requirements while also performing other necessary tasks, such as electronic prescribing and test ordering. In this presentation, we will discuss the state of science around creating and maintaining structured problem lists that accommodate numerous external requirements, and demonstrate examples of tools that put this science into practice.","accessed":{"date-parts":[[2020,8,5]]},"author":[{"family":"Rosenbloom","given":"S. Trent"},{"family":"Shultz","given":"Ed"},{"family":"Wright","given":"Adam"}],"container-title":"AMIA Annual Symposium Proceedings","container-title-short":"AMIA Annu Symp Proc","ISSN":"1942-597X","issued":{"date-parts":[[2012,11,3]]},"page":"8-10","PMCID":"PMC3540575","PMID":"null","source":"PubMed Central","title":"Managing the Flood of Codes: maintaining patient problem lists in the era of Meaningful Use and ICD10","title-short":"Managing the Flood of Codes","type":"article-journal","URL":"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3540575/","volume":"2012"},
  {"id":"rossonParadoxActiveUser","author":[{"family":"Rosson","given":"Mary Beth"}],"language":"en","page":"22","source":"Zotero","title":"Paradox of the Active User","type":"article-journal"},
  {"id":"rothDataCharacterizationIntelligent1990","abstract":"An automatic presentation system is an intelligent interface component which receives information from a user or application program and designs a combination of graphics and text that effectively conveys it. It is a facility that assumes the presentation responsibilities for other programs. An important research question has been how information should be specified or described by an application program for it to be presented by an automatic presenter. This paper proposes a taxonomy of information characteristics which would need to be provided to either human or computer designers for them to create presentations reflecting the individual needs of a diverse group of users. The proposed taxonomy of characteristics defines the representational goals for intelligent interfaces which reason about graphical displays.","accessed":{"date-parts":[[2020,8,5]]},"author":[{"family":"Roth","given":"Steven F."},{"family":"Mattis","given":"Joe"}],"collection-title":"CHI '90","container-title":"Proceedings of the SIGCHI Conference on Human Factors in Computing Systems","DOI":"10.1145/97243.97273","event-place":"Seattle, Washington, USA","ISBN":"978-0-201-50932-8","issued":{"date-parts":[[1990,3,1]]},"page":"193–200","publisher":"Association for Computing Machinery","publisher-place":"Seattle, Washington, USA","source":"ACM Digital Library","title":"Data characterization for intelligent graphics presentation","type":"paper-conference","URL":"https://doi.org/10.1145/97243.97273"},
  {"id":"schnipperSmartFormsElectronic2008","abstract":"Abstract.  Clinical decision support systems (CDSS) integrated within Electronic Medical Records (EMR) hold the promise of improving healthcare quality. To date","accessed":{"date-parts":[[2020,8,5]]},"author":[{"family":"Schnipper","given":"Jeffrey L."},{"family":"Linder","given":"Jeffrey A."},{"family":"Palchuk","given":"Matvey B."},{"family":"Einbinder","given":"Jonathan S."},{"family":"Li","given":"Qi"},{"family":"Postilnik","given":"Anatoly"},{"family":"Middleton","given":"Blackford"}],"container-title":"Journal of the American Medical Informatics Association","container-title-short":"J Am Med Inform Assoc","DOI":"10.1197/jamia.M2501","ISSN":"1067-5027","issue":"4","issued":{"date-parts":[[2008,7,1]]},"language":"en","page":"513-523","publisher":"Oxford Academic","source":"academic.oup.com","title":"“Smart Forms” in an Electronic Medical Record: Documentation-based Clinical Decision Support to Improve Disease Management","title-short":"“Smart Forms” in an Electronic Medical Record","type":"article-journal","URL":"https://academic.oup.com/jamia/article/15/4/513/733498","volume":"15"},
  {"id":"shanafeltChangesBurnoutSatisfaction2015","abstract":"OBJECTIVE: To evaluate the prevalence of burnout and satisfaction with work-life balance in physicians and US workers in 2014 relative to 2011.\nPATIENTS AND METHODS: From August 28, 2014, to October 6, 2014, we surveyed both US physicians and a probability-based sample of the general US population using the methods and measures used in our 2011 study. Burnout was measured using validated metrics, and satisfaction with work-life balance was assessed using standard tools.\nRESULTS: Of the 35,922 physicians who received an invitation to participate, 6880 (19.2%) completed surveys. When assessed using the Maslach Burnout Inventory, 54.4% (n=3680) of the physicians reported at least 1 symptom of burnout in 2014 compared with 45.5% (n=3310) in 2011 (P<.001). Satisfaction with work-life balance also declined in physicians between 2011 and 2014 (48.5% vs 40.9%; P<.001). Substantial differences in rates of burnout and satisfaction with work-life balance were observed by specialty. In contrast to the trends in physicians, minimal changes in burnout or satisfaction with work-life balance were observed between 2011 and 2014 in probability-based samples of working US adults, resulting in an increasing disparity in burnout and satisfaction with work-life balance in physicians relative to the general US working population. After pooled multivariate analysis adjusting for age, sex, relationship status, and hours worked per week, physicians remained at an increased risk of burnout (odds ratio, 1.97; 95% CI, 1.80-2.16; P<.001) and were less likely to be satisfied with work-life balance (odds ratio, 0.68; 95% CI, 0.62-0.75; P<.001).\nCONCLUSION: Burnout and satisfaction with work-life balance in US physicians worsened from 2011 to 2014. More than half of US physicians are now experiencing professional burnout.","author":[{"family":"Shanafelt","given":"Tait D."},{"family":"Hasan","given":"Omar"},{"family":"Dyrbye","given":"Lotte N."},{"family":"Sinsky","given":"Christine"},{"family":"Satele","given":"Daniel"},{"family":"Sloan","given":"Jeff"},{"family":"West","given":"Colin P."}],"container-title":"Mayo Clinic Proceedings","container-title-short":"Mayo Clin. Proc.","DOI":"10.1016/j.mayocp.2015.08.023","ISSN":"1942-5546","issue":"12","issued":{"date-parts":[[2015,12]]},"language":"eng","page":"1600-1613","PMID":"26653297","source":"PubMed","title":"Changes in Burnout and Satisfaction With Work-Life Balance in Physicians and the General US Working Population Between 2011 and 2014","type":"article-journal","volume":"90"},
  {"id":"shanafeltRelationshipClericalBurden2016","abstract":"OBJECTIVE: To evaluate associations between the electronic environment, clerical burden, and burnout in US physicians.\nPARTICIPANTS AND METHODS: Physicians across all specialties in the United States were surveyed between August and October 2014. Physicians provided information regarding use of electronic health records (EHRs), computerized physician order entry (CPOE), and electronic patient portals. Burnout was measured using validated metrics.\nRESULTS: Of 6375 responding physicians in active practice, 5389 (84.5%) reported that they used EHRs. Of 5892 physicians who indicated that CPOE was relevant to their specialty, 4858 (82.5%) reported using CPOE. Physicians who used EHRs and CPOE had lower satisfaction with the amount of time spent on clerical tasks and higher rates of burnout on univariate analysis. On multivariable analysis, physicians who used EHRs (odds ratio [OR]=0.67; 95% CI, 0.57-0.79; P<.001) or CPOE (OR=0.72; 95% CI, 0.62-0.84; P<.001) were less likely to be satisfied with the amount of time spent on clerical tasks after adjusting for age, sex, specialty, practice setting, and hours worked per week. Use of CPOE was also associated with a higher risk of burnout after adjusting for these same factors (OR=1.29; 95% CI, 1.12-1.48; P<.001). Use of EHRs was not associated with burnout in adjusted models controlling for CPOE and other factors.\nCONCLUSION: In this large national study, physicians' satisfaction with their EHRs and CPOE was generally low. Physicians who used EHRs and CPOE were less satisfied with the amount of time spent on clerical tasks and were at higher risk for professional burnout.","author":[{"family":"Shanafelt","given":"Tait D."},{"family":"Dyrbye","given":"Lotte N."},{"family":"Sinsky","given":"Christine"},{"family":"Hasan","given":"Omar"},{"family":"Satele","given":"Daniel"},{"family":"Sloan","given":"Jeff"},{"family":"West","given":"Colin P."}],"container-title":"Mayo Clinic Proceedings","container-title-short":"Mayo Clin. Proc.","DOI":"10.1016/j.mayocp.2016.05.007","ISSN":"1942-5546","issue":"7","issued":{"date-parts":[[2016,7]]},"language":"eng","page":"836-848","PMID":"27313121","source":"PubMed","title":"Relationship Between Clerical Burden and Characteristics of the Electronic Environment With Physician Burnout and Professional Satisfaction","type":"article-journal","volume":"91"},
  {"id":"shneidermanDesigningUserInterface2010","author":[{"family":"Shneiderman","given":"Ben"},{"family":"Plaisant","given":"Catherine"}],"call-number":"QA76.9.H85 S54 2010","edition":"5th ed","event-place":"Boston","ISBN":"978-0-321-53735-5","issued":{"date-parts":[[2010]]},"note":"OCLC: ocn244066651","number-of-pages":"606","publisher":"Addison-Wesley","publisher-place":"Boston","source":"Library of Congress ISBN","title":"Designing the user interface: strategies for effective human-computer interaction","title-short":"Designing the user interface","type":"book"},
  {"id":"shneidermanDirectManipulationStep1981","abstract":"Direct manipulation is a style of interaction which has been used by implementers of widely varying systems. Direct manipulation permits novice users access to powerful facilities without the burden of learning to use a complex syntax and lengthy list of commands. Display editors use direct manipulation more than line editors. Form-fill-in is more direct than tag fields and delimiters. Spatial data management is more direct than query-by-example, which is more direct than SEQUEL. Computer arcade games and Visicalc are further examples.Direct manipulation involves three interrelated techniques:1. Provide a physically direct way of moving a cursor or manipulating the objects of interest.2. Present a concrete visual representation of the objects of interest and immediately change the view to reflect operations.3. Avoid using a command language and depend? on operations applied to the cognitive model which is shown on the display.","accessed":{"date-parts":[[2020,6,15]]},"author":[{"family":"Shneiderman","given":"Ben"}],"collection-title":"CHI '81","container-title":"Proceedings of the Joint Conference on Easier and More Productive Use of Computer Systems. (Part - II): Human Interface and the User Interface - Volume 1981","DOI":"10.1145/800276.810991","event-place":"Ann Arbor, MI","ISBN":"978-0-89791-064-4","issued":{"date-parts":[[1981,5,21]]},"page":"143","publisher":"Association for Computing Machinery","publisher-place":"Ann Arbor, MI","source":"ACM Digital Library","title":"Direct manipulation: A step beyond programming languages (abstract only)","title-short":"Direct manipulation","type":"paper-conference","URL":"https://doi.org/10.1145/800276.810991"},
  {"id":"shneidermanHumanCenteredArtificialIntelligence2020","abstract":"Well-designed technologies that offer high levels of human control and high levels of computer automation can increase human performance, leading to wider adoption. The Human-Centered Artificial Intelligence (HCAI) framework clarifies how to (1) design for high levels of human control and high levels of computer automation so as to increase human performance, (2) understand the situations in which full human control or full computer control are necessary, and (3) avoid the dangers of excessive human control or excessive computer control. The methods of HCAI are more likely to produce designs that are Reliable, Safe & Trustworthy (RST). Achieving these goals will dramatically increase human performance, while supporting human self-efficacy, mastery, creativity, and responsibility.","accessed":{"date-parts":[[2020,10,14]]},"author":[{"family":"Shneiderman","given":"Ben"}],"container-title":"International Journal of Human–Computer Interaction","DOI":"10.1080/10447318.2020.1741118","ISSN":"1044-7318","issue":"6","issued":{"date-parts":[[2020,4,2]]},"note":"_eprint: https://doi.org/10.1080/10447318.2020.1741118","page":"495-504","publisher":"Taylor & Francis","source":"Taylor and Francis+NEJM","title":"Human-Centered Artificial Intelligence: Reliable, Safe & Trustworthy","title-short":"Human-Centered Artificial Intelligence","type":"article-journal","URL":"https://doi.org/10.1080/10447318.2020.1741118","volume":"36"},
  {"id":"ShortGuideManaging","abstract":"A 63 page guide exploring our daily struggle to fit meaningful activities into our increasingly hectic days.","accessed":{"date-parts":[[2020,7,17]]},"source":"www.rescuetime.com","title":"A Short Guide To Managing Your Time And Fitting More Into Every Day","type":"book","URL":"https://www.rescuetime.com/guides/time-management"},
  {"id":"sinskyAllocationPhysicianTime2016","abstract":"Background: Little is known about how physician time is allocated in ambulatory care.\nObjective: To describe how physician time is spent in ambulatory practice.\nDesign: Quantitative direct observational time and motion study (during office hours) and self-reported diary (after hours).\nSetting: U.S. ambulatory care in 4 specialties in 4 states (Illinois, New Hampshire, Virginia, and Washington).\nParticipants: 57 U.S. physicians in family medicine, internal medicine, cardiology, and orthopedics who were observed for 430 hours, 21 of whom also completed after-hours diaries.\nMeasurements: Proportions of time spent on 4 activities (direct clinical face time, electronic health record [EHR] and desk work, administrative tasks, and other tasks) and self-reported after-hours work.\nResults: During the office day, physicians spent 27.0% of their total time on direct clinical face time with patients and 49.2% of their time on EHR and desk work. While in the examination room with patients, physicians spent 52.9% of the time on direct clinical face time and 37.0% on EHR and desk work. The 21 physicians who completed after-hours diaries reported 1 to 2 hours of after-hours work each night, devoted mostly to EHR tasks.\nLimitations: Data were gathered in self-selected, high-performing practices and may not be generalizable to other settings. The descriptive study design did not support formal statistical comparisons by physician and practice characteristics.\nConclusion: For every hour physicians provide direct clinical face time to patients, nearly 2 additional hours is spent on EHR and desk work within the clinic day. Outside office hours, physicians spend another 1 to 2 hours of personal time each night doing additional computer and other clerical work.\nPrimary Funding Source: American Medical Association.","author":[{"family":"Sinsky","given":"Christine"},{"family":"Colligan","given":"Lacey"},{"family":"Li","given":"Ling"},{"family":"Prgomet","given":"Mirela"},{"family":"Reynolds","given":"Sam"},{"family":"Goeders","given":"Lindsey"},{"family":"Westbrook","given":"Johanna"},{"family":"Tutty","given":"Michael"},{"family":"Blike","given":"George"}],"container-title":"Annals of Internal Medicine","container-title-short":"Ann. Intern. Med.","DOI":"10.7326/M16-0961","ISSN":"1539-3704","issue":"11","issued":{"date-parts":[[2016,12,6]]},"language":"eng","page":"753-760","PMID":"27595430","source":"PubMed","title":"Allocation of Physician Time in Ambulatory Practice: A Time and Motion Study in 4 Specialties","title-short":"Allocation of Physician Time in Ambulatory Practice","type":"article-journal","volume":"165"},
  {"id":"spannagelAnimatedDemonstrationsTraining2008","abstract":"Learning how to use a new software program can be a difficult and demanding task, especially for novices. There are several types of support for users exploring a software package. Animated demonstrations show how experts use an application, and training wheels interfaces offer a secure environment for exploration. To support different types of learners, external help should be adapted according to learner characteristics. The study presented in this article investigates effects of different support types in combination with the computer self-efficacy of learners. Young students (8th graders) were supported with text manuals, animated demonstrations, or animated demonstrations combined with a training wheels interface. In this context, they had to solve problems in physics and mathematics with a spreadsheet program. Results showed that animated demonstrations outperformed text manuals in many cases. Training wheels interfaces seemed to have disadvantages compared to unmodified user interfaces. In addition, motivational aspects have been investigated. Subjects with high computer self-efficacy scores were more motivated than their counterparts. Statistics (analysis of variance) revealed no interaction effects between the treatment and computer self-efficacy.","accessed":{"date-parts":[[2020,6,15]]},"author":[{"family":"Spannagel","given":"Christian"},{"family":"Girwidz","given":"Raimund"},{"family":"Löthe","given":"Herbert"},{"family":"Zendler","given":"Andreas"},{"family":"Schroeder","given":"Ulrik"}],"container-title":"Interacting with Computers","container-title-short":"Interact. Comput.","DOI":"10.1016/j.intcom.2007.08.002","ISSN":"0953-5438","issue":"1","issued":{"date-parts":[[2008,1,1]]},"page":"97–111","source":"January, 2008","title":"Animated demonstrations and training wheels interfaces in a complex learning environment","type":"article-journal","URL":"https://doi.org/10.1016/j.intcom.2007.08.002","volume":"20"},
  {"id":"sparrowGoogleEffectsMemory2011","abstract":"The advent of the Internet, with sophisticated algorithmic search engines, has made accessing information as easy as lifting a finger. No longer do we have to make costly efforts to find the things we want. We can \"Google\" the old classmate, find articles online, or look up the actor who was on the tip of our tongue. The results of four studies suggest that when faced with difficult questions, people are primed to think about computers and that when people expect to have future access to information, they have lower rates of recall of the information itself and enhanced recall instead for where to access it. The Internet has become a primary form of external or transactive memory, where information is stored collectively outside ourselves.","author":[{"family":"Sparrow","given":"Betsy"},{"family":"Liu","given":"Jenny"},{"family":"Wegner","given":"Daniel M."}],"container-title":"Science (New York, N.Y.)","container-title-short":"Science","DOI":"10.1126/science.1207745","ISSN":"1095-9203","issue":"6043","issued":{"date-parts":[[2011,8,5]]},"language":"eng","page":"776-778","PMID":"21764755","source":"PubMed","title":"Google effects on memory: cognitive consequences of having information at our fingertips","title-short":"Google effects on memory","type":"article-journal","volume":"333"},
  {"id":"starrenObjectorientedTaxonomyMedical2000","abstract":"Abstract.  A variety of methods have been proposed for presenting medical data visually on computers. Discussion of and comparison among these methods have been","accessed":{"date-parts":[[2020,8,5]]},"author":[{"family":"Starren","given":"Justin"},{"family":"Johnson","given":"Stephen B."}],"container-title":"Journal of the American Medical Informatics Association","container-title-short":"J Am Med Inform Assoc","DOI":"10.1136/jamia.2000.0070001","ISSN":"1067-5027","issue":"1","issued":{"date-parts":[[2000,1,1]]},"language":"en","page":"1-20","publisher":"Oxford Academic","source":"academic.oup.com","title":"An Object-oriented Taxonomy of Medical Data Presentations","type":"article-journal","URL":"https://academic.oup.com/jamia/article/7/1/1/687141","volume":"7"},
  {"id":"stevensTheoryScalesMeasurement1946","accessed":{"date-parts":[[2020,8,5]]},"archive":"JSTOR","author":[{"family":"Stevens","given":"S. S."}],"container-title":"Science","ISSN":"0036-8075","issue":"2684","issued":{"date-parts":[[1946]]},"page":"677-680","publisher":"American Association for the Advancement of Science","source":"JSTOR","title":"On the Theory of Scales of Measurement","type":"article-journal","URL":"https://www.jstor.org/stable/1671815","volume":"103"},
  {"id":"subramonyamTexSketchActiveDiagramming2020","abstract":"Learning from text is a constructive activity in which sentencelevel information is combined by the reader to build coherent mental models. With increasingly complex texts, forming a mental model becomes challenging due to a lack of background knowledge, and limits in working memory and attention. To address this, we are taught knowledge externalization strategies such as active reading and diagramming. Unfortunately, paper-and-pencil approaches may not always be appropriate, and software solutions create friction through difﬁcult input modalities, limited workﬂow support, and barriers between reading and diagramming. For all but the simplest text, building coherent diagrams can be tedious and difﬁcult. We propose Active Diagramming, an approach extending familiar active reading strategies to the task of diagram construction. Our prototype, texSketch, combines pen-and-ink interactions with natural language processing to reduce the cost of producing diagrams while maintaining the cognitive effort necessary for comprehension. Our user study ﬁnds that readers can effectively create diagrams without disrupting reading.","accessed":{"date-parts":[[2021,2,4]]},"author":[{"family":"Subramonyam","given":"Hariharan"},{"family":"Seifert","given":"Colleen"},{"family":"Shah","given":"Priti"},{"family":"Adar","given":"Eytan"}],"container-title":"Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems","DOI":"10.1145/3313831.3376155","event":"CHI '20: CHI Conference on Human Factors in Computing Systems","event-place":"Honolulu HI USA","ISBN":"978-1-4503-6708-0","issued":{"date-parts":[[2020,4,21]]},"language":"en","page":"1-13","publisher":"ACM","publisher-place":"Honolulu HI USA","source":"DOI.org (Crossref)","title":"texSketch: Active Diagramming through Pen-and-Ink Annotations","title-short":"texSketch","type":"paper-conference","URL":"https://dl.acm.org/doi/10.1145/3313831.3376155"},
  {"id":"sukaviriyaAutomaticGenerationTextual1994","accessed":{"date-parts":[[2020,6,17]]},"author":[{"family":"Sukaviriya","given":"Piyawadee Noi"},{"family":"Muthukumarasamy","given":"Jeyakumar"},{"family":"Spaans","given":"Anton"},{"family":"Graaff","given":"Hans J. J.","non-dropping-particle":"de"}],"container-title":"Proceedings of the workshop on Advanced visual interfaces  - AVI '94","DOI":"10.1145/192309.192322","event":"the workshop","event-place":"Bari, Italy","ISBN":"978-0-89791-733-9","issued":{"date-parts":[[1994]]},"language":"en","page":"44-52","publisher":"ACM Press","publisher-place":"Bari, Italy","source":"DOI.org (Crossref)","title":"Automatic generation of textual, audio, and animated help in UIDE: the User Interface Design","title-short":"Automatic generation of textual, audio, and animated help in UIDE","type":"paper-conference","URL":"http://portal.acm.org/citation.cfm?doid=192309.192322"},
  {"id":"sukaviriyaCouplingUIFramework1990","abstract":"Animated help can assistusersin understanding how to usecomputer application interfaces. An animated help facility integrated into a runtime user interface support tool requires information pertaining to user interfaces, the applications being supported, the relationships between interface and application and precise detailed information sufficient for accurate illustrations of interface components. This paper presentsaknowledge model developed to support suchananimated help facility. Continuing our research efforts towards automatic generation of user interfaces from specifications, a framework has been developed to utilize oneknowledge model to automatically generateanimated help at runtime and to assist the management of user interfaces. Cartoonist is a system implemented basedon the framework.","accessed":{"date-parts":[[2020,6,17]]},"author":[{"family":"Sukaviriya","given":"Piyawadee"},{"family":"Foley","given":"James D."}],"container-title":"Proceedings of the 3rd annual ACM SIGGRAPH symposium on User interface software and technology  - UIST '90","DOI":"10.1145/97924.97942","event":"the 3rd annual ACM SIGGRAPH symposium","event-place":"Snowbird, Utah, United States","ISBN":"978-0-89791-410-9","issued":{"date-parts":[[1990]]},"language":"en","page":"152-166","publisher":"ACM Press","publisher-place":"Snowbird, Utah, United States","source":"DOI.org (Crossref)","title":"Coupling a UI framework with automatic generation of context-sensitive animated help","type":"paper-conference","URL":"http://portal.acm.org/citation.cfm?doid=97924.97942"},
  {"id":"sukaviriyaMultimediaHelpPrototype1992","accessed":{"date-parts":[[2020,6,15]]},"author":[{"family":"Sukaviriya","given":"Piyawadee"},{"family":"Isaacs","given":"Ellen"},{"family":"Bharat","given":"Krishna"}],"collection-title":"CHI '92","container-title":"Proceedings of the SIGCHI Conference on Human Factors in Computing Systems","DOI":"10.1145/142750.142889","event-place":"Monterey, California, USA","ISBN":"978-0-89791-513-7","issued":{"date-parts":[[1992,6,1]]},"page":"433–434","publisher":"Association for Computing Machinery","publisher-place":"Monterey, California, USA","source":"ACM Digital Library","title":"Multimedia help: a prototype and an experiment","title-short":"Multimedia help","type":"paper-conference","URL":"https://doi.org/10.1145/142750.142889"},
  {"id":"suVisualizingEditingInferring","abstract":"Vector graphics software provides powerful tools for specifying the hierarchical structure of objects in an illustration document. This structure is useful for future editing, but building it explicitly (e.g. by grouping and ordering objects) is a tedious process for the user. We seek methods for inferring structure in a document and exploiting it. We tackle three key problems: First, we introduce a storyboard visualization that enables non-sequential browsing and manipulation of graphical editing history, that is, the actions used to create an illustration. Second, we discuss using this history to infer structure. Finally, we discuss methods for using this structure to explore the design space of vector graphics. Our broad aim is to help users take fuller advantage of illustration on the computer by introducing methods to visualize, manipulate, and explore alternative versions of their designs. ACM Classification: H5.2 [Information interfaces and presentation]:","author":[{"family":"Su","given":"Sara L."}],"source":"CiteSeer","title":"Visualizing, Editing, and Inferring Structure in 2D Graphics","type":"book"},
  {"id":"tai-sealeElectronicHealthRecord2017","abstract":"Time spent by physicians is a key resource in health care delivery. This study used data captured by the access time stamp functionality of an electronic health record (EHR) to examine physician work effort. This is a potentially powerful, yet unobtrusive, way to study physicians' use of time. We used data on physicians' time allocation patterns captured by over thirty-one million EHR transactions in the period 2011-14 recorded by 471 primary care physicians, who collectively worked on 765,129 patients' EHRs. Our results suggest that the physicians logged an average of 3.08 hours on office visits and 3.17 hours on desktop medicine each day. Desktop medicine consists of activities such as communicating with patients through a secure patient portal, responding to patients' online requests for prescription refills or medical advice, ordering tests, sending staff messages, and reviewing test results. Over time, log records from physicians showed a decline in the time allocated to face-to-face visits, accompanied by an increase in time allocated to desktop medicine. Staffing and scheduling in the physician's office, as well as provider payment models for primary care practice, should account for these desktop medicine efforts.","author":[{"family":"Tai-Seale","given":"Ming"},{"family":"Olson","given":"Cliff W."},{"family":"Li","given":"Jinnan"},{"family":"Chan","given":"Albert S."},{"family":"Morikawa","given":"Criss"},{"family":"Durbin","given":"Meg"},{"family":"Wang","given":"Wei"},{"family":"Luft","given":"Harold S."}],"container-title":"Health Affairs (Project Hope)","container-title-short":"Health Aff (Millwood)","DOI":"10.1377/hlthaff.2016.0811","ISSN":"1544-5208","issue":"4","issued":{"date-parts":[[2017,4,1]]},"language":"eng","page":"655-662","PMCID":"PMC5546411","PMID":"28373331","source":"PubMed","title":"Electronic Health Record Logs Indicate That Physicians Split Time Evenly Between Seeing Patients And Desktop Medicine","type":"article-journal","volume":"36"},
  {"id":"tenneyLanguageInterpretabilityTool2020","abstract":"We present the Language Interpretability Tool (LIT), an open-source platform for visualization and understanding of NLP models. We focus on core questions about model behavior: Why did my model make this prediction? When does it perform poorly? What happens under a controlled change in the input? LIT integrates local explanations, aggregate analysis, and counterfactual generation into a streamlined, browser-based interface to enable rapid exploration and error analysis. We include case studies for a diverse set of workflows, including exploring counterfactuals for sentiment analysis, measuring gender bias in coreference systems, and exploring local behavior in text generation. LIT supports a wide range of models--including classification, seq2seq, and structured prediction--and is highly extensible through a declarative, framework-agnostic API. LIT is under active development, with code and full documentation available at https://github.com/pair-code/lit.","accessed":{"date-parts":[[2020,9,18]]},"author":[{"family":"Tenney","given":"Ian"},{"family":"Wexler","given":"James"},{"family":"Bastings","given":"Jasmijn"},{"family":"Bolukbasi","given":"Tolga"},{"family":"Coenen","given":"Andy"},{"family":"Gehrmann","given":"Sebastian"},{"family":"Jiang","given":"Ellen"},{"family":"Pushkarna","given":"Mahima"},{"family":"Radebaugh","given":"Carey"},{"family":"Reif","given":"Emily"},{"family":"Yuan","given":"Ann"}],"container-title":"arXiv:2008.05122 [cs]","issued":{"date-parts":[[2020,8,12]]},"source":"arXiv.org","title":"The Language Interpretability Tool: Extensible, Interactive Visualizations and Analysis for NLP Models","title-short":"The Language Interpretability Tool","type":"article-journal","URL":"http://arxiv.org/abs/2008.05122"},
  {"id":"thelma.allennist.govHealthITUsability2017","abstract":"Usability is \"the extent to which a product can be used by specified users to achieve specified goals with effectiveness, efficiency and satisfaction in a specified context of use\" [ISO9241]. Usability represents an important yet often overlooked factor impacting the adoption and meaningful use of electronic health record (EHR) systems. Without usable systems, doctors, medical technicians, nurses, administrative staff, consumers, and other users cannot gain the potential benefits of features and functions of EHR systems.<RETURN TO THE HEALTH INFORMATION TECHNOLOGY (IT) HOME PAGE>","accessed":{"date-parts":[[2020,8,13]]},"author":[{"family":"thelma.allen@nist.gov","given":""}],"container-title":"NIST","genre":"text","issued":{"date-parts":[[2017,1,27]]},"language":"en","note":"Last Modified: 2017-08-09T14:09-04:00","title":"Health IT Usability","type":"webpage","URL":"https://www.nist.gov/programs-projects/health-it-usability"},
  {"id":"timesCoronavirusLatestMap","abstract":"A detailed county map shows the extent of the coronavirus outbreak, with tables of the number of cases by county.","accessed":{"date-parts":[[2020,6,26]]},"author":[{"family":"Times","given":"The New York"}],"container-title":"The New York Times","ISSN":"0362-4331","language":"en-US","section":"U.S.","source":"NYTimes.com","title":"Coronavirus in the U.S.: Latest Map and Case Count","title-short":"Coronavirus in the U.S.","type":"article-newspaper","URL":"https://www.nytimes.com/interactive/2020/us/coronavirus-us-cases.html"},
  {"id":"tuttyComplexCaseEHRs2019","abstract":"Abstract.  Physicians can spend more time completing administrative tasks in their electronic health record (EHR) than engaging in direct face time with patient","accessed":{"date-parts":[[2020,8,5]]},"author":[{"family":"Tutty","given":"Michael A."},{"family":"Carlasare","given":"Lindsey E."},{"family":"Lloyd","given":"Stacy"},{"family":"Sinsky","given":"Christine A."}],"container-title":"Journal of the American Medical Informatics Association","container-title-short":"J Am Med Inform Assoc","DOI":"10.1093/jamia/ocz021","issue":"7","issued":{"date-parts":[[2019,7,1]]},"language":"en","page":"673-677","publisher":"Oxford Academic","source":"academic.oup.com","title":"The complex case of EHRs: examining the factors impacting the EHR user experience","title-short":"The complex case of EHRs","type":"article-journal","URL":"https://academic.oup.com/jamia/article/26/7/673/5426085","volume":"26"},
  {"id":"tverskyJudgmentUncertaintyHeuristics1974","accessed":{"date-parts":[[2020,9,2]]},"archive":"JSTOR","author":[{"family":"Tversky","given":"Amos"},{"family":"Kahneman","given":"Daniel"}],"container-title":"Science","ISSN":"0036-8075","issue":"4157","issued":{"date-parts":[[1974]]},"page":"1124-1131","publisher":"American Association for the Advancement of Science","source":"JSTOR","title":"Judgment under Uncertainty: Heuristics and Biases","title-short":"Judgment under Uncertainty","type":"article-journal","URL":"http://www.jstor.org/stable/1738360","volume":"185"},
  {"id":"vawdreyAssessingUsagePatterns2008","abstract":"Many vendors of electronic medical records support structured and free-text entry of clinical documents using configurable templates. At a healthcare institution comprising two large academic medical centers, a documentation management data mart and a custom, Web-accessible business intelligence application were developed to track the availability and usage of electronic documentation templates. For each medical center campus, template availability and usage trends were measured from November 2007 through February 2008. By February 2008, approximately 65,000 electronic notes were authored per week on the two campuses. One site had 934 available templates, with 313 being used to author at least one note. The other site had 765 templates, of which 480 were used. The most commonly used template at both campuses was a free text note called “Miscellaneous Nursing Note,” which accounted for 33.3% of total documents generated at one campus and 15.2% at the other.","accessed":{"date-parts":[[2020,8,5]]},"author":[{"family":"Vawdrey","given":"David K."}],"container-title":"AMIA Annual Symposium Proceedings","container-title-short":"AMIA Annu Symp Proc","ISSN":"1942-597X","issued":{"date-parts":[[2008]]},"page":"758-762","PMCID":"PMC2656104","PMID":"18998863","source":"PubMed Central","title":"Assessing Usage Patterns of Electronic Clinical Documentation Templates","type":"article-journal","URL":"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2656104/","volume":"2008"},
  {"id":"viitanenNationalQuestionnaireStudy2011","abstract":"Objective\nIn the health informatics field, usability studies typically focus on evaluating a single information system and involve a rather small group of end-users. However, little is known about the usability of clinical information and communication technology (ICT) environment in which healthcare professionals work daily. This paper aims at contributing to usability research and user-oriented development of healthcare technologies with three objectives: inform researchers and practitioners about the current state of usability of clinical ICT systems, increase the understanding of usability aspects specific for clinical context, and encourage a more holistic approach on studying usability issues in health informatics field.\nMethods\nA national web questionnaire study was conducted in Finland in spring 2010 with 3929 physicians actively working in patient care. For the purposes of the study, we described three dimensions of clinical ICT system usability that reflect the physicians’ viewpoint on system usage: (1) compatibility between clinical ICT systems and physicians’ tasks, (2) ICT support for information exchange, communication and collaboration in clinical work, and (3) interoperability and reliability. The dimensions derive from the definitions of usability and clinical context of use analysis, and reflect the ability of ICT systems to have a positive impact on patient care by supporting physicians in achieving their goals with a pleasant user experience. The research data incorporated 32 statements with a five-point Likert-scale on physicians’ experiences on usability of their currently used ICT systems and a summative question about school grade given to electronic health record (EHR) systems.\nResults\nPhysicians’ estimates of their EHR systems were very critical. With the rating scale from 4 or fail to 10 or excellent, the average of the grades varied from 6.1 to 8.4 dependent on the kind of facility the physician is working. Questionnaire results indicated several usability problems and deficiencies which considerably hindered the efficiency of clinical ICT use and physician's routine work. Systems lacked the appropriate features to support typical clinical tasks, such as decision making, prevention of medical errors, and review of a patient's treatment chart. The systems also required physicians to perform fixed sequences of steps and tasks, and poorly supported the documentation and retrieval of patient data. The findings on ICT support for collaboration showed mainly negative results, aside from collaboration between co-located physicians. In addition, the study results pointed out physicians suffering from system failures and a lack of integration between the systems.\nConclusions\nThe described study and related results are unique in several ways. A national usability study with nearly 4000 respondents had not been conducted in other countries in which healthcare technologies are widely adopted. The questionnaire study provided a generalized picture about the usability problems, however, it should be noted that there were significant differences between legacy systems in use. Previously, researchers had not approached contextual aspects of usability the context of clinical work, where numerous systems are in use. The described usability dimensions and the presented study results can be considered as the first step towards conceptualizing ICT usability in the unique setting of clinical work.","accessed":{"date-parts":[[2020,8,4]]},"author":[{"family":"Viitanen","given":"Johanna"},{"family":"Hyppönen","given":"Hannele"},{"family":"Lääveri","given":"Tinja"},{"family":"Vänskä","given":"Jukka"},{"family":"Reponen","given":"Jarmo"},{"family":"Winblad","given":"Ilkka"}],"container-title":"International Journal of Medical Informatics","container-title-short":"International Journal of Medical Informatics","DOI":"10.1016/j.ijmedinf.2011.06.010","ISSN":"1386-5056","issue":"10","issued":{"date-parts":[[2011,10,1]]},"language":"en","page":"708-725","source":"ScienceDirect","title":"National questionnaire study on clinical ICT systems proofs: Physicians suffer from poor usability","title-short":"National questionnaire study on clinical ICT systems proofs","type":"article-journal","URL":"http://www.sciencedirect.com/science/article/pii/S1386505611001481","volume":"80"},
  {"id":"wangMismatchExpectationsHow2018","abstract":"Conversational programmers represent a class of learners who are not required to write any code, yet try to learn programming to improve their participation in technical conversations. We carried out interviews with 23 conversational programmers to better understand the challenges they face in technical conversations, what resources they choose to learn programming, how they perceive the learning process, and to what extent learning programming actually helps them. Among our key findings, we found that conversational programmers often did not know where to even begin the learning process and ended up using formal and informal learning resources that focus largely on programming syntax and logic. However, since the end goal of conversational programmers was not to build artifacts, modern learning resources usually failed these learners in their pursuits of improving their technical conversations. Our findings point to design opportunities in HCI to invent learnercentered approaches that address the needs of conversational programmers and help them establish common ground in technical conversations.","accessed":{"date-parts":[[2020,6,1]]},"author":[{"family":"Wang","given":"April Y."},{"family":"Mitts","given":"Ryan"},{"family":"Guo","given":"Philip J."},{"family":"Chilana","given":"Parmit K."}],"container-title":"Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems  - CHI '18","DOI":"10.1145/3173574.3174085","event":"the 2018 CHI Conference","event-place":"Montreal QC, Canada","ISBN":"978-1-4503-5620-6","issued":{"date-parts":[[2018]]},"language":"en","page":"1-13","publisher":"ACM Press","publisher-place":"Montreal QC, Canada","source":"DOI.org (Crossref)","title":"Mismatch of Expectations: How Modern Learning Resources Fail Conversational Programmers","title-short":"Mismatch of Expectations","type":"paper-conference","URL":"http://dl.acm.org/citation.cfm?doid=3173574.3174085"},
  {"id":"wangVisualInformationSeeking","abstract":"In the advent of electronic health record (EHR) systems, physicians and clinical researchers enjoy the ease of storage, retrieval, persistence, and sharing of patient data. However, the way physicians interact with EHRs has not changed much. More speciﬁcally, task support for temporally analyzing large number of EHRs has been lacking. A number of information visualization techniques have been proposed to alleviate this problem. Unfortunately, due to their limited application to a single case study, the results are often diﬃcult to generalize across medical scenarios. In this paper we present the usage data of and user comments on our information visualization tool Lifelines2 through eight diﬀerent medical case studies. We generalize our experience into an information- seeking process model for multiple EHRs. Base on our analysis, we make recommendations to future information visualization designers for EHRs on common design requirements and future research directions.","author":[{"family":"Wang","given":"Taowei David"},{"family":"Plaisant","given":"Catherine"},{"family":"Shneiderman","given":"Ben"}],"language":"en","page":"11","source":"Zotero","title":"Visual Information Seeking in Multiple Electronic Health Records: Design Recommendations and A Process Model","type":"article-journal"},
  {"id":"weldChallengeCraftingIntelligible2018","abstract":"Since Artificial Intelligence (AI) software uses techniques like deep lookahead search and stochastic optimization of huge neural networks to fit mammoth datasets, it often results in complex behavior that is difficult for people to understand. Yet organizations are deploying AI algorithms in many mission-critical settings. To trust their behavior, we must make AI intelligible, either by using inherently interpretable models or by developing new methods for explaining and controlling otherwise overwhelmingly complex decisions using local approximation, vocabulary alignment, and interactive explanation. This paper argues that intelligibility is essential, surveys recent work on building such systems, and highlights key directions for research.","accessed":{"date-parts":[[2020,9,18]]},"author":[{"family":"Weld","given":"Daniel S."},{"family":"Bansal","given":"Gagan"}],"container-title":"arXiv:1803.04263 [cs]","issued":{"date-parts":[[2018,10,15]]},"source":"arXiv.org","title":"The Challenge of Crafting Intelligible Intelligence","type":"article-journal","URL":"http://arxiv.org/abs/1803.04263"},
  {"id":"westAssociationPerceivedMedical2006","abstract":"CONTEXT: Medical errors are associated with feelings of distress in physicians, but little is known about the magnitude and direction of these associations.\nOBJECTIVE: To assess the frequency of self-perceived medical errors among resident physicians and to determine the association of self-perceived medical errors with resident quality of life, burnout, depression, and empathy using validated metrics.\nDESIGN, SETTING, AND PARTICIPANTS: Prospective longitudinal cohort study of categorical and preliminary internal medicine residents at Mayo Clinic Rochester. Data were provided by 184 (84%) of 219 eligible residents. Participants began training in the 2003-2004, 2004-2005, and 2005-2006 academic years and completed surveys quarterly through May 2006. Surveys included self-assessment of medical errors and linear analog scale assessment of quality of life every 3 months, and the Maslach Burnout Inventory (depersonalization, emotional exhaustion, and personal accomplishment), Interpersonal Reactivity Index, and a validated depression screening tool every 6 months.\nMAIN OUTCOME MEASURES: Frequency of self-perceived medical errors was recorded. Associations of an error with quality of life, burnout, empathy, and symptoms of depression were determined using generalized estimating equations for repeated measures.\nRESULTS: Thirty-four percent of participants reported making at least 1 major medical error during the study period. Making a medical error in the previous 3 months was reported by a mean of 14.7% of participants at each quarter. Self-perceived medical errors were associated with a subsequent decrease in quality of life (P = .02) and worsened measures in all domains of burnout (P = .002 for each). Self-perceived errors were associated with an odds ratio of screening positive for depression at the subsequent time point of 3.29 (95% confidence interval, 1.90-5.64). In addition, increased burnout in all domains and reduced empathy were associated with increased odds of self-perceived error in the following 3 months (P=.001, P<.001, and P=.02 for depersonalization, emotional exhaustion, and lower personal accomplishment, respectively; P=.02 and P=.01 for emotive and cognitive empathy, respectively).\nCONCLUSIONS: Self-perceived medical errors are common among internal medicine residents and are associated with substantial subsequent personal distress. Personal distress and decreased empathy are also associated with increased odds of future self-perceived errors, suggesting that perceived errors and distress may be related in a reciprocal cycle.","author":[{"family":"West","given":"Colin P."},{"family":"Huschka","given":"Mashele M."},{"family":"Novotny","given":"Paul J."},{"family":"Sloan","given":"Jeff A."},{"family":"Kolars","given":"Joseph C."},{"family":"Habermann","given":"Thomas M."},{"family":"Shanafelt","given":"Tait D."}],"container-title":"JAMA","container-title-short":"JAMA","DOI":"10.1001/jama.296.9.1071","ISSN":"1538-3598","issue":"9","issued":{"date-parts":[[2006,9,6]]},"language":"eng","page":"1071-1078","PMID":"16954486","source":"PubMed","title":"Association of perceived medical errors with resident distress and empathy: a prospective longitudinal study","title-short":"Association of perceived medical errors with resident distress and empathy","type":"article-journal","volume":"296"},
  {"id":"williamsRoleExplanationDiscovery2010","abstract":"Research in education and cognitive development suggests that explaining plays a key role in learning and generalization: When learners provide explanations—even to themselves—they learn more effectively and generalize more readily to novel situations. This paper proposes and tests a subsumptive constraints account of this effect. Motivated by philosophical theories of explanation, this account predicts that explaining guides learners to interpret what they are learning in terms of unifying patterns or regularities, which promotes the discovery of broad generalizations. Three experiments provide evidence for the subsumptive constraints account: prompting participants to explain while learning artificial categories promotes the induction of a broad generalization underlying category membership, relative to describing items (Exp. 1), thinking aloud (Exp. 2), or free study (Exp. 3). Although explaining facilitates discovery, Experiment 1 finds that description is more beneficial for learning item details. Experiment 2 additionally suggests that explaining anomalous observations may play a special role in belief revision. The findings provide insight into explanation’s role in discovery and generalization.","accessed":{"date-parts":[[2020,8,24]]},"author":[{"family":"Williams","given":"Joseph J."},{"family":"Lombrozo","given":"Tania"}],"container-title":"Cognitive Science","DOI":"10.1111/j.1551-6709.2010.01113.x","ISSN":"1551-6709","issue":"5","issued":{"date-parts":[[2010]]},"language":"en","note":"_eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1551-6709.2010.01113.x","page":"776-806","source":"Wiley Online Library","title":"The Role of Explanation in Discovery and Generalization: Evidence From Category Learning","title-short":"The Role of Explanation in Discovery and Generalization","type":"article-journal","URL":"https://onlinelibrary.wiley.com/doi/abs/10.1111/j.1551-6709.2010.01113.x","volume":"34"},
  {"id":"williamsWhyDoesExplaining","abstract":"Engaging in explanation, even to oneself, can enhance learning. What underlies this effect? Williams & Lombrozo (in press) propose that explanation exerts subsumptive constraints on processing, driving learners to discover underlying patterns. A category-learning experiment demonstrates that explanation can enhance or impair learning depending on whether these constraints match the structure of the material being learned. Explaining can help learning when reliable patterns are present, but actually impairs learning when patterns are misleading. This explanation impairment effect is predicted by the subsumptive constraints account, but challenges alternative hypotheses according to which explaining helps learning by increasing task engagement through motivation, attention, or processing time. The findings have both theoretical and practical implications for learning and education.","author":[{"family":"Williams","given":"Joseph Jay"},{"family":"Lombrozo","given":"Tania"},{"family":"Rehder","given":"Bob"}],"language":"en","page":"6","source":"Zotero","title":"Why does explaining help learning? Insight from an explanation impairment effect","type":"article-journal"},
  {"id":"yehCreatingContextualHelp2011","abstract":"Contextual help is effective for learning how to use GUIs by showing instructions and highlights on the actual interface rather than in a separate viewer. However, end-users and third-party tech support typically cannot create contextual help to assist other users because it requires programming skill and source code access. We present a creation tool for contextual help that allows users to apply common computer skills-taking screenshots and writing simple scripts. We perform pixel analysis on screenshots to make this tool applicable to a wide range of applications and platforms without source code access. We evaluated the tool's usability with three groups of participants: developers, in-structors, and tech support. We further validated the applicability of our tool with 60 real tasks supported by the tech support of a university campus.","accessed":{"date-parts":[[2020,6,15]]},"author":[{"family":"Yeh","given":"Tom"},{"family":"Chang","given":"Tsung-Hsiang"},{"family":"Xie","given":"Bo"},{"family":"Walsh","given":"Greg"},{"family":"Watkins","given":"Ivan"},{"family":"Wongsuphasawat","given":"Krist"},{"family":"Huang","given":"Man"},{"family":"Davis","given":"Larry S."},{"family":"Bederson","given":"Benjamin B."}],"collection-title":"UIST '11","container-title":"Proceedings of the 24th annual ACM symposium on User interface software and technology","DOI":"10.1145/2047196.2047214","event-place":"Santa Barbara, California, USA","ISBN":"978-1-4503-0716-1","issued":{"date-parts":[[2011,10,16]]},"page":"145–154","publisher":"Association for Computing Machinery","publisher-place":"Santa Barbara, California, USA","source":"ACM Digital Library","title":"Creating contextual help for GUIs using screenshots","type":"paper-conference","URL":"https://doi.org/10.1145/2047196.2047214"},
  {"id":"yehSikuliUsingGUI2009","abstract":"We present Sikuli, a visual approach to search and automation of graphical user interfaces using screenshots. Sikuli allows users to take a screenshot of a GUI element (such as a toolbar button, icon, or dialog box) and query a help system using the screenshot instead of WKH  HOHPHQW¶V  name. Sikuli also provides a visual scripting API for automating GUI interactions, using screenshot patterns to direct mouse and keyboard events. We report a web-based user study showing that searching by screenshot is easy to learn and faster to specify than keywords. We also demonstrate several automation tasks suitable for visual scripting, such as map navigation and bus tracking, and show how visual scripting can improve interactive help systems previously proposed in the literature.","accessed":{"date-parts":[[2020,6,3]]},"author":[{"family":"Yeh","given":"Tom"},{"family":"Chang","given":"Tsung-Hsiang"},{"family":"Miller","given":"Robert C."}],"container-title":"Proceedings of the 22nd annual ACM symposium on User interface software and technology - UIST '09","DOI":"10.1145/1622176.1622213","event":"the 22nd annual ACM symposium","event-place":"Victoria, BC, Canada","ISBN":"978-1-60558-745-5","issued":{"date-parts":[[2009]]},"language":"en","page":"183","publisher":"ACM Press","publisher-place":"Victoria, BC, Canada","source":"DOI.org (Crossref)","title":"Sikuli: using GUI screenshots for search and automation","title-short":"Sikuli","type":"paper-conference","URL":"http://portal.acm.org/citation.cfm?doid=1622176.1622213"},
  {"id":"yuanIntroducingMercuryOS2019","abstract":"A speculative vision of the operating system, driven by humane design principles.","accessed":{"date-parts":[[2020,7,27]]},"author":[{"family":"Yuan","given":"Jason"}],"container-title":"Medium","issued":{"date-parts":[[2019,12,14]]},"language":"en","source":"uxdesign.cc","title":"Introducing Mercury OS","type":"webpage","URL":"https://uxdesign.cc/introducing-mercury-os-f4de45a04289"},
  {"id":"zeleznikLineogrammerCreatingDiagrams2008","abstract":"We present the design of Lineogrammer, a diagram-drawing system motivated by the immediacy and fluidity of pencil-drawing. We attempted for Lineogrammer to feel like a modeless diagramming \"medium\" in which stylus input is immediately interpreted as a command, text label or a drawing element, and drawing elements snap to or sculpt from existing elements. An inferred dual representation allows geometric diagram elements, no matter how they were entered, to be manipulated at granularities ranging from vertices to lines to shapes. We also integrate lightweight tools, based on rulers and construction lines, for controlling higher-level diagram attributes, such as symmetry and alignment. We include preliminary usability observations to help identify areas of strength and weakness with this approach.","accessed":{"date-parts":[[2020,8,21]]},"author":[{"family":"Zeleznik","given":"Robert C."},{"family":"Bragdon","given":"Andrew"},{"family":"Liu","given":"Chu-Chi"},{"family":"Forsberg","given":"Andrew"}],"collection-title":"UIST '08","container-title":"Proceedings of the 21st annual ACM symposium on User interface software and technology","DOI":"10.1145/1449715.1449741","event-place":"New York, NY, USA","ISBN":"978-1-59593-975-3","issued":{"date-parts":[[2008,10,19]]},"page":"161–170","publisher":"Association for Computing Machinery","publisher-place":"New York, NY, USA","source":"ACM Digital Library","title":"Lineogrammer: creating diagrams by drawing","title-short":"Lineogrammer","type":"paper-conference","URL":"https://doi.org/10.1145/1449715.1449741"}
]
